let arrayModel =  [['Телефон', 'Z3'],['Телефон', 'Z'],['Телефон', 'Galaxy Core LTE'],['Телефон', 'W2017'],['Телефон', 'Gear S'],['Телефон', 'Galaxy Young Duos '],['Телефон', 'Galaxy Young 2'],['Телефон', 'Galaxy Xcover 4'],['Телефон', 'Galaxy Xcover 3'],['Телефон', 'Galaxy Xcover 2'],['Телефон', 'Galaxy Win Duos'],['Телефон', 'Galaxy Win'],['Телефон', 'Galaxy Trend Plus'],['Телефон', 'GALAXY Trend'],['Телефон', 'Galaxy Star Plus '],['Телефон', 'Galaxy Star Duos'],['Телефон', 'Galaxy Star Advance Duos'],['Телефон', 'Galaxy Star'],['Телефон', 'Galaxy S9 Plus'],['Телефон', 'Galaxy S9'],['Телефон', 'Galaxy S8 Plus'],['Телефон', 'Galaxy S8 Active'],['Телефон', 'Galaxy S7 Active'],['Телефон', 'Galaxy S7'],['Телефон', 'Galaxy S6 Edge Plus'],['Телефон', 'Galaxy S6 Edge'],['Телефон', 'Galaxy S6 Duos'],['Телефон', 'Galaxy S6 Active'],['Телефон', 'Galaxy S6'],['Телефон', 'Galaxy S5 Mini Duos'],['Телефон', 'Galaxy S5 mini'],['Телефон', 'Galaxy S5 Duos'],['Телефон', 'Galaxy S5 Active'],['Телефон', 'Galaxy S5'],['Телефон', 'Galaxy S4 Zoom'],['Телефон', 'Galaxy S4 Mini Plus'],['Телефон', 'Galaxy S4 Mini Duos '],['Телефон', 'Galaxy S4 Mini'],['Телефон', 'Galaxy S4 Duos'],['Телефон', 'Galaxy S4 Active'],['Телефон', 'Galaxy S4'],['Телефон', 'Galaxy S3 Neo'],['Телефон', 'Galaxy S3 mini VE'],['Телефон', 'Galaxy S3 mini'],['Телефон', 'Galaxy S3 Duos'],['Телефон', 'Galaxy S2 Plus'],['Телефон', 'Galaxy S10e'],['Телефон', 'Galaxy S10+'],['Телефон', 'Galaxy S10'],['Телефон', 'Galaxy S Relay 4G'],['Телефон', 'Galaxy S Duos 2'],['Телефон', 'Galaxy S Duos'],['Телефон', 'Galaxy Premier'],['Телефон', 'Galaxy Pocket Neo '],['Телефон', 'Galaxy Player 5.8'],['Телефон', 'Galaxy Note9'],['Телефон', 'Galaxy Note8'],['Телефон', 'Galaxy Note10+'],['Телефон', 'Galaxy Note10'],['Телефон', 'Galaxy Note Edge'],['Телефон', 'Galaxy Note 7'],['Телефон', 'Galaxy Note 5'],['Телефон', 'Galaxy Note 4 DUOS'],['Телефон', 'Galaxy Note 4'],['Телефон', 'Galaxy Note 3 Neo Duos'],['Телефон', 'Galaxy Note 3 Neo'],['Телефон', 'Galaxy Note 3 Dual Sim'],['Телефон', 'Galaxy Note 3'],['Телефон', 'Galaxy Note 2'],['Телефон', 'Galaxy Note'],['Телефон', 'Galaxy Music'],['Телефон', 'Galaxy Mega 6.3'],['Телефон', 'Galaxy Mega 5.8 Plus'],['Телефон', 'Galaxy Mega 5.8 Duos'],['Телефон', 'Galaxy Mega 2'],['Телефон', 'Galaxy M30s'],['Телефон', 'Galaxy M20'],['Телефон', 'Galaxy M10'],['Телефон', 'Galaxy K Zoom '],['Телефон', 'Galaxy J8 '],['Телефон', 'Galaxy J7 Prime'],['Телефон', 'Galaxy J7 Plus'],['Телефон', 'Galaxy J7 Neo'],['Телефон', 'Galaxy J7 Dual Sim'],['Телефон', 'Galaxy J7 (2017)'],['Телефон', 'Galaxy J7 (2016)'],['Телефон', 'Galaxy J6+'],['Телефон', 'Galaxy J6 (2018)'],['Телефон', 'Galaxy J5 Prime'],['Телефон', 'Galaxy J5 (2017)'],['Телефон', 'Galaxy J5 (2016)'],['Телефон', 'Galaxy J5'],['Телефон', 'Galaxy J4+'],['Телефон', 'Galaxy J3 (2017)'],['Телефон', 'Galaxy J3 (2016)'],['Телефон', 'Galaxy J2 Prime'],['Телефон', 'Galaxy J2 Core 2018 '],['Телефон', 'Galaxy J2 (2018)'],['Телефон', 'Galaxy J2'],['Телефон', 'Galaxy J1 Mini Prime (2016) SM-J106F/DS'],['Телефон', 'Galaxy J1 mini'],['Телефон', 'Galaxy J1 LTE'],['Телефон', 'Galaxy J1 (2016)'],['Телефон', 'Galaxy J1 '],['Телефон', 'Galaxy Grand Prime VE Duos'],['Телефон', 'Galaxy Grand Prime VE'],['Телефон', 'Galaxy Grand Prime'],['Телефон', 'Galaxy Grand Neo Plus'],['Телефон', 'Galaxy Grand Neo '],['Телефон', 'Galaxy Grand Duos'],['Телефон', 'Galaxy Grand 2'],['Телефон', 'Galaxy Fame '],['Телефон', 'Galaxy E7'],['Телефон', 'Galaxy E5 Duos'],['Телефон', 'Galaxy Core Prime VE'],['Телефон', 'Galaxy Core Prime'],['Телефон', 'Galaxy Core Plus'],['Телефон', 'Galaxy Core 2 Duos'],['Телефон', 'Galaxy Core'],['Телефон', 'Galaxy Chat'],['Телефон', 'Galaxy Camera'],['Телефон', 'Galaxy C9 Pro'],['Телефон', 'Galaxy C7 Pro'],['Телефон', 'Galaxy C5 Pro'],['Телефон', 'Galaxy C5'],['Телефон', 'Galaxy Alpha'],['Телефон', 'Galaxy Admire 4G'],['Телефон', 'Galaxy Ace Style LTE'],['Телефон', 'Galaxy Ace 4 Neo'],['Телефон', 'Galaxy Ace 4 Lite Duos'],['Телефон', 'Galaxy Ace 4'],['Телефон', 'Galaxy Ace 3 Duos'],['Телефон', 'Galaxy Ace 3'],['Телефон', 'Galaxy Ace'],['Телефон', 'Galaxy A9 Pro (2016)'],['Телефон', 'Galaxy A9 (2018)'],['Телефон', 'Galaxy A9 (2016)'],['Телефон', 'Galaxy A8s'],['Телефон', 'Galaxy A80s'],['Телефон', 'Galaxy A80'],['Телефон', 'Galaxy A8+ (2018)'],['Телефон', 'Galaxy A8 Duos'],['Телефон', 'Galaxy A8 (2018)'],['Телефон', 'Galaxy A8 (2016)'],['Телефон', 'Galaxy A8'],['Телефон', 'Galaxy A70'],['Телефон', 'Galaxy A7 (2018)'],['Телефон', 'Galaxy A7 (2017)'],['Телефон', 'Galaxy A7 (2016)'],['Телефон', 'Galaxy A7'],['Телефон', 'Galaxy A60'],['Телефон', 'Galaxy A6+'],['Телефон', 'Galaxy A6'],['Телефон', 'Galaxy A51'],['Телефон', 'Galaxy A50'],['Телефон', 'Galaxy A5 (2017)'],['Телефон', 'Galaxy A5 (2016)'],['Телефон', 'Galaxy A5'],['Телефон', 'Galaxy A40'],['Телефон', 'Galaxy A30s'],['Телефон', 'Galaxy A30 SM-A305FD'],['Телефон', 'Galaxy A3 (2016)'],['Телефон', 'Galaxy A3 (2017)'],['Телефон', 'Galaxy A3'],['Телефон', 'Galaxy A20s'],['Телефон', 'Galaxy A20'],['Телефон', 'Galaxy A10 '],['Телефон', 'Galaxy J4 (2018)'],['Телефон', 'Ativ S'],] ;

let priceService = [['Восстановление после попадания воды', 'Z3', ' 900', ' 120'],['Замена аккумулятора', 'Z3', ' 1200', ' 75'],['Замена датчика приближения', 'Z3', ' 1300', ' 90'],['Замена динамика/звонка', 'Z3', ' 1200', ' 90'],['Замена дисплея', 'Z3', ' 2700', ' 90'],['Восстановление после попадания воды', 'Z', ' 900', ' 120'],['Замена аккумулятора', 'Z', ' 1200', ' 75'],['Замена датчика приближения', 'Z', ' 1300', ' 90'],['Замена динамика/звонка', 'Z', ' 1200', ' 90'],['Замена дисплея', 'Z', ' 2700', ' 90'],['Восстановление после попадания воды', 'Galaxy Core LTE', ' 1050', ' 120'],['Замена аккумулятора', 'Galaxy Core LTE', ' 1200', ' 75'],['Замена датчика приближения', 'Galaxy Core LTE', ' 1200', ' 90'],['Замена динамика/звонка', 'Galaxy Core LTE', ' 1200', ' 90'],['Замена дисплея', 'Galaxy Core LTE', ' 1600', ' 90'],['Восстановление после попадания воды', 'W2017', ' 1050', ' 120'],['Замена аккумулятора', 'W2017', ' 1600', ' 75'],['Замена датчика приближения', 'W2017', ' 1350', ' 90'],['Замена динамика/звонка', 'W2017', ' 1200', ' 90'],['Замена дисплея', 'W2017', ' 2350', ' 90'],['Восстановление после попадания воды', 'Gear S', ' 1000', ' 120'],['Замена аккумулятора', 'Gear S', ' 1500', ' 75'],['Замена датчика приближения', 'Gear S', ' 1200', ' 90'],['Замена динамика/звонка', 'Gear S', ' 1200', ' 90'],['Замена дисплея', 'Gear S', ' 2350', ' 90'],['Восстановление после попадания воды', 'Galaxy Young Duos ', ' 1050', ' 120'],['Замена аккумулятора', 'Galaxy Young Duos ', ' 1200', ' 75'],['Замена датчика приближения', 'Galaxy Young Duos ', ' 1200', ' 90'],['Замена динамика/звонка', 'Galaxy Young Duos ', ' 1200', ' 90'],['Замена дисплея', 'Galaxy Young Duos ', ' 1350', ' 90'],['Восстановление после попадания воды', 'Galaxy Young 2', ' 1050', ' 120'],['Замена аккумулятора', 'Galaxy Young 2', ' 1200', ' 75'],['Замена датчика приближения', 'Galaxy Young 2', ' 1200', ' 90'],['Замена динамика/звонка', 'Galaxy Young 2', ' 1200', ' 90'],['Замена дисплея', 'Galaxy Young 2', ' 1450', ' 90'],['Восстановление после попадания воды', 'Galaxy Xcover 4', ' 1150', ' 120'],['Замена аккумулятора', 'Galaxy Xcover 4', ' 1900', ' 75'],['Замена датчика приближения', 'Galaxy Xcover 4', ' 1500', ' 90'],['Замена динамика/звонка', 'Galaxy Xcover 4', ' 1400', ' 90'],['Замена дисплея', 'Galaxy Xcover 4', ' 3200', ' 90'],['Восстановление после попадания воды', 'Galaxy Xcover 3', ' 1150', ' 120'],['Замена аккумулятора', 'Galaxy Xcover 3', ' 1700', ' 75'],['Замена датчика приближения', 'Galaxy Xcover 3', ' 1500', ' 90'],['Замена динамика/звонка', 'Galaxy Xcover 3', ' 1400', ' 90'],['Замена дисплея', 'Galaxy Xcover 3', ' 1800', ' 90'],['Восстановление после попадания воды', 'Galaxy Xcover 2', ' 1100', ' 120'],['Замена аккумулятора', 'Galaxy Xcover 2', ' 1700', ' 75'],['Замена датчика приближения', 'Galaxy Xcover 2', ' 1500', ' 90'],['Замена динамика/звонка', 'Galaxy Xcover 2', ' 1400', ' 90'],['Замена дисплея', 'Galaxy Xcover 2', ' 1800', ' 90'],['Восстановление после попадания воды', 'Galaxy Win Duos', ' 1050', ' 120'],['Замена аккумулятора', 'Galaxy Win Duos', ' 1200', ' 75'],['Замена датчика приближения', 'Galaxy Win Duos', ' 1200', ' 90'],['Замена динамика/звонка', 'Galaxy Win Duos', ' 1200', ' 90'],['Замена дисплея', 'Galaxy Win Duos', ' 1550', ' 90'],['Восстановление после попадания воды', 'Galaxy Win', ' 1050', ' 120'],['Замена аккумулятора', 'Galaxy Win', ' 1200', ' 75'],['Замена датчика приближения', 'Galaxy Win', ' 1200', ' 90'],['Замена динамика/звонка', 'Galaxy Win', ' 1200', ' 90'],['Замена дисплея', 'Galaxy Win', ' 1550', ' 90'],['Восстановление после попадания воды', 'Galaxy Trend Plus', ' 1050', ' 120'],['Замена аккумулятора', 'Galaxy Trend Plus', ' 1200', ' 75'],['Замена датчика приближения', 'Galaxy Trend Plus', ' 1200', ' 90'],['Замена динамика/звонка', 'Galaxy Trend Plus', ' 1200', ' 90'],['Замена дисплея', 'Galaxy Trend Plus', ' 1650', ' 90'],['Восстановление после попадания воды', 'GALAXY Trend', ' 1050', ' 120'],['Замена аккумулятора', 'GALAXY Trend', ' 1200', ' 75'],['Замена датчика приближения', 'GALAXY Trend', ' 1200', ' 90'],['Замена динамика/звонка', 'GALAXY Trend', ' 1200', ' 90'],['Замена дисплея', 'GALAXY Trend', ' 1650', ' 90'],['Восстановление после попадания воды', 'Galaxy Star Plus ', ' 1050', ' 120'],['Замена аккумулятора', 'Galaxy Star Plus ', ' 1200', ' 75'],['Замена датчика приближения', 'Galaxy Star Plus ', ' 1200', ' 90'],['Замена динамика/звонка', 'Galaxy Star Plus ', ' 1200', ' 90'],['Замена дисплея', 'Galaxy Star Plus ', ' 1550', ' 90'],['Восстановление после попадания воды', 'Galaxy Star Duos', ' 1050', ' 120'],['Замена аккумулятора', 'Galaxy Star Duos', ' 1200', ' 75'],['Замена датчика приближения', 'Galaxy Star Duos', ' 1200', ' 90'],['Замена динамика/звонка', 'Galaxy Star Duos', ' 1200', ' 90'],['Замена дисплея', 'Galaxy Star Duos', ' 1550', ' 90'],['Восстановление после попадания воды', 'Galaxy Star Advance Duos', ' 1050', ' 120'],['Замена аккумулятора', 'Galaxy Star Advance Duos', ' 1200', ' 75'],['Замена датчика приближения', 'Galaxy Star Advance Duos', ' 1200', ' 90'],['Замена динамика/звонка', 'Galaxy Star Advance Duos', ' 1200', ' 90'],['Замена дисплея', 'Galaxy Star Advance Duos', ' 1600', ' 90'],['Восстановление после попадания воды', 'Galaxy Star', ' 1050', ' 120'],['Замена аккумулятора', 'Galaxy Star', ' 1200', ' 75'],['Замена датчика приближения', 'Galaxy Star', ' 1200', ' 90'],['Замена динамика/звонка', 'Galaxy Star', ' 1200', ' 90'],['Замена дисплея', 'Galaxy Star', ' 1600', ' 90'],['Восстановление после попадания воды', 'Galaxy S9 Plus', ' 1250', ' 120'],['Замена аккумулятора', 'Galaxy S9 Plus', ' 1900', ' 75'],['Замена датчика приближения', 'Galaxy S9 Plus', ' 1600', ' 90'],['Замена динамика/звонка', 'Galaxy S9 Plus', ' 1450', ' 90'],['Замена дисплея', 'Galaxy S9 Plus', ' 17600', ' 90'],['Восстановление после попадания воды', 'Galaxy S9', ' 1250', ' 120'],['Замена аккумулятора', 'Galaxy S9', ' 1800', ' 75'],['Замена датчика приближения', 'Galaxy S9', ' 1600', ' 90'],['Замена динамика/звонка', 'Galaxy S9', ' 1450', ' 90'],['Замена дисплея', 'Galaxy S9', ' 17350', ' 90'],['Восстановление после попадания воды', 'Galaxy S8 Plus', ' 1250', ' 120'],['Замена аккумулятора', 'Galaxy S8 Plus', ' 1800', ' 75'],['Замена датчика приближения', 'Galaxy S8 Plus', ' 1600', ' 90'],['Замена динамика/звонка', 'Galaxy S8 Plus', ' 1350', ' 90'],['Замена дисплея', 'Galaxy S8 Plus', ' 16900', ' 90'],['Восстановление после попадания воды', 'Galaxy S8 Active', ' 1250', ' 120'],['Замена аккумулятора', 'Galaxy S8 Active', ' 1800', ' 75'],['Замена датчика приближения', 'Galaxy S8 Active', ' 1600', ' 90'],['Замена динамика/звонка', 'Galaxy S8 Active', ' 1350', ' 90'],['Замена дисплея', 'Galaxy S8 Active', ' 16900', ' 90'],['Восстановление после попадания воды', 'Galaxy S7 Active', ' 1250', ' 120'],['Замена аккумулятора', 'Galaxy S7 Active', ' 1700', ' 75'],['Замена датчика приближения', 'Galaxy S7 Active', ' 1500', ' 90'],['Замена динамика/звонка', 'Galaxy S7 Active', ' 1350', ' 90'],['Замена дисплея', 'Galaxy S7 Active', ' 13000', ' 90'],['Восстановление после попадания воды', 'Galaxy S7', ' 1250', ' 120'],['Замена аккумулятора', 'Galaxy S7', ' 1700', ' 75'],['Замена датчика приближения', 'Galaxy S7', ' 1500', ' 90'],['Замена динамика/звонка', 'Galaxy S7', ' 1350', ' 90'],['Замена дисплея', 'Galaxy S7', ' 8350', ' 90'],['Восстановление после попадания воды', 'Galaxy S6 Edge Plus', ' 1250', ' 120'],['Замена аккумулятора', 'Galaxy S6 Edge Plus', ' 1600', ' 75'],['Замена датчика приближения', 'Galaxy S6 Edge Plus', ' 1450', ' 90'],['Замена динамика/звонка', 'Galaxy S6 Edge Plus', ' 1350', ' 90'],['Замена дисплея', 'Galaxy S6 Edge Plus', ' 8350', ' 90'],['Восстановление после попадания воды', 'Galaxy S6 Edge', ' 1100', ' 120'],['Замена аккумулятора', 'Galaxy S6 Edge', ' 1600', ' 75'],['Замена датчика приближения', 'Galaxy S6 Edge', ' 1450', ' 90'],['Замена динамика/звонка', 'Galaxy S6 Edge', ' 1350', ' 90'],['Замена дисплея', 'Galaxy S6 Edge', ' 6700', ' 90'],['Восстановление после попадания воды', 'Galaxy S6 Duos', ' 1100', ' 120'],['Замена аккумулятора', 'Galaxy S6 Duos', ' 1600', ' 75'],['Замена датчика приближения', 'Galaxy S6 Duos', ' 1400', ' 90'],['Замена динамика/звонка', 'Galaxy S6 Duos', ' 1350', ' 90'],['Замена дисплея', 'Galaxy S6 Duos', ' 7300', ' 90'],['Восстановление после попадания воды', 'Galaxy S6 Active', ' 1100', ' 120'],['Замена аккумулятора', 'Galaxy S6 Active', ' 1600', ' 75'],['Замена датчика приближения', 'Galaxy S6 Active', ' 1400', ' 90'],['Замена динамика/звонка', 'Galaxy S6 Active', ' 1350', ' 90'],['Замена дисплея', 'Galaxy S6 Active', ' 7000', ' 90'],['Восстановление после попадания воды', 'Galaxy S6', ' 1100', ' 120'],['Замена аккумулятора', 'Galaxy S6', ' 1600', ' 75'],['Замена датчика приближения', 'Galaxy S6', ' 1400', ' 90'],['Замена динамика/звонка', 'Galaxy S6', ' 1350', ' 90'],['Замена дисплея', 'Galaxy S6', ' 7300', ' 90'],['Восстановление после попадания воды', 'Galaxy S5 Mini Duos', ' 1100', ' 120'],['Замена аккумулятора', 'Galaxy S5 Mini Duos', ' 1350', ' 75'],['Замена датчика приближения', 'Galaxy S5 Mini Duos', ' 1350', ' 90'],['Замена динамика/звонка', 'Galaxy S5 Mini Duos', ' 1200', ' 90'],['Замена дисплея', 'Galaxy S5 Mini Duos', ' 6200', ' 90'],['Восстановление после попадания воды', 'Galaxy S5 mini', ' 1100', ' 120'],['Замена аккумулятора', 'Galaxy S5 mini', ' 1350', ' 75'],['Замена датчика приближения', 'Galaxy S5 mini', ' 1350', ' 90'],['Замена динамика/звонка', 'Galaxy S5 mini', ' 1200', ' 90'],['Замена дисплея', 'Galaxy S5 mini', ' 6200', ' 90'],['Восстановление после попадания воды', 'Galaxy S5 Duos', ' 1100', ' 120'],['Замена аккумулятора', 'Galaxy S5 Duos', ' 1350', ' 75'],['Замена датчика приближения', 'Galaxy S5 Duos', ' 1350', ' 90'],['Замена динамика/звонка', 'Galaxy S5 Duos', ' 1200', ' 90'],['Замена дисплея', 'Galaxy S5 Duos', ' 4350', ' 90'],['Восстановление после попадания воды', 'Galaxy S5 Active', ' 1100', ' 120'],['Замена аккумулятора', 'Galaxy S5 Active', ' 1350', ' 75'],['Замена датчика приближения', 'Galaxy S5 Active', ' 1350', ' 90'],['Замена динамика/звонка', 'Galaxy S5 Active', ' 1200', ' 90'],['Замена дисплея', 'Galaxy S5 Active', ' 4350', ' 90'],['Восстановление после попадания воды', 'Galaxy S5', ' 1100', ' 120'],['Замена аккумулятора', 'Galaxy S5', ' 1350', ' 75'],['Замена датчика приближения', 'Galaxy S5', ' 1350', ' 90'],['Замена динамика/звонка', 'Galaxy S5', ' 1200', ' 90'],['Замена дисплея', 'Galaxy S5', ' 4350', ' 90'],['Восстановление после попадания воды', 'Galaxy S4 Zoom', ' 1050', ' 120'],['Замена аккумулятора', 'Galaxy S4 Zoom', ' 1200', ' 75'],['Замена датчика приближения', 'Galaxy S4 Zoom', ' 1250', ' 90'],['Замена динамика/звонка', 'Galaxy S4 Zoom', ' 1200', ' 90'],['Замена дисплея', 'Galaxy S4 Zoom', ' 3600', ' 90'],['Восстановление после попадания воды', 'Galaxy S4 Mini Plus', ' 1000', ' 120'],['Замена аккумулятора', 'Galaxy S4 Mini Plus', ' 1200', ' 75'],['Замена датчика приближения', 'Galaxy S4 Mini Plus', ' 1250', ' 90'],['Замена динамика/звонка', 'Galaxy S4 Mini Plus', ' 1200', ' 90'],['Замена дисплея', 'Galaxy S4 Mini Plus', ' 3990', ' 90'],['Восстановление после попадания воды', 'Galaxy S4 Mini Duos ', ' 1000', ' 120'],['Замена аккумулятора', 'Galaxy S4 Mini Duos ', ' 1200', ' 75'],['Замена датчика приближения', 'Galaxy S4 Mini Duos ', ' 1250', ' 90'],['Замена динамика/звонка', 'Galaxy S4 Mini Duos ', ' 1200', ' 90'],['Замена дисплея', 'Galaxy S4 Mini Duos ', ' 3990', ' 90'],['Восстановление после попадания воды', 'Galaxy S4 Mini', ' 1000', ' 120'],['Замена аккумулятора', 'Galaxy S4 Mini', ' 1200', ' 75'],['Замена датчика приближения', 'Galaxy S4 Mini', ' 1250', ' 90'],['Замена динамика/звонка', 'Galaxy S4 Mini', ' 1200', ' 90'],['Замена дисплея', 'Galaxy S4 Mini', ' 3990', ' 90'],['Восстановление после попадания воды', 'Galaxy S4 Duos', ' 1000', ' 120'],['Замена аккумулятора', 'Galaxy S4 Duos', ' 1200', ' 75'],['Замена датчика приближения', 'Galaxy S4 Duos', ' 1250', ' 90'],['Замена динамика/звонка', 'Galaxy S4 Duos', ' 1200', ' 90'],['Замена дисплея', 'Galaxy S4 Duos', ' 3600', ' 90'],['Восстановление после попадания воды', 'Galaxy S4 Active', ' 1000', ' 120'],['Замена аккумулятора', 'Galaxy S4 Active', ' 1200', ' 75'],['Замена датчика приближения', 'Galaxy S4 Active', ' 1250', ' 90'],['Замена динамика/звонка', 'Galaxy S4 Active', ' 1200', ' 90'],['Замена дисплея', 'Galaxy S4 Active', ' 3600', ' 90'],['Восстановление после попадания воды', 'Galaxy S4', ' 1000', ' 120'],['Замена аккумулятора', 'Galaxy S4', ' 1200', ' 75'],['Замена датчика приближения', 'Galaxy S4', ' 1250', ' 90'],['Замена динамика/звонка', 'Galaxy S4', ' 1200', ' 90'],['Замена дисплея', 'Galaxy S4', ' 3600', ' 90'],['Восстановление после попадания воды', 'Galaxy S3 Neo', ' 900', ' 120'],['Замена аккумулятора', 'Galaxy S3 Neo', ' 1200', ' 75'],['Замена датчика приближения', 'Galaxy S3 Neo', ' 1250', ' 90'],['Замена динамика/звонка', 'Galaxy S3 Neo', ' 1100', ' 90'],['Замена дисплея', 'Galaxy S3 Neo', ' 3600', ' 90'],['Восстановление после попадания воды', 'Galaxy S3 mini VE', ' 900', ' 120'],['Замена аккумулятора', 'Galaxy S3 mini VE', ' 1200', ' 75'],['Замена датчика приближения', 'Galaxy S3 mini VE', ' 1250', ' 90'],['Замена динамика/звонка', 'Galaxy S3 mini VE', ' 1100', ' 90'],['Замена дисплея', 'Galaxy S3 mini VE', ' 3600', ' 90'],['Восстановление после попадания воды', 'Galaxy S3 mini', ' 900', ' 120'],['Замена аккумулятора', 'Galaxy S3 mini', ' 1200', ' 75'],['Замена датчика приближения', 'Galaxy S3 mini', ' 1250', ' 90'],['Замена динамика/звонка', 'Galaxy S3 mini', ' 1100', ' 90'],['Замена дисплея', 'Galaxy S3 mini', ' 2100', ' 90'],['Восстановление после попадания воды', 'Galaxy S3 Duos', ' 900', ' 120'],['Замена аккумулятора', 'Galaxy S3 Duos', ' 1200', ' 75'],['Замена датчика приближения', 'Galaxy S3 Duos', ' 1250', ' 90'],['Замена динамика/звонка', 'Galaxy S3 Duos', ' 1100', ' 90'],['Замена дисплея', 'Galaxy S3 Duos', ' 3600', ' 90'],['Восстановление после попадания воды', 'Galaxy S2 Plus', ' 900', ' 120'],['Замена аккумулятора', 'Galaxy S2 Plus', ' 1200', ' 75'],['Замена датчика приближения', 'Galaxy S2 Plus', ' 1250', ' 90'],['Замена динамика/звонка', 'Galaxy S2 Plus', ' 1100', ' 90'],['Замена дисплея', 'Galaxy S2 Plus', ' 2990', ' 90'],['Восстановление после попадания воды', 'Galaxy S10e', ' 1300', ' 120'],['Замена аккумулятора', 'Galaxy S10e', ' 2000', ' 75'],['Замена датчика приближения', 'Galaxy S10e', ' 1700', ' 90'],['Замена динамика/звонка', 'Galaxy S10e', ' 1600', ' 90'],['Замена дисплея', 'Galaxy S10e', ' 15350', ' 90'],['Восстановление после попадания воды', 'Galaxy S10+', ' 1300', ' 120'],['Замена аккумулятора', 'Galaxy S10+', ' 2300', ' 75'],['Замена датчика приближения', 'Galaxy S10+', ' 1800', ' 90'],['Замена динамика/звонка', 'Galaxy S10+', ' 1650', ' 90'],['Замена дисплея', 'Galaxy S10+', ' 19500', ' 90'],['Восстановление после попадания воды', 'Galaxy S10', ' 1300', ' 120'],['Замена аккумулятора', 'Galaxy S10', ' 2300', ' 75'],['Замена датчика приближения', 'Galaxy S10', ' 1900', ' 90'],['Замена динамика/звонка', 'Galaxy S10', ' 1650', ' 90'],['Замена дисплея', 'Galaxy S10', ' 18000', ' 90'],['Восстановление после попадания воды', 'Galaxy S Relay 4G', ' 1000', ' 120'],['Замена аккумулятора', 'Galaxy S Relay 4G', ' 1200', ' 75'],['Замена датчика приближения', 'Galaxy S Relay 4G', ' 1200', ' 90'],['Замена динамика/звонка', 'Galaxy S Relay 4G', ' 1200', ' 90'],['Замена дисплея', 'Galaxy S Relay 4G', ' 2800', ' 90'],['Восстановление после попадания воды', 'Galaxy S Duos 2', ' 1000', ' 120'],['Замена аккумулятора', 'Galaxy S Duos 2', ' 1200', ' 75'],['Замена датчика приближения', 'Galaxy S Duos 2', ' 1200', ' 90'],['Замена динамика/звонка', 'Galaxy S Duos 2', ' 1200', ' 90'],['Замена дисплея', 'Galaxy S Duos 2', ' 2800', ' 90'],['Восстановление после попадания воды', 'Galaxy S Duos', ' 1000', ' 120'],['Замена аккумулятора', 'Galaxy S Duos', ' 1200', ' 75'],['Замена датчика приближения', 'Galaxy S Duos', ' 1200', ' 90'],['Замена динамика/звонка', 'Galaxy S Duos', ' 1200', ' 90'],['Замена дисплея', 'Galaxy S Duos', ' 2800', ' 90'],['Восстановление после попадания воды', 'Galaxy Premier', ' 1000', ' 120'],['Замена аккумулятора', 'Galaxy Premier', ' 1200', ' 75'],['Замена датчика приближения', 'Galaxy Premier', ' 1200', ' 90'],['Замена динамика/звонка', 'Galaxy Premier', ' 1200', ' 90'],['Замена дисплея', 'Galaxy Premier', ' 2900', ' 90'],['Восстановление после попадания воды', 'Galaxy Pocket Neo ', ' 1000', ' 120'],['Замена аккумулятора', 'Galaxy Pocket Neo ', ' 1300', ' 75'],['Замена датчика приближения', 'Galaxy Pocket Neo ', ' 1200', ' 90'],['Замена динамика/звонка', 'Galaxy Pocket Neo ', ' 1200', ' 90'],['Замена дисплея', 'Galaxy Pocket Neo ', ' 1990', ' 90'],['Восстановление после попадания воды', 'Galaxy Player 5.8', ' 1000', ' 120'],['Замена аккумулятора', 'Galaxy Player 5.8', ' 1300', ' 75'],['Замена датчика приближения', 'Galaxy Player 5.8', ' 1200', ' 90'],['Замена динамика/звонка', 'Galaxy Player 5.8', ' 1200', ' 90'],['Замена дисплея', 'Galaxy Player 5.8', ' 1990', ' 90'],['Восстановление после попадания воды', 'Galaxy Note9', ' 1300', ' 120'],['Замена аккумулятора', 'Galaxy Note9', ' 1800', ' 75'],['Замена датчика приближения', 'Galaxy Note9', ' 1700', ' 90'],['Замена динамика/звонка', 'Galaxy Note9', ' 1600', ' 90'],['Замена дисплея', 'Galaxy Note9', ' 19000', ' 90'],['Восстановление после попадания воды', 'Galaxy Note8', ' 1300', ' 120'],['Замена аккумулятора', 'Galaxy Note8', ' 1800', ' 75'],['Замена датчика приближения', 'Galaxy Note8', ' 1600', ' 90'],['Замена динамика/звонка', 'Galaxy Note8', ' 1600', ' 90'],['Замена дисплея', 'Galaxy Note8', ' 18500', ' 90'],['Восстановление после попадания воды', 'Galaxy Note10+', ' 1500', ' 120'],['Замена аккумулятора', 'Galaxy Note10+', ' 2250', ' 75'],['Замена датчика приближения', 'Galaxy Note10+', ' 2100', ' 90'],['Замена динамика/звонка', 'Galaxy Note10+', ' 1900', ' 90'],['Замена дисплея', 'Galaxy Note10+', ' 23000', ' 90'],['Восстановление после попадания воды', 'Galaxy Note10', ' 1500', ' 120'],['Замена аккумулятора', 'Galaxy Note10', ' 2250', ' 75'],['Замена датчика приближения', 'Galaxy Note10', ' 2100', ' 90'],['Замена динамика/звонка', 'Galaxy Note10', ' 1900', ' 90'],['Замена дисплея', 'Galaxy Note10', ' 22000', ' 90'],['Восстановление после попадания воды', 'Galaxy Note Edge', ' 1300', ' 120'],['Замена аккумулятора', 'Galaxy Note Edge', ' 1300', ' 75'],['Замена датчика приближения', 'Galaxy Note Edge', ' 1200', ' 90'],['Замена динамика/звонка', 'Galaxy Note Edge', ' 1300', ' 90'],['Замена дисплея', 'Galaxy Note Edge', ' 9900', ' 90'],['Восстановление после попадания воды', 'Galaxy Note 7', ' 1200', ' 120'],['Замена аккумулятора', 'Galaxy Note 7', ' 1600', ' 75'],['Замена датчика приближения', 'Galaxy Note 7', ' 1600', ' 90'],['Замена динамика/звонка', 'Galaxy Note 7', ' 1600', ' 90'],['Замена дисплея', 'Galaxy Note 7', ' 9900', ' 90'],['Восстановление после попадания воды', 'Galaxy Note 5', ' 1200', ' 120'],['Замена аккумулятора', 'Galaxy Note 5', ' 1600', ' 75'],['Замена датчика приближения', 'Galaxy Note 5', ' 1500', ' 90'],['Замена динамика/звонка', 'Galaxy Note 5', ' 1400', ' 90'],['Замена дисплея', 'Galaxy Note 5', ' 8900', ' 90'],['Восстановление после попадания воды', 'Galaxy Note 4 DUOS', ' 1100', ' 120'],['Замена аккумулятора', 'Galaxy Note 4 DUOS', ' 1500', ' 75'],['Замена датчика приближения', 'Galaxy Note 4 DUOS', ' 1400', ' 90'],['Замена динамика/звонка', 'Galaxy Note 4 DUOS', ' 1400', ' 90'],['Замена дисплея', 'Galaxy Note 4 DUOS', ' 7300', ' 90'],['Восстановление после попадания воды', 'Galaxy Note 4', ' 1100', ' 120'],['Замена аккумулятора', 'Galaxy Note 4', ' 1500', ' 75'],['Замена датчика приближения', 'Galaxy Note 4', ' 1400', ' 90'],['Замена динамика/звонка', 'Galaxy Note 4', ' 1400', ' 90'],['Замена дисплея', 'Galaxy Note 4', ' 7300', ' 90'],['Восстановление после попадания воды', 'Galaxy Note 3 Neo Duos', ' 1100', ' 120'],['Замена аккумулятора', 'Galaxy Note 3 Neo Duos', ' 1200', ' 75'],['Замена датчика приближения', 'Galaxy Note 3 Neo Duos', ' 1200', ' 90'],['Замена динамика/звонка', 'Galaxy Note 3 Neo Duos', ' 1200', ' 90'],['Замена дисплея', 'Galaxy Note 3 Neo Duos', ' 3500', ' 90'],['Восстановление после попадания воды', 'Galaxy Note 3 Neo', ' 1100', ' 120'],['Замена аккумулятора', 'Galaxy Note 3 Neo', ' 1200', ' 75'],['Замена датчика приближения', 'Galaxy Note 3 Neo', ' 1200', ' 90'],['Замена динамика/звонка', 'Galaxy Note 3 Neo', ' 1200', ' 90'],['Замена дисплея', 'Galaxy Note 3 Neo', ' 3500', ' 90'],['Восстановление после попадания воды', 'Galaxy Note 3 Dual Sim', ' 1100', ' 120'],['Замена аккумулятора', 'Galaxy Note 3 Dual Sim', ' 1200', ' 75'],['Замена датчика приближения', 'Galaxy Note 3 Dual Sim', ' 1200', ' 90'],['Замена динамика/звонка', 'Galaxy Note 3 Dual Sim', ' 1200', ' 90'],['Замена дисплея', 'Galaxy Note 3 Dual Sim', ' 3500', ' 90'],['Восстановление после попадания воды', 'Galaxy Note 3', ' 1100', ' 120'],['Замена аккумулятора', 'Galaxy Note 3', ' 1200', ' 75'],['Замена датчика приближения', 'Galaxy Note 3', ' 1200', ' 90'],['Замена динамика/звонка', 'Galaxy Note 3', ' 1200', ' 90'],['Замена дисплея', 'Galaxy Note 3', ' 3500', ' 90'],['Восстановление после попадания воды', 'Galaxy Note 2', ' 1100', ' 120'],['Замена аккумулятора', 'Galaxy Note 2', ' 1200', ' 75'],['Замена датчика приближения', 'Galaxy Note 2', ' 1200', ' 90'],['Замена динамика/звонка', 'Galaxy Note 2', ' 1200', ' 90'],['Замена дисплея', 'Galaxy Note 2', ' 3990', ' 90'],['Восстановление после попадания воды', 'Galaxy Note', ' 1000', ' 120'],['Замена аккумулятора', 'Galaxy Note', ' 1200', ' 75'],['Замена датчика приближения', 'Galaxy Note', ' 1200', ' 90'],['Замена динамика/звонка', 'Galaxy Note', ' 1200', ' 90'],['Замена дисплея', 'Galaxy Note', ' 3900', ' 90'],['Восстановление после попадания воды', 'Galaxy Music', ' 1000', ' 120'],['Замена аккумулятора', 'Galaxy Music', ' 1200', ' 75'],['Замена датчика приближения', 'Galaxy Music', ' 1200', ' 90'],['Замена динамика/звонка', 'Galaxy Music', ' 1200', ' 90'],['Замена дисплея', 'Galaxy Music', ' 1700', ' 90'],['Восстановление после попадания воды', 'Galaxy Mega 6.3', ' 1100', ' 120'],['Замена аккумулятора', 'Galaxy Mega 6.3', ' 1200', ' 75'],['Замена датчика приближения', 'Galaxy Mega 6.3', ' 1200', ' 90'],['Замена динамика/звонка', 'Galaxy Mega 6.3', ' 1200', ' 90'],['Замена дисплея', 'Galaxy Mega 6.3', ' 3400', ' 90'],['Восстановление после попадания воды', 'Galaxy Mega 5.8 Plus', ' 1100', ' 120'],['Замена аккумулятора', 'Galaxy Mega 5.8 Plus', ' 1200', ' 75'],['Замена датчика приближения', 'Galaxy Mega 5.8 Plus', ' 1200', ' 90'],['Замена динамика/звонка', 'Galaxy Mega 5.8 Plus', ' 1200', ' 90'],['Замена дисплея', 'Galaxy Mega 5.8 Plus', ' 2600', ' 90'],['Восстановление после попадания воды', 'Galaxy Mega 5.8 Duos', ' 1100', ' 120'],['Замена аккумулятора', 'Galaxy Mega 5.8 Duos', ' 1200', ' 75'],['Замена датчика приближения', 'Galaxy Mega 5.8 Duos', ' 1200', ' 90'],['Замена динамика/звонка', 'Galaxy Mega 5.8 Duos', ' 1200', ' 90'],['Замена дисплея', 'Galaxy Mega 5.8 Duos', ' 2600', ' 90'],['Восстановление после попадания воды', 'Galaxy Mega 2', ' 1100', ' 120'],['Замена аккумулятора', 'Galaxy Mega 2', ' 1200', ' 75'],['Замена датчика приближения', 'Galaxy Mega 2', ' 1200', ' 90'],['Замена динамика/звонка', 'Galaxy Mega 2', ' 1200', ' 90'],['Замена дисплея', 'Galaxy Mega 2', ' 3400', ' 90'],['Восстановление после попадания воды', 'Galaxy M30s', ' 1100', ' 120'],['Замена аккумулятора', 'Galaxy M30s', ' 1700', ' 75'],['Замена датчика приближения', 'Galaxy M30s', ' 1475', ' 90'],['Замена динамика/звонка', 'Galaxy M30s', ' 1350', ' 90'],['Замена дисплея', 'Galaxy M30s', ' 6100', ' 90'],['Восстановление после попадания воды', 'Galaxy M20', ' 1100', ' 120'],['Замена аккумулятора', 'Galaxy M20', ' 1700', ' 75'],['Замена датчика приближения', 'Galaxy M20', ' 1455', ' 90'],['Замена динамика/звонка', 'Galaxy M20', ' 1350', ' 90'],['Замена дисплея', 'Galaxy M20', ' 3500', ' 90'],['Восстановление после попадания воды', 'Galaxy M10', ' 1100', ' 120'],['Замена аккумулятора', 'Galaxy M10', ' 1700', ' 75'],['Замена датчика приближения', 'Galaxy M10', ' 1450', ' 90'],['Замена динамика/звонка', 'Galaxy M10', ' 1350', ' 90'],['Замена дисплея', 'Galaxy M10', ' 3200', ' 90'],['Восстановление после попадания воды', 'Galaxy K Zoom ', ' 1100', ' 120'],['Замена аккумулятора', 'Galaxy K Zoom ', ' 1200', ' 75'],['Замена датчика приближения', 'Galaxy K Zoom ', ' 1200', ' 90'],['Замена динамика/звонка', 'Galaxy K Zoom ', ' 1200', ' 90'],['Замена дисплея', 'Galaxy K Zoom ', ' 4500', ' 90'],['Восстановление после попадания воды', 'Galaxy J8 ', ' 1150', ' 120'],['Замена аккумулятора', 'Galaxy J8 ', ' 1650', ' 75'],['Замена датчика приближения', 'Galaxy J8 ', ' 1450', ' 90'],['Замена динамика/звонка', 'Galaxy J8 ', ' 1350', ' 90'],['Замена дисплея', 'Galaxy J8 ', ' 7500', ' 90'],['Восстановление после попадания воды', 'Galaxy J7 Prime', ' 1100', ' 120'],['Замена аккумулятора', 'Galaxy J7 Prime', ' 1500', ' 75'],['Замена датчика приближения', 'Galaxy J7 Prime', ' 1450', ' 90'],['Замена динамика/звонка', 'Galaxy J7 Prime', ' 1350', ' 90'],['Замена дисплея', 'Galaxy J7 Prime', ' 3700', ' 90'],['Восстановление после попадания воды', 'Galaxy J7 Plus', ' 1100', ' 120'],['Замена аккумулятора', 'Galaxy J7 Plus', ' 1500', ' 75'],['Замена датчика приближения', 'Galaxy J7 Plus', ' 1450', ' 90'],['Замена динамика/звонка', 'Galaxy J7 Plus', ' 1350', ' 90'],['Замена дисплея', 'Galaxy J7 Plus', ' 3700', ' 90'],['Восстановление после попадания воды', 'Galaxy J7 Neo', ' 1000', ' 120'],['Замена аккумулятора', 'Galaxy J7 Neo', ' 1500', ' 75'],['Замена датчика приближения', 'Galaxy J7 Neo', ' 1450', ' 90'],['Замена динамика/звонка', 'Galaxy J7 Neo', ' 1350', ' 90'],['Замена дисплея', 'Galaxy J7 Neo', ' 3700', ' 90'],['Восстановление после попадания воды', 'Galaxy J7 Dual Sim', ' 1000', ' 120'],['Замена аккумулятора', 'Galaxy J7 Dual Sim', ' 1500', ' 75'],['Замена датчика приближения', 'Galaxy J7 Dual Sim', ' 1450', ' 90'],['Замена динамика/звонка', 'Galaxy J7 Dual Sim', ' 1350', ' 90'],['Замена дисплея', 'Galaxy J7 Dual Sim', ' 3700', ' 90'],['Восстановление после попадания воды', 'Galaxy J7 (2017)', ' 1000', ' 120'],['Замена аккумулятора', 'Galaxy J7 (2017)', ' 1500', ' 75'],['Замена датчика приближения', 'Galaxy J7 (2017)', ' 1450', ' 90'],['Замена динамика/звонка', 'Galaxy J7 (2017)', ' 1350', ' 90'],['Замена дисплея', 'Galaxy J7 (2017)', ' 3700', ' 90'],['Восстановление после попадания воды', 'Galaxy J7 (2016)', ' 1000', ' 120'],['Замена аккумулятора', 'Galaxy J7 (2016)', ' 1500', ' 75'],['Замена датчика приближения', 'Galaxy J7 (2016)', ' 1450', ' 90'],['Замена динамика/звонка', 'Galaxy J7 (2016)', ' 1350', ' 90'],['Замена дисплея', 'Galaxy J7 (2016)', ' 3700', ' 90'],['Восстановление после попадания воды', 'Galaxy J6+', ' 1000', ' 120'],['Замена аккумулятора', 'Galaxy J6+', ' 1600', ' 75'],['Замена датчика приближения', 'Galaxy J6+', ' 1450', ' 90'],['Замена динамика/звонка', 'Galaxy J6+', ' 1300', ' 90'],['Замена дисплея', 'Galaxy J6+', ' 2900', ' 90'],['Восстановление после попадания воды', 'Galaxy J6 (2018)', ' 1000', ' 120'],['Замена аккумулятора', 'Galaxy J6 (2018)', ' 1600', ' 75'],['Замена датчика приближения', 'Galaxy J6 (2018)', ' 1450', ' 90'],['Замена динамика/звонка', 'Galaxy J6 (2018)', ' 1300', ' 90'],['Замена дисплея', 'Galaxy J6 (2018)', ' 2700', ' 90'],['Восстановление после попадания воды', 'Galaxy J5 Prime', ' 1000', ' 120'],['Замена аккумулятора', 'Galaxy J5 Prime', ' 1500', ' 75'],['Замена датчика приближения', 'Galaxy J5 Prime', ' 1450', ' 90'],['Замена динамика/звонка', 'Galaxy J5 Prime', ' 1300', ' 90'],['Замена дисплея', 'Galaxy J5 Prime', ' 2400', ' 90'],['Восстановление после попадания воды', 'Galaxy J5 (2017)', ' 1000', ' 120'],['Замена аккумулятора', 'Galaxy J5 (2017)', ' 1500', ' 75'],['Замена датчика приближения', 'Galaxy J5 (2017)', ' 1450', ' 90'],['Замена динамика/звонка', 'Galaxy J5 (2017)', ' 1300', ' 90'],['Замена дисплея', 'Galaxy J5 (2017)', ' 3900', ' 90'],['Восстановление после попадания воды', 'Galaxy J5 (2016)', ' 1000', ' 120'],['Замена аккумулятора', 'Galaxy J5 (2016)', ' 1500', ' 75'],['Замена датчика приближения', 'Galaxy J5 (2016)', ' 1450', ' 90'],['Замена динамика/звонка', 'Galaxy J5 (2016)', ' 1300', ' 90'],['Замена дисплея', 'Galaxy J5 (2016)', ' 3800', ' 90'],['Восстановление после попадания воды', 'Galaxy J5', ' 1000', ' 120'],['Замена аккумулятора', 'Galaxy J5', ' 1500', ' 75'],['Замена датчика приближения', 'Galaxy J5', ' 1450', ' 90'],['Замена динамика/звонка', 'Galaxy J5', ' 1200', ' 90'],['Замена дисплея', 'Galaxy J5', ' 2800', ' 90'],['Восстановление после попадания воды', 'Galaxy J4+', ' 1000', ' 120'],['Замена аккумулятора', 'Galaxy J4+', ' 1550', ' 75'],['Замена датчика приближения', 'Galaxy J4+', ' 1450', ' 90'],['Замена динамика/звонка', 'Galaxy J4+', ' 1350', ' 90'],['Замена дисплея', 'Galaxy J4+', ' 2900', ' 90'],['Восстановление после попадания воды', 'Galaxy J3 (2017)', ' 1000', ' 120'],['Замена аккумулятора', 'Galaxy J3 (2017)', ' 1600', ' 75'],['Замена датчика приближения', 'Galaxy J3 (2017)', ' 1300', ' 90'],['Замена динамика/звонка', 'Galaxy J3 (2017)', ' 1350', ' 90'],['Замена дисплея', 'Galaxy J3 (2017)', ' 2400', ' 90'],['Восстановление после попадания воды', 'Galaxy J3 (2016)', ' 1000', ' 120'],['Замена аккумулятора', 'Galaxy J3 (2016)', ' 1500', ' 75'],['Замена датчика приближения', 'Galaxy J3 (2016)', ' 1300', ' 90'],['Замена динамика/звонка', 'Galaxy J3 (2016)', ' 1350', ' 90'],['Замена дисплея', 'Galaxy J3 (2016)', ' 1990', ' 90'],['Восстановление после попадания воды', 'Galaxy J2 Prime', ' 1000', ' 120'],['Замена аккумулятора', 'Galaxy J2 Prime', ' 1200', ' 75'],['Замена датчика приближения', 'Galaxy J2 Prime', ' 1200', ' 90'],['Замена динамика/звонка', 'Galaxy J2 Prime', ' 1200', ' 90'],['Замена дисплея', 'Galaxy J2 Prime', ' 2500', ' 90'],['Восстановление после попадания воды', 'Galaxy J2 Core 2018 ', ' 1000', ' 120'],['Замена аккумулятора', 'Galaxy J2 Core 2018 ', ' 1200', ' 75'],['Замена датчика приближения', 'Galaxy J2 Core 2018 ', ' 1200', ' 90'],['Замена динамика/звонка', 'Galaxy J2 Core 2018 ', ' 1200', ' 90'],['Замена дисплея', 'Galaxy J2 Core 2018 ', ' 2700', ' 90'],['Восстановление после попадания воды', 'Galaxy J2 (2018)', ' 1000', ' 120'],['Замена аккумулятора', 'Galaxy J2 (2018)', ' 1200', ' 75'],['Замена датчика приближения', 'Galaxy J2 (2018)', ' 1200', ' 90'],['Замена динамика/звонка', 'Galaxy J2 (2018)', ' 1200', ' 90'],['Замена дисплея', 'Galaxy J2 (2018)', ' 2100', ' 90'],['Восстановление после попадания воды', 'Galaxy J2', ' 1000', ' 120'],['Замена аккумулятора', 'Galaxy J2', ' 1200', ' 75'],['Замена датчика приближения', 'Galaxy J2', ' 1200', ' 90'],['Замена динамика/звонка', 'Galaxy J2', ' 1200', ' 90'],['Замена дисплея', 'Galaxy J2', ' 2100', ' 90'],['Восстановление после попадания воды', 'Galaxy J1 Mini Prime (2016) SM-J106F/DS', ' 1000', ' 120'],['Замена аккумулятора', 'Galaxy J1 Mini Prime (2016) SM-J106F/DS', ' 1200', ' 75'],['Замена датчика приближения', 'Galaxy J1 Mini Prime (2016) SM-J106F/DS', ' 1200', ' 90'],['Замена динамика/звонка', 'Galaxy J1 Mini Prime (2016) SM-J106F/DS', ' 1200', ' 90'],['Замена дисплея', 'Galaxy J1 Mini Prime (2016) SM-J106F/DS', ' 1600', ' 90'],['Восстановление после попадания воды', 'Galaxy J1 mini', ' 1000', ' 120'],['Замена аккумулятора', 'Galaxy J1 mini', ' 1200', ' 75'],['Замена датчика приближения', 'Galaxy J1 mini', ' 1200', ' 90'],['Замена динамика/звонка', 'Galaxy J1 mini', ' 1200', ' 90'],['Замена дисплея', 'Galaxy J1 mini', ' 1600', ' 90'],['Восстановление после попадания воды', 'Galaxy J1 LTE', ' 1000', ' 120'],['Замена аккумулятора', 'Galaxy J1 LTE', ' 1200', ' 75'],['Замена датчика приближения', 'Galaxy J1 LTE', ' 1200', ' 90'],['Замена динамика/звонка', 'Galaxy J1 LTE', ' 1200', ' 90'],['Замена дисплея', 'Galaxy J1 LTE', ' 1600', ' 90'],['Восстановление после попадания воды', 'Galaxy J1 (2016)', ' 1000', ' 120'],['Замена аккумулятора', 'Galaxy J1 (2016)', ' 1200', ' 75'],['Замена датчика приближения', 'Galaxy J1 (2016)', ' 1200', ' 90'],['Замена динамика/звонка', 'Galaxy J1 (2016)', ' 1200', ' 90'],['Замена дисплея', 'Galaxy J1 (2016)', ' 1600', ' 90'],['Восстановление после попадания воды', 'Galaxy J1 ', ' 1000', ' 120'],['Замена аккумулятора', 'Galaxy J1 ', ' 1200', ' 75'],['Замена датчика приближения', 'Galaxy J1 ', ' 1200', ' 90'],['Замена динамика/звонка', 'Galaxy J1 ', ' 1200', ' 90'],['Замена дисплея', 'Galaxy J1 ', ' 1600', ' 90'],['Восстановление после попадания воды', 'Galaxy Grand Prime VE Duos', ' 1000', ' 120'],['Замена аккумулятора', 'Galaxy Grand Prime VE Duos', ' 1200', ' 75'],['Замена датчика приближения', 'Galaxy Grand Prime VE Duos', ' 1200', ' 90'],['Замена динамика/звонка', 'Galaxy Grand Prime VE Duos', ' 1200', ' 90'],['Замена дисплея', 'Galaxy Grand Prime VE Duos', ' 1600', ' 90'],['Восстановление после попадания воды', 'Galaxy Grand Prime VE', ' 1000', ' 120'],['Замена аккумулятора', 'Galaxy Grand Prime VE', ' 1200', ' 75'],['Замена датчика приближения', 'Galaxy Grand Prime VE', ' 1200', ' 90'],['Замена динамика/звонка', 'Galaxy Grand Prime VE', ' 1200', ' 90'],['Замена дисплея', 'Galaxy Grand Prime VE', ' 1600', ' 90'],['Восстановление после попадания воды', 'Galaxy Grand Prime', ' 1000', ' 120'],['Замена аккумулятора', 'Galaxy Grand Prime', ' 1200', ' 75'],['Замена датчика приближения', 'Galaxy Grand Prime', ' 1200', ' 90'],['Замена динамика/звонка', 'Galaxy Grand Prime', ' 1200', ' 90'],['Замена дисплея', 'Galaxy Grand Prime', ' 1600', ' 90'],['Восстановление после попадания воды', 'Galaxy Grand Neo Plus', ' 1000', ' 120'],['Замена аккумулятора', 'Galaxy Grand Neo Plus', ' 1200', ' 75'],['Замена датчика приближения', 'Galaxy Grand Neo Plus', ' 1200', ' 90'],['Замена динамика/звонка', 'Galaxy Grand Neo Plus', ' 1200', ' 90'],['Замена дисплея', 'Galaxy Grand Neo Plus', ' 1600', ' 90'],['Восстановление после попадания воды', 'Galaxy Grand Neo ', ' 1000', ' 120'],['Замена аккумулятора', 'Galaxy Grand Neo ', ' 1200', ' 75'],['Замена датчика приближения', 'Galaxy Grand Neo ', ' 1200', ' 90'],['Замена динамика/звонка', 'Galaxy Grand Neo ', ' 1200', ' 90'],['Замена дисплея', 'Galaxy Grand Neo ', ' 1600', ' 90'],['Восстановление после попадания воды', 'Galaxy Grand Duos', ' 1000', ' 120'],['Замена аккумулятора', 'Galaxy Grand Duos', ' 1200', ' 75'],['Замена датчика приближения', 'Galaxy Grand Duos', ' 1200', ' 90'],['Замена динамика/звонка', 'Galaxy Grand Duos', ' 1200', ' 90'],['Замена дисплея', 'Galaxy Grand Duos', ' 1600', ' 90'],['Восстановление после попадания воды', 'Galaxy Grand 2', ' 1000', ' 120'],['Замена аккумулятора', 'Galaxy Grand 2', ' 1200', ' 75'],['Замена датчика приближения', 'Galaxy Grand 2', ' 1200', ' 90'],['Замена динамика/звонка', 'Galaxy Grand 2', ' 1200', ' 90'],['Замена дисплея', 'Galaxy Grand 2', ' 1600', ' 90'],['Восстановление после попадания воды', 'Galaxy Fame ', ' 1000', ' 120'],['Замена аккумулятора', 'Galaxy Fame ', ' 1200', ' 75'],['Замена датчика приближения', 'Galaxy Fame ', ' 1200', ' 90'],['Замена динамика/звонка', 'Galaxy Fame ', ' 1200', ' 90'],['Замена дисплея', 'Galaxy Fame ', ' 1600', ' 90'],['Восстановление после попадания воды', 'Galaxy E7', ' 1000', ' 120'],['Замена аккумулятора', 'Galaxy E7', ' 1650', ' 75'],['Замена датчика приближения', 'Galaxy E7', ' 1200', ' 90'],['Замена динамика/звонка', 'Galaxy E7', ' 1200', ' 90'],['Замена дисплея', 'Galaxy E7', ' 1600', ' 90'],['Восстановление после попадания воды', 'Galaxy E5 Duos', ' 1000', ' 120'],['Замена аккумулятора', 'Galaxy E5 Duos', ' 1400', ' 75'],['Замена датчика приближения', 'Galaxy E5 Duos', ' 1200', ' 90'],['Замена динамика/звонка', 'Galaxy E5 Duos', ' 1200', ' 90'],['Замена дисплея', 'Galaxy E5 Duos', ' 1600', ' 90'],['Восстановление после попадания воды', 'Galaxy Core Prime VE', ' 1000', ' 120'],['Замена аккумулятора', 'Galaxy Core Prime VE', ' 1200', ' 75'],['Замена датчика приближения', 'Galaxy Core Prime VE', ' 1200', ' 90'],['Замена динамика/звонка', 'Galaxy Core Prime VE', ' 1200', ' 90'],['Замена дисплея', 'Galaxy Core Prime VE', ' 1600', ' 90'],['Восстановление после попадания воды', 'Galaxy Core Prime', ' 1000', ' 120'],['Замена аккумулятора', 'Galaxy Core Prime', ' 1200', ' 75'],['Замена датчика приближения', 'Galaxy Core Prime', ' 1200', ' 90'],['Замена динамика/звонка', 'Galaxy Core Prime', ' 1200', ' 90'],['Замена дисплея', 'Galaxy Core Prime', ' 1600', ' 90'],['Восстановление после попадания воды', 'Galaxy Core Plus', ' 1000', ' 120'],['Замена аккумулятора', 'Galaxy Core Plus', ' 1200', ' 75'],['Замена датчика приближения', 'Galaxy Core Plus', ' 1200', ' 90'],['Замена динамика/звонка', 'Galaxy Core Plus', ' 1200', ' 90'],['Замена дисплея', 'Galaxy Core Plus', ' 1600', ' 90'],['Восстановление после попадания воды', 'Galaxy Core 2 Duos', ' 1000', ' 120'],['Замена аккумулятора', 'Galaxy Core 2 Duos', ' 1200', ' 75'],['Замена датчика приближения', 'Galaxy Core 2 Duos', ' 1200', ' 90'],['Замена динамика/звонка', 'Galaxy Core 2 Duos', ' 1200', ' 90'],['Замена дисплея', 'Galaxy Core 2 Duos', ' 1600', ' 90'],['Восстановление после попадания воды', 'Galaxy Core', ' 1000', ' 120'],['Замена аккумулятора', 'Galaxy Core', ' 1200', ' 75'],['Замена датчика приближения', 'Galaxy Core', ' 1200', ' 90'],['Замена динамика/звонка', 'Galaxy Core', ' 1200', ' 90'],['Замена дисплея', 'Galaxy Core', ' 1600', ' 90'],['Восстановление после попадания воды', 'Galaxy Chat', ' 1000', ' 120'],['Замена аккумулятора', 'Galaxy Chat', ' 1200', ' 75'],['Замена датчика приближения', 'Galaxy Chat', ' 1200', ' 90'],['Замена динамика/звонка', 'Galaxy Chat', ' 1200', ' 90'],['Замена дисплея', 'Galaxy Chat', ' 1600', ' 90'],['Восстановление после попадания воды', 'Galaxy Camera', ' 1000', ' 120'],['Замена аккумулятора', 'Galaxy Camera', ' 1200', ' 75'],['Замена датчика приближения', 'Galaxy Camera', ' 1200', ' 90'],['Замена динамика/звонка', 'Galaxy Camera', ' 1200', ' 90'],['Замена дисплея', 'Galaxy Camera', ' 1600', ' 90'],['Восстановление после попадания воды', 'Galaxy C9 Pro', ' 1000', ' 120'],['Замена аккумулятора', 'Galaxy C9 Pro', ' 1600', ' 75'],['Замена датчика приближения', 'Galaxy C9 Pro', ' 1500', ' 90'],['Замена динамика/звонка', 'Galaxy C9 Pro', ' 1400', ' 90'],['Замена дисплея', 'Galaxy C9 Pro', ' 2990', ' 90'],['Восстановление после попадания воды', 'Galaxy C7 Pro', ' 1000', ' 120'],['Замена аккумулятора', 'Galaxy C7 Pro', ' 1600', ' 75'],['Замена датчика приближения', 'Galaxy C7 Pro', ' 1500', ' 90'],['Замена динамика/звонка', 'Galaxy C7 Pro', ' 1400', ' 90'],['Замена дисплея', 'Galaxy C7 Pro', ' 2990', ' 90); (9538'],['Замена аккумулятора', 'Galaxy C5 Pro', ' 1600', ' 75'],['Замена датчика приближения', 'Galaxy C5 Pro', ' 1500', ' 90'],['Замена динамика/звонка', 'Galaxy C5 Pro', ' 1400', ' 90'],['Замена дисплея', 'Galaxy C5 Pro', ' 2990', ' 90'],['Восстановление после попадания воды', 'Galaxy C5', ' 1000', ' 120'],['Замена аккумулятора', 'Galaxy C5', ' 1450', ' 75'],['Замена датчика приближения', 'Galaxy C5', ' 1350', ' 90'],['Замена динамика/звонка', 'Galaxy C5', ' 1400', ' 90'],['Замена дисплея', 'Galaxy C5', ' 2990', ' 90'],['Восстановление после попадания воды', 'Galaxy Alpha', ' 1000', ' 120'],['Замена аккумулятора', 'Galaxy Alpha', ' 1200', ' 75'],['Замена датчика приближения', 'Galaxy Alpha', ' 1300', ' 90'],['Замена динамика/звонка', 'Galaxy Alpha', ' 1200', ' 90'],['Замена дисплея', 'Galaxy Alpha', ' 5990', ' 90'],['Восстановление после попадания воды', 'Galaxy Admire 4G', ' 1000', ' 120'],['Замена аккумулятора', 'Galaxy Admire 4G', ' 1200', ' 75'],['Замена датчика приближения', 'Galaxy Admire 4G', ' 1200', ' 90'],['Замена динамика/звонка', 'Galaxy Admire 4G', ' 1200', ' 90'],['Замена дисплея', 'Galaxy Admire 4G', ' 2990', ' 90'],['Восстановление после попадания воды', 'Galaxy Ace Style LTE', ' 1000', ' 120'],['Замена аккумулятора', 'Galaxy Ace Style LTE', ' 1200', ' 75'],['Замена датчика приближения', 'Galaxy Ace Style LTE', ' 1200', ' 90'],['Замена динамика/звонка', 'Galaxy Ace Style LTE', ' 1200', ' 90'],['Замена дисплея', 'Galaxy Ace Style LTE', ' 160', ' 90'],['Восстановление после попадания воды', 'Galaxy Ace 4 Neo', ' 1000', ' 120'],['Замена аккумулятора', 'Galaxy Ace 4 Neo', ' 1200', ' 75'],['Замена датчика приближения', 'Galaxy Ace 4 Neo', ' 1200', ' 90'],['Замена динамика/звонка', 'Galaxy Ace 4 Neo', ' 1200', ' 90'],['Замена дисплея', 'Galaxy Ace 4 Neo', ' 1600', ' 90'],['Восстановление после попадания воды', 'Galaxy Ace 4 Lite Duos', ' 1000', ' 120'],['Замена аккумулятора', 'Galaxy Ace 4 Lite Duos', ' 1200', ' 75'],['Замена датчика приближения', 'Galaxy Ace 4 Lite Duos', ' 1200', ' 90'],['Замена динамика/звонка', 'Galaxy Ace 4 Lite Duos', ' 1200', ' 90'],['Замена дисплея', 'Galaxy Ace 4 Lite Duos', ' 1600', ' 90'],['Восстановление после попадания воды', 'Galaxy Ace 4', ' 1000', ' 120'],['Замена аккумулятора', 'Galaxy Ace 4', ' 1200', ' 75'],['Замена датчика приближения', 'Galaxy Ace 4', ' 1200', ' 90'],['Замена динамика/звонка', 'Galaxy Ace 4', ' 1200', ' 90'],['Замена дисплея', 'Galaxy Ace 4', ' 1600', ' 90'],['Восстановление после попадания воды', 'Galaxy Ace 3 Duos', ' 1000', ' 120'],['Замена аккумулятора', 'Galaxy Ace 3 Duos', ' 1200', ' 75'],['Замена датчика приближения', 'Galaxy Ace 3 Duos', ' 1200', ' 90'],['Замена динамика/звонка', 'Galaxy Ace 3 Duos', ' 1200', ' 90'],['Замена дисплея', 'Galaxy Ace 3 Duos', ' 1600', ' 90'],['Восстановление после попадания воды', 'Galaxy Ace 3', ' 1000', ' 120'],['Замена аккумулятора', 'Galaxy Ace 3', ' 1200', ' 75'],['Замена датчика приближения', 'Galaxy Ace 3', ' 1200', ' 90'],['Замена динамика/звонка', 'Galaxy Ace 3', ' 1200', ' 90'],['Замена дисплея', 'Galaxy Ace 3', ' 1600', ' 90'],['Восстановление после попадания воды', 'Galaxy Ace', ' 1000', ' 120'],['Замена аккумулятора', 'Galaxy Ace', ' 1200', ' 75'],['Замена датчика приближения', 'Galaxy Ace', ' 1200', ' 90'],['Замена динамика/звонка', 'Galaxy Ace', ' 1200', ' 90'],['Замена дисплея', 'Galaxy Ace', ' 1600', ' 90'],['Восстановление после попадания воды', 'Galaxy A9 Pro (2016)', ' 1150', ' 120'],['Замена аккумулятора', 'Galaxy A9 Pro (2016)', ' 1700', ' 75'],['Замена датчика приближения', 'Galaxy A9 Pro (2016)', ' 1600', ' 90'],['Замена динамика/звонка', 'Galaxy A9 Pro (2016)', ' 1500', ' 90'],['Замена дисплея', 'Galaxy A9 Pro (2016)', ' 8300', ' 90'],['Восстановление после попадания воды', 'Galaxy A9 (2018)', ' 1150', ' 120'],['Замена аккумулятора', 'Galaxy A9 (2018)', ' 1700', ' 75'],['Замена датчика приближения', 'Galaxy A9 (2018)', ' 1600', ' 90'],['Замена динамика/звонка', 'Galaxy A9 (2018)', ' 1500', ' 90'],['Замена дисплея', 'Galaxy A9 (2018)', ' 8300', ' 90'],['Восстановление после попадания воды', 'Galaxy A9 (2016)', ' 1150', ' 120'],['Замена аккумулятора', 'Galaxy A9 (2016)', ' 1600', ' 75'],['Замена датчика приближения', 'Galaxy A9 (2016)', ' 1600', ' 90'],['Замена динамика/звонка', 'Galaxy A9 (2016)', ' 1500', ' 90'],['Замена дисплея', 'Galaxy A9 (2016)', ' 8300', ' 90'],['Восстановление после попадания воды', 'Galaxy A8s', ' 1150', ' 120'],['Замена аккумулятора', 'Galaxy A8s', ' 1700', ' 75'],['Замена датчика приближения', 'Galaxy A8s', ' 1600', ' 90'],['Замена динамика/звонка', 'Galaxy A8s', ' 1500', ' 90'],['Замена дисплея', 'Galaxy A8s', ' 9500', ' 90'],['Восстановление после попадания воды', 'Galaxy A80s', ' 1150', ' 120'],['Замена аккумулятора', 'Galaxy A80s', ' 1700', ' 75'],['Замена датчика приближения', 'Galaxy A80s', ' 1600', ' 90'],['Замена динамика/звонка', 'Galaxy A80s', ' 1500', ' 90'],['Замена дисплея', 'Galaxy A80s', ' 9500', ' 90'],['Восстановление после попадания воды', 'Galaxy A80', ' 1150', ' 120'],['Замена аккумулятора', 'Galaxy A80', ' 1600', ' 75'],['Замена датчика приближения', 'Galaxy A80', ' 1600', ' 90'],['Замена динамика/звонка', 'Galaxy A80', ' 1500', ' 90'],['Замена дисплея', 'Galaxy A80', ' 9500', ' 90'],['Восстановление после попадания воды', 'Galaxy A8+ (2018)', ' 1150', ' 120'],['Замена аккумулятора', 'Galaxy A8+ (2018)', ' 1600', ' 75'],['Замена датчика приближения', 'Galaxy A8+ (2018)', ' 1600', ' 90'],['Замена динамика/звонка', 'Galaxy A8+ (2018)', ' 1500', ' 90'],['Замена дисплея', 'Galaxy A8+ (2018)', ' 3800', ' 90'],['Восстановление после попадания воды', 'Galaxy A8 Duos', ' 1150', ' 120'],['Замена аккумулятора', 'Galaxy A8 Duos', ' 1600', ' 75'],['Замена датчика приближения', 'Galaxy A8 Duos', ' 1600', ' 90'],['Замена динамика/звонка', 'Galaxy A8 Duos', ' 1500', ' 90'],['Замена дисплея', 'Galaxy A8 Duos', ' 3800', ' 90'],['Восстановление после попадания воды', 'Galaxy A8 (2018)', ' 1150', ' 120'],['Замена аккумулятора', 'Galaxy A8 (2018)', ' 1600', ' 75'],['Замена датчика приближения', 'Galaxy A8 (2018)', ' 1600', ' 90'],['Замена динамика/звонка', 'Galaxy A8 (2018)', ' 1500', ' 90'],['Замена дисплея', 'Galaxy A8 (2018)', ' 3800', ' 90'],['Восстановление после попадания воды', 'Galaxy A8 (2016)', ' 1150', ' 120'],['Замена аккумулятора', 'Galaxy A8 (2016)', ' 1600', ' 75'],['Замена датчика приближения', 'Galaxy A8 (2016)', ' 1600', ' 90'],['Замена динамика/звонка', 'Galaxy A8 (2016)', ' 1500', ' 90'],['Замена дисплея', 'Galaxy A8 (2016)', ' 3800', ' 90'],['Восстановление после попадания воды', 'Galaxy A8', ' 1150', ' 120'],['Замена аккумулятора', 'Galaxy A8', ' 1600', ' 75'],['Замена датчика приближения', 'Galaxy A8', ' 1600', ' 90'],['Замена динамика/звонка', 'Galaxy A8', ' 1500', ' 90'],['Замена дисплея', 'Galaxy A8', ' 9500', ' 90'],['Восстановление после попадания воды', 'Galaxy A70', ' 1150', ' 120'],['Замена аккумулятора', 'Galaxy A70', ' 1600', ' 75'],['Замена датчика приближения', 'Galaxy A70', ' 1600', ' 90'],['Замена динамика/звонка', 'Galaxy A70', ' 1500', ' 90'],['Замена дисплея', 'Galaxy A70', ' 9900', ' 90'],['Восстановление после попадания воды', 'Galaxy A7 (2018)', ' 1150', ' 120'],['Замена аккумулятора', 'Galaxy A7 (2018)', ' 1600', ' 75'],['Замена датчика приближения', 'Galaxy A7 (2018)', ' 1600', ' 90'],['Замена динамика/звонка', 'Galaxy A7 (2018)', ' 1500', ' 90'],['Замена дисплея', 'Galaxy A7 (2018)', ' 6500', ' 90'],['Восстановление после попадания воды', 'Galaxy A7 (2017)', ' 1150', ' 120'],['Замена аккумулятора', 'Galaxy A7 (2017)', ' 1500', ' 75'],['Замена датчика приближения', 'Galaxy A7 (2017)', ' 1600', ' 90'],['Замена динамика/звонка', 'Galaxy A7 (2017)', ' 1500', ' 90'],['Замена дисплея', 'Galaxy A7 (2017)', ' 2990', ' 90'],['Восстановление после попадания воды', 'Galaxy A7 (2016)', ' 1150', ' 120'],['Замена аккумулятора', 'Galaxy A7 (2016)', ' 1500', ' 75'],['Замена датчика приближения', 'Galaxy A7 (2016)', ' 1600', ' 90'],['Замена динамика/звонка', 'Galaxy A7 (2016)', ' 1300', ' 90'],['Замена дисплея', 'Galaxy A7 (2016)', ' 2990', ' 90'],['Восстановление после попадания воды', 'Galaxy A7', ' 1150', ' 120'],['Замена аккумулятора', 'Galaxy A7', ' 1500', ' 75'],['Замена датчика приближения', 'Galaxy A7', ' 1600', ' 90'],['Замена динамика/звонка', 'Galaxy A7', ' 1400', ' 90'],['Замена дисплея', 'Galaxy A7', ' 6000', ' 90'],['Восстановление после попадания воды', 'Galaxy A60', ' 1150', ' 120'],['Замена аккумулятора', 'Galaxy A60', ' 1600', ' 75'],['Замена датчика приближения', 'Galaxy A60', ' 1600', ' 90'],['Замена динамика/звонка', 'Galaxy A60', ' 1400', ' 90'],['Замена дисплея', 'Galaxy A60', ' 6700', ' 90'],['Восстановление после попадания воды', 'Galaxy A6+', ' 1150', ' 120'],['Замена аккумулятора', 'Galaxy A6+', ' 1600', ' 75'],['Замена датчика приближения', 'Galaxy A6+', ' 1600', ' 90'],['Замена динамика/звонка', 'Galaxy A6+', ' 1400', ' 90'],['Замена дисплея', 'Galaxy A6+', ' 6700', ' 90'],['Восстановление после попадания воды', 'Galaxy A6', ' 1150', ' 120'],['Замена аккумулятора', 'Galaxy A6', ' 1600', ' 75'],['Замена датчика приближения', 'Galaxy A6', ' 1600', ' 90'],['Замена динамика/звонка', 'Galaxy A6', ' 1400', ' 90'],['Замена дисплея', 'Galaxy A6', ' 6700', ' 90'],['Восстановление после попадания воды', 'Galaxy A51', ' 1150', ' 120'],['Замена аккумулятора', 'Galaxy A51', ' 1700', ' 75'],['Замена датчика приближения', 'Galaxy A51', ' 1600', ' 90'],['Замена динамика/звонка', 'Galaxy A51', ' 1450', ' 90'],['Замена дисплея', 'Galaxy A51', ' 9000', ' 90'],['Восстановление после попадания воды', 'Galaxy A50', ' 1150', ' 120'],['Замена аккумулятора', 'Galaxy A50', ' 1700', ' 75'],['Замена датчика приближения', 'Galaxy A50', ' 1600', ' 90'],['Замена динамика/звонка', 'Galaxy A50', ' 1450', ' 90'],['Замена дисплея', 'Galaxy A50', ' 7400', ' 90'],['Восстановление после попадания воды', 'Galaxy A5 (2017)', ' 1150', ' 120'],['Замена аккумулятора', 'Galaxy A5 (2017)', ' 1600', ' 75'],['Замена датчика приближения', 'Galaxy A5 (2017)', ' 1600', ' 90'],['Замена динамика/звонка', 'Galaxy A5 (2017)', ' 1350', ' 90'],['Замена дисплея', 'Galaxy A5 (2017)', ' 2900', ' 90'],['Восстановление после попадания воды', 'Galaxy A5 (2016)', ' 1150', ' 120'],['Замена аккумулятора', 'Galaxy A5 (2016)', ' 1600', ' 75'],['Замена датчика приближения', 'Galaxy A5 (2016)', ' 1600', ' 90'],['Замена динамика/звонка', 'Galaxy A5 (2016)', ' 1300', ' 90'],['Замена дисплея', 'Galaxy A5 (2016)', ' 2850', ' 90'],['Восстановление после попадания воды', 'Galaxy A5', ' 1150', ' 120'],['Замена аккумулятора', 'Galaxy A5', ' 1500', ' 75'],['Замена датчика приближения', 'Galaxy A5', ' 1350', ' 90'],['Замена динамика/звонка', 'Galaxy A5', ' 1400', ' 90'],['Замена дисплея', 'Galaxy A5', ' 2350', ' 90'],['Восстановление после попадания воды', 'Galaxy A40', ' 1150', ' 120'],['Замена аккумулятора', 'Galaxy A40', ' 1600', ' 75'],['Замена датчика приближения', 'Galaxy A40', ' 1500', ' 90'],['Замена динамика/звонка', 'Galaxy A40', ' 1450', ' 90'],['Замена дисплея', 'Galaxy A40', ' 6900', ' 90'],['Восстановление после попадания воды', 'Galaxy A30s', ' 1150', ' 120'],['Замена аккумулятора', 'Galaxy A30s', ' 1700', ' 75'],['Замена датчика приближения', 'Galaxy A30s', ' 1500', ' 90'],['Замена динамика/звонка', 'Galaxy A30s', ' 1450', ' 90'],['Замена дисплея', 'Galaxy A30s', ' 6500', ' 90'],['Восстановление после попадания воды', 'Galaxy A30 SM-A305FD', ' 1150', ' 120'],['Замена аккумулятора', 'Galaxy A30 SM-A305FD', ' 1600', ' 75'],['Замена датчика приближения', 'Galaxy A30 SM-A305FD', ' 1500', ' 90'],['Замена динамика/звонка', 'Galaxy A30 SM-A305FD', ' 1450', ' 90'],['Замена дисплея', 'Galaxy A30 SM-A305FD', ' 8400', ' 90'],['Восстановление после попадания воды', 'Galaxy A3 (2016)', ' 1100', ' 120'],['Замена аккумулятора', 'Galaxy A3 (2016)', ' 1600', ' 75'],['Замена датчика приближения', 'Galaxy A3 (2016)', ' 1300', ' 90'],['Замена динамика/звонка', 'Galaxy A3 (2016)', ' 1300', ' 90'],['Замена дисплея', 'Galaxy A3 (2016)', ' 2790', ' 90'],['Восстановление после попадания воды', 'Galaxy A3 (2017)', ' 1100', ' 120'],['Замена аккумулятора', 'Galaxy A3 (2017)', ' 1500', ' 75'],['Замена датчика приближения', 'Galaxy A3 (2017)', ' 1300', ' 90'],['Замена динамика/звонка', 'Galaxy A3 (2017)', ' 1300', ' 90'],['Замена дисплея', 'Galaxy A3 (2017)', ' 3100', ' 90'],['Восстановление после попадания воды', 'Galaxy A3', ' 1100', ' 120'],['Замена аккумулятора', 'Galaxy A3', ' 1500', ' 75'],['Замена датчика приближения', 'Galaxy A3', ' 1300', ' 90'],['Замена динамика/звонка', 'Galaxy A3', ' 1300', ' 90'],['Замена дисплея', 'Galaxy A3', ' 2100', ' 90'],['Восстановление после попадания воды', 'Galaxy A20s', ' 1100', ' 120'],['Замена аккумулятора', 'Galaxy A20s', ' 1600', ' 75'],['Замена датчика приближения', 'Galaxy A20s', ' 1400', ' 90'],['Замена динамика/звонка', 'Galaxy A20s', ' 1400', ' 90'],['Замена дисплея', 'Galaxy A20s', ' 3150', ' 90'],['Восстановление после попадания воды', 'Galaxy A20', ' 1100', ' 120'],['Замена аккумулятора', 'Galaxy A20', ' 1600', ' 75'],['Замена датчика приближения', 'Galaxy A20', ' 1400', ' 90'],['Замена динамика/звонка', 'Galaxy A20', ' 1400', ' 90'],['Замена дисплея', 'Galaxy A20', ' 3100', ' 90'],['Восстановление после попадания воды', 'Galaxy A10 ', ' 1100', ' 120'],['Замена аккумулятора', 'Galaxy A10 ', ' 1600', ' 75'],['Замена датчика приближения', 'Galaxy A10 ', ' 1400', ' 90'],['Замена динамика/звонка', 'Galaxy A10 ', ' 1300', ' 90'],['Замена дисплея', 'Galaxy A10 ', ' 2700', ' 90'],['Восстановление после попадания воды', 'Galaxy J4 (2018)', ' 1100', ' 120'],['Замена аккумулятора', 'Galaxy J4 (2018)', ' 1600', ' 75'],['Замена датчика приближения', 'Galaxy J4 (2018)', ' 1400', ' 90'],['Замена динамика/звонка', 'Galaxy J4 (2018)', ' 1400', ' 90'],['Замена дисплея', 'Galaxy J4 (2018)', ' 3800', ' 90'],['Восстановление после попадания воды', 'Ativ S', ' 1100', ' 120'],['Замена аккумулятора', 'Ativ S', ' 1200', ' 75'],['Замена датчика приближения', 'Ativ S', ' 1200', ' 90'],['Замена динамика/звонка', 'Ativ S', ' 1200', ' 90'],['Замена дисплея', 'Ativ S', ' 3700', ' 90'],] ;

let priceServicePhoneDefault = [["Диагностика","от 150","от 2 ч до 1 дня"],["Замена камеры","от 700","от 6 ч до 1 дня"],["Замена микрофона/динамика/звонка","от 700","от 2 ч до 1 дня"],["Замена аккумулятора","от 600","от 2 ч до 1 дня"],["Восстановление после попадания воды","от 550","от 2 ч до 1 дня"],["Замена кнопки включения","от 700","от 2 ч до 1 дня"],["Замена задней крышки/корпуса в сборе","от 600","от 2 ч до 1 дня"],["Замена разъема питания/гарнитуры","от 700","от 2 ч до 1 дня"],["Замена шлейфа/кнопки home","от 700","от 2 ч до 1 дня"],["Программный ремонт/Обновление ПО/Разблокировка","от 500","от 2 ч до 1 дня"],["Технически сложный ремонт","от 1200","от 2 ч до 1 дня"],["Замена стекла (touch screen)","от 700","от 2 ч до 1 дня"]];

let priceServiceLaptopDefault = [["Чистка ноутбука","от 500","от 5 ч до 2 дней"],["Замена камеры","от 700","от 6 ч до 1 дня"],["Восстановление после падения","от 1200","от 5 ч до 2 дней"],["Восстановление после воды, падения","от 1000","от 5 ч до 2 дней"],["Замена видеокарты","от 1500","от 5 ч до 2 дней"],["Ремонт видеокарты","от 1500","от 5 ч до 2 дней"],["Ремонт платы","от 1200","от 5 ч до 2 дней"],["Диагностика","от 500","5 ч до 2 дней"],["Замена матрицы ноутбука","от 700","от 5 ч до 2 дней"],["Замена разъемов","от 900","от 5 ч до 2 дней"],["Замена разъема зарядки/usb","от 950","от 5 ч до 2 дней"],["Ремонт клавиатуры","от 1200","от 5 ч до 2 дней"],["Замена клавиатуры","от 700","от 5 ч до 2 дней"]];

let priceServiceTabletDefault = [["Программный ремонт/Обновление ПО/Разблокировка","от 850","от 6 ч до 2 дней"],["Замена шлейфа/кнопки home","от 1190","от 6 ч до 2 дней"],["Замена стекла (touch screen)","от 1190","от 6 ч до 2 дней"],["Замена разъема питания/гарнитуры","от 1190","от 6 ч до 2 дней"],["Замена кнопки включения","от 1360","от 6 ч до 2 дней"],["Замена задней крышки/корпуса в сборе","от 1020","от 6 ч до 2 дней"],["Технически сложный ремонт","от 2040","от 6 ч до 2 дней"],["Диагностика","от 255","от 6 ч до 2 дней"],["Восстановление после попадания воды","от 935","от 6 ч до 2 дней"],["Замена аккумулятора","от 1020","от 6 ч до 2 дней"],["Замена микрофона/динамика/звонка","от 1190","от 6 ч до 2 дней"],["Замена камеры","от 1190","от 6 ч до 2 дней"]];



$(document).ready( function () {
  let ua = window.navigator.userAgent;
  let msie = ua.indexOf("MSIE ");
  let heightModel = '';
  let modelWindow_check = '';
  let priceDevice_check = 'Телефон';
  let priceModel_check = '';
  let price_check = '';
  let model_check = false;
  let metrika_chek = '';

  let nodeJob_status = '';

  const btnPrevNavBar = $("#carouselLeftNavBarMobile");
  const btnNextNavBar = $("#carouselRightNavBarMobile");

  let valNavBar = 1;
  btnNextNavBar.click(function(){

    valNavBar++;

    if(valNavBar <= 3){
      $(".navBar > ul > li").css({
        "display" : "none",
      });
      $(".navBar > ul > li:nth-of-type("+valNavBar+")").css({
        "display" : "grid",
      });
    }
    else{
      valNavBar--;
    }

  });
  btnPrevNavBar.click(function(){

    valNavBar--;

    if(valNavBar >= 1){
      $(".navBar > ul > li").css({
        "display" : "none",
      });
      $(".navBar > ul > li:nth-of-type("+valNavBar+")").css({
        "display" : "grid",
      });
    }
    else{
      valNavBar++;
    }

  });

  function deviceSelectedActions(typedevice){
    switch (typedevice) {
      case "Телефон":
        $('.deviceSelectedImages').removeClass('deviceSelectedImagesActive');
        $('.deviceSelectedPhone').addClass('deviceSelectedImagesActive');
        break;
      case "Ноутбук":
        $('.deviceSelectedImages').removeClass('deviceSelectedImagesActive');
        $('.deviceSelectedLaptop').addClass('deviceSelectedImagesActive');
        break;
      case "Планшет":
        $('.deviceSelectedImages').removeClass('deviceSelectedImagesActive');
        $('.deviceSelectedTablet').addClass('deviceSelectedImagesActive');
        break;
      default:
        return false;
    }
  }
  function addPriceService(array){
    $('.priceMainContent section').empty();
    if (priceDevice_check == 'Планшет' || priceDevice_check == 'Ноутбук' || (priceDevice_check == 'Телефон' && priceModel_check == '')) {
      array.forEach((item, i) => {
        $('.priceMainContent section').append('<div class="priceBox"><span class="titlePriceBox">'+item[0]+'</span>'+'<span class="dedlaine">'+item[2]+'</span>'+'<span class="price">'+item[1]+' ₽</span></div>');
      });
    }
    else{
      array.forEach((item, i) => {

        if (item[1] == priceModel_check) {
          if (item[0] == 'Восстановление после попадания воды') {
            $('.priceMainContent section').append('<div class="priceBox"><span class="titlePriceBox">'+item[0]+'</span>'+'<span class="dedlaine">'+item[3]+' минут</span>'+'<span class="price">От '+(+item[2]+500)+' ₽</span></div>');
            return;
          }
          $('.priceMainContent section').append('<div class="priceBox"><span class="titlePriceBox">'+item[0]+'</span>'+'<span class="dedlaine">'+item[3]+' минут</span>'+'<span class="price">От '+(+item[2]+500)+' ₽</span></div>');
        }
      });
    }
  }
  function sendAjaxForm(url) {
      $.ajax({
          url:     url, //url страницы (action_ajax_form.php)
          type:     "POST", //метод отправки
          dataType: "html", //формат данных
          data: "name="+$("#firstNameId").val()+" "+$("#nameId").val()+" "+$("#lastNameId").val()+"&tel="+$("#telId").val()+"&nodeJob="+nodeJob_status+"&desp="+$("#descId").val()+"&type="+priceDevice_check+"&brand=Samsung&model="+priceModel_check+"&service="+$("#service_title").text()+"&priceService="+price_check,  // Сеарилизуем объект
          success: function() { //Данные отправлены успешно
            priceModel_check='';
            $('.modelCheck').text('Модель не выбрана');
            switch (metrika_chek) {
              case 'click_perezvonit':
                ym(67091065,'reachGoal','otpravka_perezvonit');
                break;
              case 'zakazat_remont':
                ym(67091065,'reachGoal','zakazat_remont_otpravlen');
                break;
              case 'zakaz_uslugi':
                ym(67091065,'reachGoal','zakaz_uslugi_otpravlen');
                break;
              case 'razbor_otpravlen':
                ym(67091065,'reachGoal','razbor_otpravlen');
                break;
              default:
                return false;
            }
            $('.popup-fade').fadeIn(200);
            $('.popup').hide();
            $('.popup_success').fadeIn(200);
        },
        error: function(response) { // Данные не отправлены
          alert("Что то пошло не так, повторите попытку позже");
        }
    });
  }
  function sendAjaxFormConsult(url, name, tel) {
      $.ajax({
          url:     url, //url страницы (action_ajax_form.php)
          type:     "POST", //метод отправки
          dataType: "html", //формат данных
          data: "name="+name+"&tel="+tel+"&brand=Samsung&nodeJob="+nodeJob_status,  // Сеарилизуем объект
          success: function(data) { //Данные отправлены успешно
            priceModel_check='';
            $('.modelCheck').text('Модель не выбрана');
            switch (metrika_chek) {
              case 'zaberem_iz_doma':
                ym(67091065,'reachGoal','otpravka_perezvonit');
                break;
              case 'konsultacia':
                ym(67091065,'reachGoal','zakazat_remont_otpravlen');
                break;
              default:
                return false;
            }
            $('.popup').hide();
            $('.popup_success').fadeIn();
        		$('.popup-fade').fadeIn(100);
            $('input[name=homeOrderFormTel]').val("");
            $('input[name=homeOrderFormName]').val("");
            someFunction( data );
            return data;

        },
        error: function(response) { // Данные не отправлены
          alert("Что то пошло не так, повторите попытку позже");
        }
    });
  }
 function someFunction(data) {
   $(".menu").text(data);
 }


  arrayModel.forEach((item, i) => {
    $('.modelMainContent section').append('<div class="modelBox"><span class="titleModelBox">'+item[1]+'</span>'+'<img src="img/Samsung/samsung/'+item[1].trim().toLowerCase().replace(/[^a-zA-Z0-9 -]/, "").replace(/\s/g, "-")+'.png" class="img_modelBox"></div>');
  });



  addPriceService(priceServicePhoneDefault);


    $(".modelBox").mouseenter(function(){
    if(!(/iPhone|iPad|iPod|Android/i.test(navigator.userAgent)) || !(window.matchMedia('(max-width: 860px)').matches)){
      $(this).children(".img_modelBox").animate({
  	      "margin-bottom": "10px", // высота элемента
  	   }, 200);
     }
    });
    $(".modelBox").mouseleave(function(){
      if(!(/iPhone|iPad|iPod|Android/i.test(navigator.userAgent)) || !(window.matchMedia('(max-width: 860px)').matches)){
      $(this).children(".img_modelBox").animate({
  	      "margin-bottom": "-30px", // высота элемента
  	   }, 200);
     }
    });

    $(window).scroll(function(){
      if(/iPhone|iPad|iPod|Android/i.test(navigator.userAgent) || window.matchMedia('(max-width: 860px)').matches){
        if($(window).scrollTop() > 200){
          $('.headerTop').css({
            "grid-template-rows" : "40px 1fr auto",
          });
        }
        else{
          $('.headerTop').css({
            "grid-template-rows" : "60px 1fr auto",
          });
        }
      }
    });


  $(window).resize(function() {
    if($(".bg_navBar").width() > 426){
      $(".navBar > ul > li").css({
        "display" : "grid",
      });
    }
    if($(".bg_navBar").width() < 426){
      $(".navBar > ul > li").css({
        "display" : "none",
      });
      $(".navBar > ul > li:nth-of-type(1)").css({
        "display" : "grid",
      });
    }
  });

  $('.collapseMenu').click(function(){
    if($('.menu').css('display') == 'grid'){
      $('.menu').hide(400);
    }
    else if($('.menu').css('display') == 'none'){

        $('.menu').show(400, function(){
          $('.menu').css({
            'display': 'grid'
          });
        });
    }
  });

  $('#collapseContactHeaderId').click(function(){
    if($('#contactHeaderId').css('display') == 'grid'){
      $('#contactHeaderId').hide(400);
    }
    else if($('#contactHeaderId').css('display') == 'none'){
        $('#contactHeaderId').show({
          duration: 400,
          options: "start",
          complete: function(){
            $('#contactHeaderId').css({
              'display': 'grid'
            });
          }});
    }});

    $('input[name=homeOrderFormTel]').inputmask("+7(999)999-9999");
    $('input[name=homeOrderFormSubmit]').click(
      function() {
        if ($(this).attr('id') == 'homeOrderFormSubmitId homeOrderFormSubmit1') {
          nodeJob_status = 'Забрать у клиента';
          metrika_chek = 'zaberem_iz_doma';
        }
        else if($(this).attr('id') == 'homeOrderFormSubmitId homeOrderFormSubmit2') {
          nodeJob_status = 'Консультация';
          metrika_chek = 'konsultacia';
        }
        let valtel = $(this).siblings('input[name=homeOrderFormTel]').val();
        let valName = $(this).siblings('input[name=homeOrderFormName]').val();
        let reges = /^(\+)?(\(\d{2,3}\) ?\d|\d)(([ \-]?\d)|( ?\(\d{2,3}\) ?)){5,12}\d$/;

        if(valName.length >= 1 && reges.test(valtel)){
          sendAjaxFormConsult('obrabotchik.php', valName, valtel);
        }

        if(valName.length < 1){
          $(this).siblings('input[name=homeOrderFormName]').css({"border" : " 1px solid red",});
        }
        else{
          $(this).siblings('input[name=homeOrderFormName]').css({"border" : "none"});
        }

        if(!(reges.test(valtel))){
          $(this).siblings('input[name=homeOrderFormTel]').css({"border" : " 1px solid red",});
        }
        else{
          $(this).siblings('input[name=homeOrderFormTel]').css({"border" : "none"});
        }
      }
    );

    $('#telId').inputmask("+7(999)999-9999");
    $("#btnSend").click(
      function(){
        let valName = $('#nameId').val();
        let valFirstName = $('#firstNameId').val();
        let valtel = $('#telId').val();
        let valDataProcessing = $('#dataProcessingId').val();
        let reges = /^(\+)?(\(\d{2,3}\) ?\d|\d)(([ \-]?\d)|( ?\(\d{2,3}\) ?)){5,12}\d$/;

        if(valName.length >= 1 && reges.test(valtel) && $('#dataProcessingId').is(":checked") && valFirstName.length >= 1){
          sendAjaxForm('obrabotchik.php');
        }

        if(valName.length < 1){
          $('#nameId').css({"border-color" : "red"});
        }
        else{
          $('#nameId').css({"border-color" : "#BDBDBD"});
        }

        if(valFirstName.length < 1){
          $('#firstNameId').css({"border-color" : "red"});
        }
        else{
          $('#firstNameId').css({"border-color" : "#BDBDBD"});
        }

        if(!(reges.test(valtel))){
          $('#telId').css({"border-color" : "red"});
        }
        else{
          $('#telId').css({"border-color" : "#BDBDBD"});
        }

        if(!($('#dataProcessingId').is(":checked"))){
          $('#dataProcessingId + label').css({"color" : "red"});
        }
        else{
          $('#dataProcessingId + label').css({"color" : "#BDBDBD"});
        }
        return false;
      }
    );

    $('.deviceSelectedImages').click(function() {
      switch($(this).attr('id')) {
        case 'deviceSelectedPhoneId':
          priceDevice_check = 'Телефон';
          deviceSelectedActions(priceDevice_check);
          if (priceModel_check != '') {
            addPriceService(priceService);
            $('.modelCheck').text(priceModel_check);
            break
          }
          addPriceService(priceServicePhoneDefault);
          $('.modelCheck').text('Модель не выбрана');
          break
        case 'deviceSelectedLaptopId':
          priceDevice_check = 'Ноутбук';
          addPriceService(priceServiceLaptopDefault);
          deviceSelectedActions(priceDevice_check);
          $('.modelCheck').text('Модель не выбрана');
          break
        case 'deviceSelectedTabletId':
          priceDevice_check = 'Планшет';
          addPriceService(priceServiceTabletDefault);
          deviceSelectedActions(priceDevice_check);
          $('.modelCheck').text('Модель не выбрана');
          break
        default:
          return false;
      }
    });

    $(".modelBox").click(function(){
      priceModel_check = $(this).children('.titleModelBox').text();
      $('.modelCheck').text(priceModel_check);

      arrayModel.forEach((item, i) => {
        if (item[1] == priceModel_check) {
          priceDevice_check = item[0];
        }
      });
      addPriceService(priceService);
      deviceSelectedActions(priceDevice_check);
      let titleModel = $(this).children(".titleModelBox").text().trim().toLowerCase().replace(/[^a-zA-Z0-9 -]/, "").replace(/\s/g, "-");
      location.href = '#priceMainContentHref';
      location.href = '#model-'+titleModel;
    });

    $(document).on("click", ".searchModelItem", function(){
      priceModel_check = $(this).text();
      $('.modelCheck').text(priceModel_check);

      arrayModel.forEach((item) => {
          if (item[1] == priceModel_check) {
              priceDevice_check = item[0];
          }
      });

      addPriceService(priceService);

      deviceSelectedActions(priceDevice_check);

      let titleModel = $(this).text().trim().toLowerCase().replace(/[^a-zA-Z0-9 -]/, "").replace(/\s/g, "-");

      location.href = '#priceMainContentHref';
      location.href = '#model-'+titleModel;
      $("#js-search").val("");
      $(".searchModelItems").slideUp();
    });

    $(window).scroll(function(){
        if($(window).scrollTop() > 800){
          $('#upPage').fadeIn(200);
        }
        else if($(window).scrollTop() <= 800){
          $('#upPage').hide(200);
        }
    });

    $('#upPage').click(function() {
  		$('html, body').animate({scrollTop: 0},200);
  		return false;
  	})

    $(document).on("click", '#order, .titleInfoBoxDestroy, .priceBox, .contact', function() {
      switch($(this).attr('class')) {
        case 'orderSubmit':
          ym(67091065,'reachGoal','zakazat_remont');
          metrika_chek = 'zakazat_remont';
          nodeJob_status = 'Заявка на ремонт';
          $('.popup_form_input_desc').css({'display' : 'flex'});
          modelWindow_check = '.popup_form_input_desc';
          break;

        case 'titleInfoBoxDestroy':
          metrika_chek = 'razbor_otpravlen';
          nodeJob_status = 'Заявка на разбор телефона';
          $('.popup_form_dropdown_loyaut').css({'display' : 'grid'});
          modelWindow_check = '.popup_form_dropdown_loyaut';
          break;

        case 'priceBox':
          ym(67091065,'reachGoal','zakaz_uslugi');
          metrika_chek = 'zakaz_uslugi';
          nodeJob_status = 'Заявка на ремонт';
          $('.popup_form_service_loyaut').css({'display' : 'flex'});
          $('#service_title').append($(this).children(".titlePriceBox").text());
          if (priceModel_check == '') {
            $('#service_device_device').append(priceDevice_check+', ');
          }
          else {
            $('#service_device_device').append(priceModel_check+', ');
          }
          $('#service_device_cost').append($(this).children(".price").text());
          modelWindow_check = '.popup_form_service_loyaut';
          price_check = $(this).children('.price').text();
          break;

        case 'contact':
          ym(67091065,'reachGoal','click_perezvonit');
          metrika_chek = 'click_perezvonit';
          nodeJob_status = 'Консультация';
          break;

        default:
          return false;
      }
      $('.popup').fadeIn();
      $('.popup_success').hide();
  		$('.popup-fade').fadeIn(100);
  		return false;
    });
    // Клик по ссылке "Закрыть".
    $('.closes').click(function() {
      $(modelWindow_check).hide();
      $(this).parents('.popup-fade').fadeOut(100);
      $('#service_title').empty();
      $('#service_device_device').empty();
      $('#service_device_cost').empty();
      modelWindow_check='';
      price_check='';
      return false;
    });
    // Закрытие по клавише Esc.
    $(document).keydown(function(e) {
      if (e.keyCode === 27) {
        e.stopPropagation();
        $('.popup-fade').fadeOut(100);
        $(modelWindow_check).hide();
        $('#service_title').empty();
        $('#service_device_device').empty();
        $('#service_device_cost').empty();
        modelWindow_check='';
        price_check='';
      }

    });
    // Клик по фону, но не по окну.
    $('.popup-fade').click(function(e) {
      if ($(e.target).closest('.popup').length == 0 && $(e.target).closest('.popup_success').length == 0) {
        $(this).fadeOut(100);
        $(modelWindow_check).hide();
        $('#service_title').empty();
        $('#service_device_device').empty();
        $('#service_device_cost').empty();
        modelWindow_check='';
        price_check='';
      }
    });
    $('select[name=device]').change(function() {
      $('select[name=model]').empty();
      $('select[name=model]').append('<option selected disabled >-</option>');
      let items = $(this).val();
      arrayModel.forEach((item, i) => {
        if (item[0] == items) {
          $('select[name=model]').append('<option value="'+item[1]+'">'+item[1]+'</option>')
        }
      });
      priceDevice_check = $(this).val();
    });
    $('select[name=model]').change(function() {
      priceModel_check = $(this).val();
    });

    $('.slider').slick({
      slidesToShow: 3,
      slidesToScroll: 1,
      responsive: [
        {
          breakpoint: 1050,
          settings: {
            slidesToShow: 2,
            slidesToScroll: 1,
          }
        },
        {
          breakpoint: 700,
          settings: {
            slidesToShow: 1,
            slidesToScroll: 1,
          }
        },
        {
          breakpoint: 426,
          settings: {
            slidesToShow: 1,
            slidesToScroll: 1,
            arrows: false,
            centerMode: true,
            variableWidth: true
          }
        },
      ]
    });

    $('.sliderNavBar').slick({
      slidesToShow: 3,
      responsive: [
        {
          breakpoint: 1050,
          settings: {
            slidesToShow: 2,
            slidesToScroll: 1,
          }
        },
        {
          breakpoint: 700,
          settings: {
            slidesToShow: 1,
            slidesToScroll: 1
          }
        }
      ]
    });

    $('.trackComment').slick({
      slidesToShow: 3,
      slidesToScroll: 1,
      responsive: [
        {
          breakpoint: 1330,
          settings: {
            slidesToShow: 2,
            slidesToScroll: 1,
          }
        },
        {
          breakpoint: 860,
          settings: {
            slidesToShow: 1,
            slidesToScroll: 1
          }
        }
      ]
    });


});
