let arrayModel = [['Телефон', 'K20'],['Телефон', 'K20 Pro'],['Телефон', 'Redmi 8A'],['Телефон', 'Redmi 8'],['Телефон', 'Redmi Note 5A Prime'],['Телефон', 'Redmi Y1 Lite'],['Телефон', 'Redmi Y1'],['Телефон', 'Redmi S2'],['Телефон', 'Redmi Pro'],['Телефон', 'Redmi Note 6 Pro'],['Телефон', 'Redmi Note 5A'],['Телефон', 'Redmi Note 5 Pro'],['Телефон', 'Redmi Note 4X'],['Телефон', 'Redmi Note 4G'],['Телефон', 'Redmi Note 4 Pro'],['Телефон', 'Redmi Note 4'],['Телефон', 'Redmi Note 3 Pro SE'],['Телефон', 'Redmi Note 3 Pro'],['Телефон', 'Redmi Note 3'],['Телефон', 'Redmi Note 2 Prime'],['Телефон', 'Redmi Note 2'],['Телефон', 'Redmi Note'],['Телефон', 'Redmi 6A'],['Телефон', 'Redmi 6 Pro'],['Телефон', 'Redmi 6'],['Телефон', 'Redmi 5A'],['Телефон', 'Redmi 5 Plus'],['Телефон', 'Redmi 5'],['Телефон', 'Redmi 4X'],['Телефон', 'Redmi 4A'],['Телефон', 'Redmi 4'],['Телефон', 'Redmi 3X'],['Телефон', 'Redmi 3S '],['Телефон', 'Redmi 3 Pro'],['Телефон', 'Redmi 3'],['Телефон', 'Redmi 2A'],['Телефон', 'Redmi 2 Prime'],['Телефон', 'Redmi 2'],['Телефон', 'Redmi 1S'],['Телефон', 'Redmi'],['Телефон', 'Qin 2'],['Телефон', 'Mi Play'],['Телефон', 'Mi Note Pro'],['Телефон', 'Mi Note 3'],['Телефон', 'Mi Note 10'],['Телефон', 'Mi Note'],['Телефон', 'Mi Mix 3'],['Телефон', 'Mi Mix 2S'],['Телефон', 'Mi Mix 2'],['Телефон', 'Mi Mix'],['Телефон', 'Mi Max 3'],['Телефон', 'Mi Max 2'],['Телефон', 'Mi Max'],['Телефон', 'Mi A3'],['Телефон', 'Mi A2 Lite'],['Телефон', 'Mi A2'],['Телефон', 'Mi A1'],['Телефон', 'Mi 9T Pro'],['Телефон', 'Mi 9T'],['Телефон', 'Mi 9 SE'],['Телефон', 'Mi 9 Lite'],['Телефон', 'Mi 9'],['Телефон', 'Mi 8 SE'],['Телефон', 'Mi 8 Pro'],['Телефон', 'Mi 8 Lite'],['Телефон', 'Mi 8'],['Телефон', 'Mi 6X'],['Телефон', 'Mi 6'],['Телефон', 'Mi 5X'],['Телефон', 'Mi 5S Plus'],['Телефон', 'Mi 5S'],['Телефон', 'Mi 5c'],['Телефон', 'Mi 5'],['Телефон', 'Mi 4S'],['Телефон', 'Mi 4i'],['Телефон', 'Mi 4c Prime'],['Телефон', 'Mi 4'],['Телефон', 'Mi 3 TD'],['Телефон', 'Mi 3'],['Телефон', 'Mi 2S'],['Телефон', 'Mi 2A'],['Телефон', 'Mi 2'],['Телефон', 'Mi 1S Youth'],['Телефон', 'Mi 1S'],['Телефон', 'Mi 1 Youth'],['Телефон', 'Mi 1 Plus'],['Телефон', 'Redmi 7'],['Телефон', 'Redmi 7a'],['Телефон', 'Redmi Note 7'],['Телефон', 'Redmi Note 7 Pro'],['Телефон', 'Redmi Note 8'],['Телефон', 'Redmi Note 8 Pro'],['Телефон', 'Redmi Note 8T'],['Телефон', 'Pocophone F1'],['Телефон', 'Redmi Go'],];

let priceService = [['Восстановление после попадания воды', 'K20', 900, 50],['Замена аккумулятора', 'K20', 1450, 40],['Замена датчика приближения', 'K20', 1220, 45],['Замена динамика/звонка', 'K20', 1200, 40],['Замена дисплея', 'K20', 8650, 90],['Замена задней крышки', 'K20', 1300, 60],['Замена основной камеры', 'K20', 3250, 60],['Замена передней камеры(Себяшки)', 'K20', 2100, 60],['Замена кнопки включения', 'K20', 1300, 60],['Замена микрофона', 'K20', 1350, 60],['Замена разъема зарядки/гарнитуры', 'K20', 1450, 60],['Замена шлейфа', 'K20', 1450, 60],['Программный ремонт/Обновление ПО', 'K20', 1000, 90],['Ремонт кнопки Home', 'K20', 1900, 60],['Технически сложный ремонт', 'K20', 1500, 90],['Восстановление после попадания воды', 'K20 Pro', 900, 50],['Замена аккумулятора', 'K20 Pro', 1400, 40],['Замена датчика приближения', 'K20 Pro', 1250, 45],['Замена динамика/звонка', 'K20 Pro', 1200, 40],['Замена дисплея', 'K20 Pro', 8650, 90],['Замена задней крышки', 'K20 Pro', 1300, 60],['Замена основной камеры', 'K20 Pro', 3250, 60],['Замена передней камеры(Себяшки)', 'K20 Pro', 2100, 60],['Замена кнопки включения', 'K20 Pro', 1300, 60],['Замена микрофона', 'K20 Pro', 1350, 60],['Замена разъема зарядки/гарнитуры', 'K20 Pro', 1450, 60],['Замена шлейфа', 'K20 Pro', 1450, 60],['Программный ремонт/Обновление ПО', 'K20 Pro', 1000, 90],['Ремонт кнопки Home', 'K20 Pro', 1900, 60],['Технически сложный ремонт', 'K20 Pro', 1500, 90],['Восстановление после попадания воды', 'Redmi 8A', 800, 50],['Замена аккумулятора', 'Redmi 8A', 1550, 40],['Замена датчика приближения', 'Redmi 8A', 1150, 45],['Замена динамика/звонка', 'Redmi 8A', 1150, 40],['Замена дисплея', 'Redmi 8A', 2450, 90],['Замена задней крышки', 'Redmi 8A', 1250, 60],['Замена основной камеры', 'Redmi 8A', 2300, 60],['Замена передней камеры(Себяшки)', 'Redmi 8A', 1900, 60],['Замена кнопки включения', 'Redmi 8A', 1200, 60],['Замена микрофона', 'Redmi 8A', 1150, 60],['Замена разъема зарядки/гарнитуры', 'Redmi 8A', 1250, 60],['Замена шлейфа', 'Redmi 8A', 1300, 60],['Программный ремонт/Обновление ПО', 'Redmi 8A', 1000, 90],['Ремонт кнопки Home', 'Redmi 8A', 1800, 60],['Технически сложный ремонт', 'Redmi 8A', 1200, 90],['Восстановление после попадания воды', 'Redmi 8', 800, 50],['Замена аккумулятора', 'Redmi 8', 1550, 40],['Замена датчика приближения', 'Redmi 8', 1150, 45],['Замена динамика/звонка', 'Redmi 8', 1150, 40],['Замена дисплея', 'Redmi 8', 2450, 90],['Замена задней крышки', 'Redmi 8', 1250, 60],['Замена основной камеры', 'Redmi 8', 2300, 60],['Замена передней камеры(Себяшки)', 'Redmi 8', 1900, 60],['Замена кнопки включения', 'Redmi 8', 1200, 60],['Замена микрофона', 'Redmi 8', 1200, 60],['Замена разъема зарядки/гарнитуры', 'Redmi 8', 1300, 60],['Замена шлейфа', 'Redmi 8', 1300, 60],['Программный ремонт/Обновление ПО', 'Redmi 8', 1000, 90],['Ремонт кнопки Home', 'Redmi 8', 1800, 60],['Технически сложный ремонт', 'Redmi 8', 1200, 90],['Восстановление после попадания воды', 'Redmi Note 5A Prime', 750, 50],['Замена аккумулятора', 'Redmi Note 5A Prime', 1350, 40],['Замена датчика приближения', 'Redmi Note 5A Prime', 1100, 45],['Замена динамика/звонка', 'Redmi Note 5A Prime', 1100, 40],['Замена дисплея', 'Redmi Note 5A Prime', 2250, 90],['Замена задней крышки', 'Redmi Note 5A Prime', 1100, 60],['Замена основной камеры', 'Redmi Note 5A Prime', 2250, 60],['Замена передней камеры(Себяшки)', 'Redmi Note 5A Prime', 1800, 60],['Замена кнопки включения', 'Redmi Note 5A Prime', 1150, 60],['Замена микрофона', 'Redmi Note 5A Prime', 1200, 60],['Замена разъема зарядки/гарнитуры', 'Redmi Note 5A Prime', 1250, 60],['Замена шлейфа', 'Redmi Note 5A Prime', 1250, 60],['Программный ремонт/Обновление ПО', 'Redmi Note 5A Prime', 1000, 90],['Ремонт кнопки Home', 'Redmi Note 5A Prime', 1750, 60],['Технически сложный ремонт', 'Redmi Note 5A Prime', 1100, 90],['Восстановление после попадания воды', 'Redmi Y1 Lite', 700, 50],['Замена аккумулятора', 'Redmi Y1 Lite', 1300, 40],['Замена датчика приближения', 'Redmi Y1 Lite', 990, 45],['Замена динамика/звонка', 'Redmi Y1 Lite', 1050, 40],['Замена дисплея', 'Redmi Y1 Lite', 2200, 90],['Замена задней крышки', 'Redmi Y1 Lite', 1350, 60],['Замена основной камеры', 'Redmi Y1 Lite', 1750, 60],['Замена передней камеры(Себяшки)', 'Redmi Y1 Lite', 1650, 60],['Замена кнопки включения', 'Redmi Y1 Lite', 1100, 60],['Замена микрофона', 'Redmi Y1 Lite', 1050, 60],['Замена разъема зарядки/гарнитуры', 'Redmi Y1 Lite', 1200, 60],['Замена шлейфа', 'Redmi Y1 Lite', 1200, 60],['Программный ремонт/Обновление ПО', 'Redmi Y1 Lite', 1000, 90],['Ремонт кнопки Home', 'Redmi Y1 Lite', 1500, 60],['Технически сложный ремонт', 'Redmi Y1 Lite', 1100, 90],['Восстановление после попадания воды', 'Redmi Y1', 700, 50],['Замена аккумулятора', 'Redmi Y1', 1300, 40],['Замена датчика приближения', 'Redmi Y1', 990, 45],['Замена динамика/звонка', 'Redmi Y1', 1050, 40],['Замена дисплея', 'Redmi Y1', 2200, 90],['Замена задней крышки', 'Redmi Y1', 1350, 60],['Замена основной камеры', 'Redmi Y1', 1750, 60],['Замена передней камеры(Себяшки)', 'Redmi Y1', 1650, 60],['Замена кнопки включения', 'Redmi Y1', 1100, 60],['Замена микрофона', 'Redmi Y1', 1050, 60],['Замена разъема зарядки/гарнитуры', 'Redmi Y1', 1200, 60],['Замена шлейфа', 'Redmi Y1', 1200, 60],['Программный ремонт/Обновление ПО', 'Redmi Y1', 1000, 90],['Ремонт кнопки Home', 'Redmi Y1', 1500, 60],['Технически сложный ремонт', 'Redmi Y1', 1100, 90],['Восстановление после попадания воды', 'Redmi S2', 800, 50],['Замена аккумулятора', 'Redmi S2', 1320, 40],['Замена датчика приближения', 'Redmi S2', 1150, 45],['Замена динамика/звонка', 'Redmi S2', 1150, 40],['Замена дисплея', 'Redmi S2', 2390, 90],['Замена задней крышки', 'Redmi S2', 1190, 60],['Замена основной камеры', 'Redmi S2', 2300, 60],['Замена передней камеры(Себяшки)', 'Redmi S2', 1850, 60],['Замена кнопки включения', 'Redmi S2', 1200, 60],['Замена микрофона', 'Redmi S2', 1200, 60],['Замена разъема зарядки/гарнитуры', 'Redmi S2', 1200, 60],['Замена шлейфа', 'Redmi S2', 1200, 60],['Программный ремонт/Обновление ПО', 'Redmi S2', 1000, 90],['Ремонт кнопки Home', 'Redmi S2', 1700, 60],['Технически сложный ремонт', 'Redmi S2', 1200, 90],['Восстановление после попадания воды', 'Redmi Pro', 800, 50],['Замена аккумулятора', 'Redmi Pro', 1220, 40],['Замена датчика приближения', 'Redmi Pro', 1150, 45],['Замена динамика/звонка', 'Redmi Pro', 1150, 40],['Замена дисплея', 'Redmi Pro', 4250, 90],['Замена задней крышки', 'Redmi Pro', 1550, 60],['Замена основной камеры', 'Redmi Pro', 2250, 60],['Замена передней камеры(Себяшки)', 'Redmi Pro', 1900, 60],['Замена кнопки включения', 'Redmi Pro', 1200, 60],['Замена микрофона', 'Redmi Pro', 1250, 60],['Замена разъема зарядки/гарнитуры', 'Redmi Pro', 1300, 60],['Замена шлейфа', 'Redmi Pro', 1300, 60],['Программный ремонт/Обновление ПО', 'Redmi Pro', 1000, 90],['Ремонт кнопки Home', 'Redmi Pro', 1750, 60],['Технически сложный ремонт', 'Redmi Pro', 1200, 90],['Восстановление после попадания воды', 'Redmi Note 6 Pro', 850, 50],['Замена аккумулятора', 'Redmi Note 6 Pro', 1350, 40],['Замена датчика приближения', 'Redmi Note 6 Pro', 1200, 45],['Замена динамика/звонка', 'Redmi Note 6 Pro', 1200, 40],['Замена дисплея', 'Redmi Note 6 Pro', 2950, 90],['Замена задней крышки', 'Redmi Note 6 Pro', 1300, 60],['Замена основной камеры', 'Redmi Note 6 Pro', 2450, 60],['Замена передней камеры(Себяшки)', 'Redmi Note 6 Pro', 1850, 60],['Замена кнопки включения', 'Redmi Note 6 Pro', 1200, 60],['Замена микрофона', 'Redmi Note 6 Pro', 1200, 60],['Замена разъема зарядки/гарнитуры', 'Redmi Note 6 Pro', 1250, 60],['Замена шлейфа', 'Redmi Note 6 Pro', 1300, 60],['Программный ремонт/Обновление ПО', 'Redmi Note 6 Pro', 1000, 90],['Ремонт кнопки Home', 'Redmi Note 6 Pro', 1700, 60],['Технически сложный ремонт', 'Redmi Note 6 Pro', 1300, 90],['Восстановление после попадания воды', 'Redmi Note 5A', 800, 50],['Замена аккумулятора', 'Redmi Note 5A', 1350, 40],['Замена датчика приближения', 'Redmi Note 5A', 1200, 45],['Замена динамика/звонка', 'Redmi Note 5A', 1200, 40],['Замена дисплея', 'Redmi Note 5A', 2230, 90],['Замена задней крышки', 'Redmi Note 5A', 1250, 60],['Замена основной камеры', 'Redmi Note 5A', 2300, 60],['Замена передней камеры(Себяшки)', 'Redmi Note 5A', 1850, 60],['Замена кнопки включения', 'Redmi Note 5A', 1200, 60],['Замена микрофона', 'Redmi Note 5A', 1200, 60],['Замена разъема зарядки/гарнитуры', 'Redmi Note 5A', 1250, 60],['Замена шлейфа', 'Redmi Note 5A', 1300, 60],['Программный ремонт/Обновление ПО', 'Redmi Note 5A', 1000, 90],['Ремонт кнопки Home', 'Redmi Note 5A', 1700, 60],['Технически сложный ремонт', 'Redmi Note 5A', 1250, 90],['Восстановление после попадания воды', 'Redmi Note 5 Pro', 850, 50],['Замена аккумулятора', 'Redmi Note 5 Pro', 1380, 40],['Замена датчика приближения', 'Redmi Note 5 Pro', 1200, 45],['Замена динамика/звонка', 'Redmi Note 5 Pro', 1200, 40],['Замена дисплея', 'Redmi Note 5 Pro', 2670, 90],['Замена задней крышки', 'Redmi Note 5 Pro', 1250, 60],['Замена основной камеры', 'Redmi Note 5 Pro', 2370, 60],['Замена передней камеры(Себяшки)', 'Redmi Note 5 Pro', 1850, 60],['Замена кнопки включения', 'Redmi Note 5 Pro', 1200, 60],['Замена микрофона', 'Redmi Note 5 Pro', 1200, 60],['Замена разъема зарядки/гарнитуры', 'Redmi Note 5 Pro', 1250, 60],['Замена шлейфа', 'Redmi Note 5 Pro', 1300, 60],['Программный ремонт/Обновление ПО', 'Redmi Note 5 Pro', 1000, 90],['Ремонт кнопки Home', 'Redmi Note 5 Pro', 1700, 60],['Технически сложный ремонт', 'Redmi Note 5 Pro', 1250, 90],['Восстановление после попадания воды', 'Redmi Note 5', 850, 50],['Замена аккумулятора', 'Redmi Note 5', 1380, 40],['Замена датчика приближения', 'Redmi Note 5', 1200, 45],['Замена динамика/звонка', 'Redmi Note 5', 1200, 40],['Замена дисплея', 'Redmi Note 5', 2670, 90],['Замена задней крышки', 'Redmi Note 5', 1250, 60],['Замена основной камеры', 'Redmi Note 5', 2300, 60],['Замена передней камеры(Себяшки)', 'Redmi Note 5', 1850, 60],['Замена кнопки включения', 'Redmi Note 5', 1150, 60],['Замена микрофона', 'Redmi Note 5', 1200, 60],['Замена разъема зарядки/гарнитуры', 'Redmi Note 5', 1250, 60],['Замена шлейфа', 'Redmi Note 5', 1300, 60],['Программный ремонт/Обновление ПО', 'Redmi Note 5', 1000, 90],['Ремонт кнопки Home', 'Redmi Note 5', 1700, 60],['Технически сложный ремонт', 'Redmi Note 5', 1250, 90],['Восстановление после попадания воды', 'Redmi Note 4X', 750, 50],['Замена аккумулятора', 'Redmi Note 4X', 1295, 40],['Замена датчика приближения', 'Redmi Note 4X', 990, 45],['Замена динамика/звонка', 'Redmi Note 4X', 1000, 40],['Замена дисплея', 'Redmi Note 4X', 2210, 90],['Замена задней крышки', 'Redmi Note 4X', 1300, 60],['Замена основной камеры', 'Redmi Note 4X', 1700, 60],['Замена передней камеры(Себяшки)', 'Redmi Note 4X', 1650, 60],['Замена кнопки включения', 'Redmi Note 4X', 1150, 60],['Замена микрофона', 'Redmi Note 4X', 1050, 60],['Замена разъема зарядки/гарнитуры', 'Redmi Note 4X', 1100, 60],['Замена шлейфа', 'Redmi Note 4X', 1250, 60],['Программный ремонт/Обновление ПО', 'Redmi Note 4X', 1000, 90],['Ремонт кнопки Home', 'Redmi Note 4X', 1450, 60],['Технически сложный ремонт', 'Redmi Note 4X', 1100, 90],['Восстановление после попадания воды', 'Redmi Note 4G', 750, 50],['Замена аккумулятора', 'Redmi Note 4G', 1295, 40],['Замена датчика приближения', 'Redmi Note 4G', 990, 45],['Замена динамика/звонка', 'Redmi Note 4G', 1000, 40],['Замена дисплея', 'Redmi Note 4G', 2200, 90],['Замена задней крышки', 'Redmi Note 4G', 1300, 60],['Замена основной камеры', 'Redmi Note 4G', 1650, 60],['Замена передней камеры(Себяшки)', 'Redmi Note 4G', 1650, 60],['Замена кнопки включения', 'Redmi Note 4G', 1150, 60],['Замена микрофона', 'Redmi Note 4G', 1050, 60],['Замена разъема зарядки/гарнитуры', 'Redmi Note 4G', 1100, 60],['Замена шлейфа', 'Redmi Note 4G', 1250, 60],['Программный ремонт/Обновление ПО', 'Redmi Note 4G', 1000, 90],['Ремонт кнопки Home', 'Redmi Note 4G', 1450, 60],['Технически сложный ремонт', 'Redmi Note 4G', 1100, 90],['Восстановление после попадания воды', 'Redmi Note 4 Pro', 750, 50],['Замена аккумулятора', 'Redmi Note 4 Pro', 1270, 40],['Замена датчика приближения', 'Redmi Note 4 Pro', 990, 45],['Замена динамика/звонка', 'Redmi Note 4 Pro', 1000, 40],['Замена дисплея', 'Redmi Note 4 Pro', 2200, 90],['Замена задней крышки', 'Redmi Note 4 Pro', 1300, 60],['Замена основной камеры', 'Redmi Note 4 Pro', 1650, 60],['Замена передней камеры(Себяшки)', 'Redmi Note 4 Pro', 1650, 60],['Замена кнопки включения', 'Redmi Note 4 Pro', 1150, 60],['Замена микрофона', 'Redmi Note 4 Pro', 1050, 60],['Замена разъема зарядки/гарнитуры', 'Redmi Note 4 Pro', 1100, 60],['Замена шлейфа', 'Redmi Note 4 Pro', 1250, 60],['Программный ремонт/Обновление ПО', 'Redmi Note 4 Pro', 1000, 90],['Ремонт кнопки Home', 'Redmi Note 4 Pro', 1450, 60],['Технически сложный ремонт', 'Redmi Note 4 Pro', 1100, 90],['Восстановление после попадания воды', 'Redmi Note 4', 750, 50],['Замена аккумулятора', 'Redmi Note 4', 1270, 40],['Замена датчика приближения', 'Redmi Note 4', 990, 45],['Замена динамика/звонка', 'Redmi Note 4', 1000, 40],['Замена дисплея', 'Redmi Note 4', 2200, 90],['Замена задней крышки', 'Redmi Note 4', 1300, 60],['Замена основной камеры', 'Redmi Note 4', 1600, 60],['Замена передней камеры(Себяшки)', 'Redmi Note 4', 1650, 60],['Замена кнопки включения', 'Redmi Note 4', 1150, 60],['Замена микрофона', 'Redmi Note 4', 1050, 60],['Замена разъема зарядки/гарнитуры', 'Redmi Note 4', 1100, 60],['Замена шлейфа', 'Redmi Note 4', 1250, 60],['Программный ремонт/Обновление ПО', 'Redmi Note 4', 1000, 90],['Ремонт кнопки Home', 'Redmi Note 4', 1450, 60],['Технически сложный ремонт', 'Redmi Note 4', 1100, 90],['Восстановление после попадания воды', 'Redmi Note 3 Pro SE', 700, 50],['Замена аккумулятора', 'Redmi Note 3 Pro SE', 1290, 40],['Замена датчика приближения', 'Redmi Note 3 Pro SE', 990, 45],['Замена динамика/звонка', 'Redmi Note 3 Pro SE', 950, 40],['Замена дисплея', 'Redmi Note 3 Pro SE', 2190, 90],['Замена задней крышки', 'Redmi Note 3 Pro SE', 1300, 60],['Замена основной камеры', 'Redmi Note 3 Pro SE', 1550, 60],['Замена передней камеры(Себяшки)', 'Redmi Note 3 Pro SE', 1550, 60],['Замена кнопки включения', 'Redmi Note 3 Pro SE', 1150, 60],['Замена микрофона', 'Redmi Note 3 Pro SE', 1020, 60],['Замена разъема зарядки/гарнитуры', 'Redmi Note 3 Pro SE', 1050, 60],['Замена шлейфа', 'Redmi Note 3 Pro SE', 1200, 60],['Программный ремонт/Обновление ПО', 'Redmi Note 3 Pro SE', 1000, 90],['Ремонт кнопки Home', 'Redmi Note 3 Pro SE', 1400, 60],['Технически сложный ремонт', 'Redmi Note 3 Pro SE', 1100, 90],['Восстановление после попадания воды', 'Redmi Note 3 Pro', 700, 50],['Замена аккумулятора', 'Redmi Note 3 Pro', 1290, 40],['Замена датчика приближения', 'Redmi Note 3 Pro', 990, 45],['Замена динамика/звонка', 'Redmi Note 3 Pro', 950, 40],['Замена дисплея', 'Redmi Note 3 Pro', 2190, 90],['Замена задней крышки', 'Redmi Note 3 Pro', 1300, 60],['Замена основной камеры', 'Redmi Note 3 Pro', 1550, 60],['Замена передней камеры(Себяшки)', 'Redmi Note 3 Pro', 1550, 60],['Замена кнопки включения', 'Redmi Note 3 Pro', 1150, 60],['Замена микрофона', 'Redmi Note 3 Pro', 1020, 60],['Замена разъема зарядки/гарнитуры', 'Redmi Note 3 Pro', 1050, 60],['Замена шлейфа', 'Redmi Note 3 Pro', 1200, 60],['Программный ремонт/Обновление ПО', 'Redmi Note 3 Pro', 1000, 90],['Ремонт кнопки Home', 'Redmi Note 3 Pro', 1400, 60],['Технически сложный ремонт', 'Redmi Note 3 Pro', 1100, 90],['Восстановление после попадания воды', 'Redmi Note 3', 700, 50],['Замена аккумулятора', 'Redmi Note 3', 1290, 40],['Замена датчика приближения', 'Redmi Note 3', 990, 45],['Замена динамика/звонка', 'Redmi Note 3', 950, 40],['Замена дисплея', 'Redmi Note 3', 2190, 90],['Замена задней крышки', 'Redmi Note 3', 1300, 60],['Замена основной камеры', 'Redmi Note 3', 1550, 60],['Замена передней камеры(Себяшки)', 'Redmi Note 3', 1550, 60],['Замена кнопки включения', 'Redmi Note 3', 1000, 60],['Замена микрофона', 'Redmi Note 3', 1020, 60],['Замена разъема зарядки/гарнитуры', 'Redmi Note 3', 1050, 60],['Замена шлейфа', 'Redmi Note 3', 1200, 60],['Программный ремонт/Обновление ПО', 'Redmi Note 3', 1000, 90],['Ремонт кнопки Home', 'Redmi Note 3', 1400, 60],['Технически сложный ремонт', 'Redmi Note 3', 1000, 90],['Восстановление после попадания воды', 'Redmi Note 2 Prime', 650, 50],['Замена аккумулятора', 'Redmi Note 2 Prime', 1190, 40],['Замена датчика приближения', 'Redmi Note 2 Prime', 990, 45],['Замена динамика/звонка', 'Redmi Note 2 Prime', 900, 40],['Замена дисплея', 'Redmi Note 2 Prime', 2430, 90],['Замена задней крышки', 'Redmi Note 2 Prime', 990, 60],['Замена основной камеры', 'Redmi Note 2 Prime', 1500, 60],['Замена передней камеры(Себяшки)', 'Redmi Note 2 Prime', 1500, 60],['Замена кнопки включения', 'Redmi Note 2 Prime', 1000, 60],['Замена разъема зарядки/гарнитуры', 'Redmi Note 2 Prime', 1050, 60],['Замена шлейфа', 'Redmi Note 2 Prime', 1200, 60],['Программный ремонт/Обновление ПО', 'Redmi Note 2 Prime', 1000, 90],['Ремонт кнопки Home', 'Redmi Note 2 Prime', 1400, 60],['Технически сложный ремонт', 'Redmi Note 2 Prime', 1000, 90],['Восстановление после попадания воды', 'Redmi Note 2', 650, 50],['Замена аккумулятора', 'Redmi Note 2', 1190, 40],['Замена датчика приближения', 'Redmi Note 2', 900, 45],['Замена динамика/звонка', 'Redmi Note 2', 900, 40],['Замена дисплея', 'Redmi Note 2', 2430, 90],['Замена задней крышки', 'Redmi Note 2', 990, 60],['Замена основной камеры', 'Redmi Note 2', 1500, 60],['Замена передней камеры(Себяшки)', 'Redmi Note 2', 1500, 60],['Замена кнопки включения', 'Redmi Note 2', 1000, 60],['Замена микрофона', 'Redmi Note 2', 1000, 60],['Замена разъема зарядки/гарнитуры', 'Redmi Note 2', 1050, 60],['Замена шлейфа', 'Redmi Note 2', 1200, 60],['Программный ремонт/Обновление ПО', 'Redmi Note 2', 1000, 90],['Ремонт кнопки Home', 'Redmi Note 2', 1400, 60],['Технически сложный ремонт', 'Redmi Note 2', 1000, 90],['Восстановление после попадания воды', 'Redmi Note', 650, 50],['Замена аккумулятора', 'Redmi Note', 1190, 40],['Замена датчика приближения', 'Redmi Note', 990, 45],['Замена динамика/звонка', 'Redmi Note', 900, 40],['Замена дисплея', 'Redmi Note', 2430, 90],['Замена задней крышки', 'Redmi Note', 1000, 60],['Замена основной камеры', 'Redmi Note', 1500, 60],['Замена передней камеры(Себяшки)', 'Redmi Note', 1500, 60],['Замена кнопки включения', 'Redmi Note', 1000, 60],['Замена микрофона', 'Redmi Note', 1000, 60],['Замена разъема зарядки/гарнитуры', 'Redmi Note', 1050, 60],['Замена шлейфа', 'Redmi Note', 1200, 60],['Программный ремонт/Обновление ПО', 'Redmi Note', 1000, 90],['Ремонт кнопки Home', 'Redmi Note', 1350, 60],['Технически сложный ремонт', 'Redmi Note', 1000, 90],['Восстановление после попадания воды', 'Redmi 6A', 800, 50],['Замена аккумулятора', 'Redmi 6A', 1235, 40],['Замена датчика приближения', 'Redmi 6A', 1050, 45],['Замена динамика/звонка', 'Redmi 6A', 1100, 40],['Замена дисплея', 'Redmi 6A', 2200, 90],['Замена задней крышки', 'Redmi 6A', 1100, 60],['Замена основной камеры', 'Redmi 6A', 1990, 60],['Замена передней камеры(Себяшки)', 'Redmi 6A', 1750, 60],['Замена кнопки включения', 'Redmi 6A', 1100, 60],['Замена микрофона', 'Redmi 6A', 1100, 60],['Замена разъема зарядки/гарнитуры', 'Redmi 6A', 1250, 60],['Замена шлейфа', 'Redmi 6A', 1250, 60],['Программный ремонт/Обновление ПО', 'Redmi 6A', 1000, 90],['Ремонт кнопки Home', 'Redmi 6A', 1550, 60],['Технически сложный ремонт', 'Redmi 6A', 1150, 90],['Восстановление после попадания воды', 'Redmi 6 Pro', 800, 50],['Замена аккумулятора', 'Redmi 6 Pro', 1245, 40],['Замена датчика приближения', 'Redmi 6 Pro', 1050, 45],['Замена динамика/звонка', 'Redmi 6 Pro', 1100, 40],['Замена дисплея', 'Redmi 6 Pro', 2450, 90],['Замена задней крышки', 'Redmi 6 Pro', 1250, 60],['Замена основной камеры', 'Redmi 6 Pro', 2100, 60],['Замена передней камеры(Себяшки)', 'Redmi 6 Pro', 1750, 60],['Замена кнопки включения', 'Redmi 6 Pro', 1100, 60],['Замена микрофона', 'Redmi 6 Pro', 1150, 60],['Замена разъема зарядки/гарнитуры', 'Redmi 6 Pro', 1250, 60],['Замена шлейфа', 'Redmi 6 Pro', 1250, 60],['Программный ремонт/Обновление ПО', 'Redmi 6 Pro', 1000, 90],['Ремонт кнопки Home', 'Redmi 6 Pro', 1750, 60],['Технически сложный ремонт', 'Redmi 6 Pro', 1150, 90],['Восстановление после попадания воды', 'Redmi 6', 800, 50],['Замена аккумулятора', 'Redmi 6', 1235, 40],['Замена датчика приближения', 'Redmi 6', 1050, 45],['Замена динамика/звонка', 'Redmi 6', 1100, 40],['Замена дисплея', 'Redmi 6', 2200, 90],['Замена задней крышки', 'Redmi 6', 1100, 60],['Замена основной камеры', 'Redmi 6', 2100, 60],['Замена передней камеры(Себяшки)', 'Redmi 6', 1750, 60],['Замена кнопки включения', 'Redmi 6', 1100, 60],['Замена микрофона', 'Redmi 6', 1100, 60],['Замена разъема зарядки/гарнитуры', 'Redmi 6', 1250, 60],['Замена шлейфа', 'Redmi 6', 1250, 60],['Программный ремонт/Обновление ПО', 'Redmi 6', 1000, 90],['Ремонт кнопки Home', 'Redmi 6', 1650, 60],['Технически сложный ремонт', 'Redmi 6', 1150, 90],['Восстановление после попадания воды', 'Redmi 5A', 800, 50],['Замена аккумулятора', 'Redmi 5A', 1235, 40],['Замена датчика приближения', 'Redmi 5A', 1050, 45],['Замена динамика/звонка', 'Redmi 5A', 1090, 40],['Замена дисплея', 'Redmi 5A', 2100, 90],['Замена задней крышки', 'Redmi 5A', 990, 60],['Замена основной камеры', 'Redmi 5A', 2100, 60],['Замена передней камеры(Себяшки)', 'Redmi 5A', 1700, 60],['Замена кнопки включения', 'Redmi 5A', 1100, 60],['Замена микрофона', 'Redmi 5A', 1100, 60],['Замена разъема зарядки/гарнитуры', 'Redmi 5A', 1200, 60],['Замена шлейфа', 'Redmi 5A', 1250, 60],['Программный ремонт/Обновление ПО', 'Redmi 5A', 1000, 90],['Ремонт кнопки Home', 'Redmi 5A', 1600, 60],['Технически сложный ремонт', 'Redmi 5A', 1100, 90],['Восстановление после попадания воды', 'Redmi 5 Plus', 800, 50],['Замена аккумулятора', 'Redmi 5 Plus', 1330, 40],['Замена датчика приближения', 'Redmi 5 Plus', 1050, 45],['Замена динамика/звонка', 'Redmi 5 Plus', 1150, 40],['Замена дисплея', 'Redmi 5 Plus', 2610, 90],['Замена задней крышки', 'Redmi 5 Plus', 1050, 60],['Замена основной камеры', 'Redmi 5 Plus', 2200, 60],['Замена передней камеры(Себяшки)', 'Redmi 5 Plus', 1750, 60],['Замена кнопки включения', 'Redmi 5 Plus', 1200, 60],['Замена микрофона', 'Redmi 5 Plus', 1200, 60],['Замена разъема зарядки/гарнитуры', 'Redmi 5 Plus', 1250, 60],['Замена шлейфа', 'Redmi 5 Plus', 1250, 60],['Программный ремонт/Обновление ПО', 'Redmi 5 Plus', 1000, 90],['Ремонт кнопки Home', 'Redmi 5 Plus', 1650, 60],['Технически сложный ремонт', 'Redmi 5 Plus', 1200, 90],['Восстановление после попадания воды', 'Redmi 5', 800, 50],['Замена аккумулятора', 'Redmi 5', 1275, 40],['Замена датчика приближения', 'Redmi 5', 1090, 45],['Замена динамика/звонка', 'Redmi 5', 1100, 40],['Замена дисплея', 'Redmi 5', 2290, 90],['Замена задней крышки', 'Redmi 5', 1100, 60],['Замена основной камеры', 'Redmi 5', 2200, 60],['Замена передней камеры(Себяшки)', 'Redmi 5', 1750, 60],['Замена кнопки включения', 'Redmi 5', 1100, 60],['Замена микрофона', 'Redmi 5', 1100, 60],['Замена разъема зарядки/гарнитуры', 'Redmi 5', 1200, 60],['Замена шлейфа', 'Redmi 5', 1250, 60],['Программный ремонт/Обновление ПО', 'Redmi 5', 1000, 90],['Ремонт кнопки Home', 'Redmi 5', 1650, 60],['Технически сложный ремонт', 'Redmi 5', 1100, 90],['Восстановление после попадания воды', 'Redmi 4X', 750, 50],['Замена аккумулятора', 'Redmi 4X', 1235, 40],['Замена датчика приближения', 'Redmi 4X', 990, 45],['Замена динамика/звонка', 'Redmi 4X', 990, 40],['Замена дисплея', 'Redmi 4X', 1990, 90],['Замена задней крышки', 'Redmi 4X', 1000, 60],['Замена основной камеры', 'Redmi 4X', 1500, 60],['Замена передней камеры(Себяшки)', 'Redmi 4X', 1600, 60],['Замена кнопки включения', 'Redmi 4X', 990, 60],['Замена микрофона', 'Redmi 4X', 1000, 60],['Замена разъема зарядки/гарнитуры', 'Redmi 4X', 1050, 60],['Замена шлейфа', 'Redmi 4X', 1150, 60],['Программный ремонт/Обновление ПО', 'Redmi 4X', 1000, 90],['Ремонт кнопки Home', 'Redmi 4X', 1300, 60],['Технически сложный ремонт', 'Redmi 4X', 1000, 90],['Восстановление после попадания воды', 'Redmi 4A', 750, 50],['Замена аккумулятора', 'Redmi 4A', 1235, 40],['Замена датчика приближения', 'Redmi 4A', 990, 45],['Замена динамика/звонка', 'Redmi 4A', 990, 40],['Замена дисплея', 'Redmi 4A', 2020, 90],['Замена задней крышки', 'Redmi 4A', 1000, 60],['Замена основной камеры', 'Redmi 4A', 1500, 60],['Замена передней камеры(Себяшки)', 'Redmi 4A', 1600, 60],['Замена кнопки включения', 'Redmi 4A', 990, 60],['Замена микрофона', 'Redmi 4A', 1000, 60],['Замена разъема зарядки/гарнитуры', 'Redmi 4A', 1050, 60],['Замена шлейфа', 'Redmi 4A', 1150, 60],['Программный ремонт/Обновление ПО', 'Redmi 4A', 1000, 90],['Ремонт кнопки Home', 'Redmi 4A', 1300, 60],['Технически сложный ремонт', 'Redmi 4A', 1000, 90],['Восстановление после попадания воды', 'Redmi 4', 750, 50],['Замена аккумулятора', 'Redmi 4', 1235, 40],['Замена датчика приближения', 'Redmi 4', 990, 45],['Замена динамика/звонка', 'Redmi 4', 990, 40],['Замена дисплея', 'Redmi 4', 2270, 90],['Замена задней крышки', 'Redmi 4', 1000, 60],['Замена основной камеры', 'Redmi 4', 1500, 60],['Замена передней камеры(Себяшки)', 'Redmi 4', 1600, 60],['Замена кнопки включения', 'Redmi 4', 990, 60],['Замена микрофона', 'Redmi 4', 1000, 60],['Замена разъема зарядки/гарнитуры', 'Redmi 4', 1050, 60],['Замена шлейфа', 'Redmi 4', 1150, 60],['Программный ремонт/Обновление ПО', 'Redmi 4', 1000, 90],['Ремонт кнопки Home', 'Redmi 4', 1300, 60],['Технически сложный ремонт', 'Redmi 4', 1000, 90],['Восстановление после попадания воды', 'Redmi 3X', 700, 50],['Замена аккумулятора', 'Redmi 3X', 1235, 40],['Замена датчика приближения', 'Redmi 3X', 990, 45],['Замена динамика/звонка', 'Redmi 3X', 950, 40],['Замена дисплея', 'Redmi 3X', 1950, 90],['Замена задней крышки', 'Redmi 3X', 1150, 60],['Замена основной камеры', 'Redmi 3X', 1500, 60],['Замена передней камеры(Себяшки)', 'Redmi 3X', 1600, 60],['Замена кнопки включения', 'Redmi 3X', 990, 60],['Замена микрофона', 'Redmi 3X', 1000, 60],['Замена разъема зарядки/гарнитуры', 'Redmi 3X', 1050, 60],['Замена шлейфа', 'Redmi 3X', 1150, 60],['Программный ремонт/Обновление ПО', 'Redmi 3X', 1000, 90],['Ремонт кнопки Home', 'Redmi 3X', 1300, 60],['Технически сложный ремонт', 'Redmi 3X', 1000, 90],['Восстановление после попадания воды', 'Redmi 3S ', 700, 50],['Замена аккумулятора', 'Redmi 3S ', 1235, 40],['Замена датчика приближения', 'Redmi 3S ', 990, 45],['Замена динамика/звонка', 'Redmi 3S ', 950, 40],['Замена дисплея', 'Redmi 3S ', 1950, 90],['Замена задней крышки', 'Redmi 3S ', 1150, 60],['Замена основной камеры', 'Redmi 3S ', 1500, 60],['Замена передней камеры(Себяшки)', 'Redmi 3S ', 1600, 60],['Замена кнопки включения', 'Redmi 3S ', 990, 60],['Замена микрофона', 'Redmi 3S ', 1000, 60],['Замена разъема зарядки/гарнитуры', 'Redmi 3S ', 1050, 60],['Замена шлейфа', 'Redmi 3S ', 1150, 60],['Программный ремонт/Обновление ПО', 'Redmi 3S ', 1000, 90],['Ремонт кнопки Home', 'Redmi 3S ', 1300, 60],['Технически сложный ремонт', 'Redmi 3S ', 1000, 90],['Восстановление после попадания воды', 'Redmi 3 Pro', 700, 50],['Замена аккумулятора', 'Redmi 3 Pro', 1235, 40],['Замена датчика приближения', 'Redmi 3 Pro', 990, 45],['Замена динамика/звонка', 'Redmi 3 Pro', 950, 40],['Замена дисплея', 'Redmi 3 Pro', 1950, 90],['Замена задней крышки', 'Redmi 3 Pro', 1150, 60],['Замена основной камеры', 'Redmi 3 Pro', 1500, 60],['Замена передней камеры(Себяшки)', 'Redmi 3 Pro', 1600, 60],['Замена кнопки включения', 'Redmi 3 Pro', 990, 60],['Замена микрофона', 'Redmi 3 Pro', 1000, 60],['Замена разъема зарядки/гарнитуры', 'Redmi 3 Pro', 1050, 60],['Замена шлейфа', 'Redmi 3 Pro', 1150, 60],['Программный ремонт/Обновление ПО', 'Redmi 3 Pro', 1000, 90],['Ремонт кнопки Home', 'Redmi 3 Pro', 1300, 60],['Технически сложный ремонт', 'Redmi 3 Pro', 1000, 90],['Восстановление после попадания воды', 'Redmi 3', 700, 50],['Замена аккумулятора', 'Redmi 3', 1235, 40],['Замена датчика приближения', 'Redmi 3', 990, 45],['Замена динамика/звонка', 'Redmi 3', 950, 40],['Замена дисплея', 'Redmi 3', 1950, 90],['Замена задней крышки', 'Redmi 3', 1150, 60],['Замена основной камеры', 'Redmi 3', 1500, 60],['Замена передней камеры(Себяшки)', 'Redmi 3', 1600, 60],['Замена кнопки включения', 'Redmi 3', 990, 60],['Замена микрофона', 'Redmi 3', 1000, 60],['Замена разъема зарядки/гарнитуры', 'Redmi 3', 1050, 60],['Замена шлейфа', 'Redmi 3', 1150, 60],['Программный ремонт/Обновление ПО', 'Redmi 3', 1000, 90],['Ремонт кнопки Home', 'Redmi 3', 1300, 60],['Технически сложный ремонт', 'Redmi 3', 1000, 90],['Восстановление после попадания воды', 'Redmi 2A', 650, 50],['Замена аккумулятора', 'Redmi 2A', 1150, 40],['Замена датчика приближения', 'Redmi 2A', 900, 45],['Замена динамика/звонка', 'Redmi 2A', 900, 40],['Замена дисплея', 'Redmi 2A', 1950, 90],['Замена задней крышки', 'Redmi 2A', 990, 60],['Замена основной камеры', 'Redmi 2A', 1500, 60],['Замена передней камеры(Себяшки)', 'Redmi 2A', 1600, 60],['Замена кнопки включения', 'Redmi 2A', 990, 60],['Замена микрофона', 'Redmi 2A', 1000, 60],['Замена разъема зарядки/гарнитуры', 'Redmi 2A', 1050, 60],['Замена шлейфа', 'Redmi 2A', 1150, 60],['Программный ремонт/Обновление ПО', 'Redmi 2A', 1000, 90],['Ремонт кнопки Home', 'Redmi 2A', 1100, 60],['Технически сложный ремонт', 'Redmi 2A', 1000, 90],['Восстановление после попадания воды', 'Redmi 2 Prime', 650, 50],['Замена аккумулятора', 'Redmi 2 Prime', 1150, 40],['Замена датчика приближения', 'Redmi 2 Prime', 900, 45],['Замена динамика/звонка', 'Redmi 2 Prime', 900, 40],['Замена дисплея', 'Redmi 2 Prime', 1950, 90],['Замена задней крышки', 'Redmi 2 Prime', 990, 60],['Замена основной камеры', 'Redmi 2 Prime', 1500, 60],['Замена передней камеры(Себяшки)', 'Redmi 2 Prime', 1600, 60],['Замена кнопки включения', 'Redmi 2 Prime', 990, 60],['Замена микрофона', 'Redmi 2 Prime', 1000, 60],['Замена разъема зарядки/гарнитуры', 'Redmi 2 Prime', 1050, 60],['Замена шлейфа', 'Redmi 2 Prime', 1150, 60],['Программный ремонт/Обновление ПО', 'Redmi 2 Prime', 1000, 90],['Ремонт кнопки Home', 'Redmi 2 Prime', 1100, 60],['Технически сложный ремонт', 'Redmi 2 Prime', 1000, 90],['Восстановление после попадания воды', 'Redmi 2', 650, 50],['Замена аккумулятора', 'Redmi 2', 1150, 40],['Замена датчика приближения', 'Redmi 2', 900, 45],['Замена динамика/звонка', 'Redmi 2', 900, 40],['Замена дисплея', 'Redmi 2', 1950, 90],['Замена задней крышки', 'Redmi 2', 990, 60],['Замена основной камеры', 'Redmi 2', 1500, 60],['Замена передней камеры(Себяшки)', 'Redmi 2', 1600, 60],['Замена кнопки включения', 'Redmi 2', 990, 60],['Замена микрофона', 'Redmi 2', 1000, 60],['Замена разъема зарядки/гарнитуры', 'Redmi 2', 1050, 60],['Замена шлейфа', 'Redmi 2', 1150, 60],['Программный ремонт/Обновление ПО', 'Redmi 2', 1000, 90],['Ремонт кнопки Home', 'Redmi 2', 1100, 60],['Технически сложный ремонт', 'Redmi 2', 1000, 90],['Восстановление после попадания воды', 'Redmi 1S', 650, 50],['Замена аккумулятора', 'Redmi 1S', 1150, 40],['Замена датчика приближения', 'Redmi 1S', 900, 45],['Замена динамика/звонка', 'Redmi 1S', 900, 40],['Замена дисплея', 'Redmi 1S', 2200, 90],['Замена задней крышки', 'Redmi 1S', 1100, 60],['Замена основной камеры', 'Redmi 1S', 1550, 60],['Замена передней камеры(Себяшки)', 'Redmi 1S', 1600, 60],['Замена кнопки включения', 'Redmi 1S', 990, 60],['Замена микрофона', 'Redmi 1S', 1000, 60],['Замена разъема зарядки/гарнитуры', 'Redmi 1S', 1050, 60],['Замена шлейфа', 'Redmi 1S', 1150, 60],['Программный ремонт/Обновление ПО', 'Redmi 1S', 1000, 90],['Ремонт кнопки Home', 'Redmi 1S', 1200, 60],['Технически сложный ремонт', 'Redmi 1S', 1000, 90],['Восстановление после попадания воды', 'Redmi', 600, 50],['Замена аккумулятора', 'Redmi', 1200, 40],['Замена датчика приближения', 'Redmi', 900, 45],['Замена динамика/звонка', 'Redmi', 900, 40],['Замена дисплея', 'Redmi', 2250, 90],['Замена задней крышки', 'Redmi', 1100, 60],['Замена основной камеры', 'Redmi', 1600, 60],['Замена передней камеры(Себяшки)', 'Redmi', 1800, 60],['Замена кнопки включения', 'Redmi', 990, 60],['Замена микрофона', 'Redmi', 1000, 60],['Замена разъема зарядки/гарнитуры', 'Redmi', 1050, 60],['Замена шлейфа', 'Redmi', 1150, 60],['Программный ремонт/Обновление ПО', 'Redmi', 1000, 90],['Ремонт кнопки Home', 'Redmi', 1450, 60],['Технически сложный ремонт', 'Redmi', 1100, 90],['Восстановление после попадания воды', 'Qin 2', 600, 50],['Замена аккумулятора', 'Qin 2', 1200, 40],['Замена датчика приближения', 'Qin 2', 900, 45],['Замена динамика/звонка', 'Qin 2', 900, 40],['Замена дисплея', 'Qin 2', 2200, 90],['Замена задней крышки', 'Qin 2', 1200, 60],['Замена основной камеры', 'Qin 2', 1700, 60],['Замена передней камеры(Себяшки)', 'Qin 2', 1850, 60],['Замена кнопки включения', 'Qin 2', 990, 60],['Замена микрофона', 'Qin 2', 1000, 60],['Замена разъема зарядки/гарнитуры', 'Qin 2', 1050, 60],['Замена шлейфа', 'Qin 2', 1150, 60],['Программный ремонт/Обновление ПО', 'Qin 2', 1000, 90],['Ремонт кнопки Home', 'Qin 2', 1450, 60],['Технически сложный ремонт', 'Qin 2', 1100, 90],['Восстановление после попадания воды', 'Mi Play', 900, 50],['Замена аккумулятора', 'Mi Play', 1350, 40],['Замена датчика приближения', 'Mi Play', 1100, 45],['Замена динамика/звонка', 'Mi Play', 1100, 40],['Замена дисплея', 'Mi Play', 2670, 90],['Замена задней крышки', 'Mi Play', 1250, 60],['Замена основной камеры', 'Mi Play', 1950, 60],['Замена передней камеры(Себяшки)', 'Mi Play', 1800, 60],['Замена кнопки включения', 'Mi Play', 1100, 60],['Замена микрофона', 'Mi Play', 1200, 60],['Замена разъема зарядки/гарнитуры', 'Mi Play', 1250, 60],['Замена шлейфа', 'Mi Play', 1250, 60],['Программный ремонт/Обновление ПО', 'Mi Play', 1000, 90],['Ремонт кнопки Home', 'Mi Play', 1750, 60],['Технически сложный ремонт', 'Mi Play', 1250, 90],['Восстановление после попадания воды', 'Mi Note Pro', 900, 50],['Замена аккумулятора', 'Mi Note Pro', 1150, 40],['Замена датчика приближения', 'Mi Note Pro', 1150, 45],['Замена динамика/звонка', 'Mi Note Pro', 1100, 40],['Замена дисплея', 'Mi Note Pro', 2990, 90],['Замена задней крышки', 'Mi Note Pro', 11500, 60],['Замена основной камеры', 'Mi Note Pro', 2100, 60],['Замена передней камеры(Себяшки)', 'Mi Note Pro', 1900, 60],['Замена кнопки включения', 'Mi Note Pro', 1200, 60],['Замена микрофона', 'Mi Note Pro', 1200, 60],['Замена разъема зарядки/гарнитуры', 'Mi Note Pro', 1300, 60],['Замена шлейфа', 'Mi Note Pro', 1250, 60],['Программный ремонт/Обновление ПО', 'Mi Note Pro', 1000, 90],['Ремонт кнопки Home', 'Mi Note Pro', 1750, 60],['Технически сложный ремонт', 'Mi Note Pro', 1250, 90],['Восстановление после попадания воды', 'Mi Note 3', 900, 50],['Замена аккумулятора', 'Mi Note 3', 1335, 40],['Замена датчика приближения', 'Mi Note 3', 1150, 45],['Замена динамика/звонка', 'Mi Note 3', 1150, 40],['Замена дисплея', 'Mi Note 3', 3630, 90],['Замена задней крышки', 'Mi Note 3', 1050, 60],['Замена основной камеры', 'Mi Note 3', 2250, 60],['Замена передней камеры(Себяшки)', 'Mi Note 3', 1990, 60],['Замена кнопки включения', 'Mi Note 3', 1200, 60],['Замена микрофона', 'Mi Note 3', 1250, 60],['Замена разъема зарядки/гарнитуры', 'Mi Note 3', 1300, 60],['Замена шлейфа', 'Mi Note 3', 1300, 60],['Программный ремонт/Обновление ПО', 'Mi Note 3', 1000, 90],['Ремонт кнопки Home', 'Mi Note 3', 1850, 60],['Технически сложный ремонт', 'Mi Note 3', 1300, 90],['Восстановление после попадания воды', 'Mi Note 10', 900, 50],['Замена аккумулятора', 'Mi Note 10', 1650, 40],['Замена датчика приближения', 'Mi Note 10', 1250, 45],['Замена динамика/звонка', 'Mi Note 10', 1250, 40],['Замена дисплея', 'Mi Note 10', 13500, 90],['Замена задней крышки', 'Mi Note 10', 1400, 60],['Замена основной камеры', 'Mi Note 10', 2990, 60],['Замена передней камеры(Себяшки)', 'Mi Note 10', 2300, 60],['Замена кнопки включения', 'Mi Note 10', 1300, 60],['Замена микрофона', 'Mi Note 10', 1450, 60],['Замена разъема зарядки/гарнитуры', 'Mi Note 10', 1450, 60],['Замена шлейфа', 'Mi Note 10', 1400, 60],['Программный ремонт/Обновление ПО', 'Mi Note 10', 1000, 90],['Ремонт кнопки Home', 'Mi Note 10', 2200, 60],['Технически сложный ремонт', 'Mi Note 10', 1500, 90],['Восстановление после попадания воды', 'Mi Note', 800, 50],['Замена аккумулятора', 'Mi Note', 1150, 40],['Замена датчика приближения', 'Mi Note', 1150, 45],['Замена динамика/звонка', 'Mi Note', 1200, 40],['Замена дисплея', 'Mi Note', 2990, 90],['Замена задней крышки', 'Mi Note', 1200, 60],['Замена основной камеры', 'Mi Note', 2750, 60],['Замена передней камеры(Себяшки)', 'Mi Note', 2200, 60],['Замена кнопки включения', 'Mi Note', 1200, 60],['Замена микрофона', 'Mi Note', 1200, 60],['Замена разъема зарядки/гарнитуры', 'Mi Note', 1400, 60],['Замена шлейфа', 'Mi Note', 1350, 60],['Программный ремонт/Обновление ПО', 'Mi Note', 1000, 90],['Ремонт кнопки Home', 'Mi Note', 1850, 60],['Технически сложный ремонт', 'Mi Note', 1300, 90],['Восстановление после попадания воды', 'Mi Mix 3', 1000, 50],['Замена аккумулятора', 'Mi Mix 3', 1450, 40],['Замена датчика приближения', 'Mi Mix 3', 1350, 45],['Замена динамика/звонка', 'Mi Mix 3', 1250, 40],['Замена дисплея', 'Mi Mix 3', 9900, 90],['Замена задней крышки', 'Mi Mix 3', 1900, 60],['Замена основной камеры', 'Mi Mix 3', 3250, 60],['Замена передней камеры(Себяшки)', 'Mi Mix 3', 2450, 60],['Замена кнопки включения', 'Mi Mix 3', 1350, 60],['Замена микрофона', 'Mi Mix 3', 1350, 60],['Замена разъема зарядки/гарнитуры', 'Mi Mix 3', 1400, 60],['Замена шлейфа', 'Mi Mix 3', 1350, 60],['Программный ремонт/Обновление ПО', 'Mi Mix 3', 1000, 90],['Ремонт кнопки Home', 'Mi Mix 3', 1950, 60],['Технически сложный ремонт', 'Mi Mix 3', 1450, 90],['Восстановление после попадания воды', 'Mi Mix 2S', 900, 50],['Замена аккумулятора', 'Mi Mix 2S', 1345, 440],['Замена датчика приближения', 'Mi Mix 2S', 1200, 45],['Замена динамика/звонка', 'Mi Mix 2S', 1250, 40],['Замена дисплея', 'Mi Mix 2S', 3600, 90],['Замена задней крышки', 'Mi Mix 2S', 1600, 60],['Замена основной камеры', 'Mi Mix 2S', 3250, 60],['Замена передней камеры(Себяшки)', 'Mi Mix 2S', 2450, 60],['Замена кнопки включения', 'Mi Mix 2S', 1200, 60],['Замена микрофона', 'Mi Mix 2S', 1350, 60],['Замена разъема зарядки/гарнитуры', 'Mi Mix 2S', 1300, 60],['Замена шлейфа', 'Mi Mix 2S', 1300, 60],['Программный ремонт/Обновление ПО', 'Mi Mix 2S', 1000, 90],['Ремонт кнопки Home', 'Mi Mix 2S', 1950, 60],['Технически сложный ремонт', 'Mi Mix 2S', 1400, 90],['Восстановление после попадания воды', 'Mi Mix 2', 900, 50],['Замена аккумулятора', 'Mi Mix 2', 1345, 40],['Замена датчика приближения', 'Mi Mix 2', 1200, 45],['Замена динамика/звонка', 'Mi Mix 2', 1250, 40],['Замена дисплея', 'Mi Mix 2', 3600, 90],['Замена задней крышки', 'Mi Mix 2', 1600, 60],['Замена основной камеры', 'Mi Mix 2', 3200, 60],['Замена передней камеры(Себяшки)', 'Mi Mix 2', 2450, 60],['Замена кнопки включения', 'Mi Mix 2', 1200, 60],['Замена микрофона', 'Mi Mix 2', 1350, 60],['Замена разъема зарядки/гарнитуры', 'Mi Mix 2', 1300, 60],['Замена шлейфа', 'Mi Mix 2', 1300, 60],['Программный ремонт/Обновление ПО', 'Mi Mix 2', 1000, 90],['Ремонт кнопки Home', 'Mi Mix 2', 1950, 60],['Технически сложный ремонт', 'Mi Mix 2', 1400, 90],['Восстановление после попадания воды', 'Mi Mix', 900, 50],['Замена аккумулятора', 'Mi Mix', 1350, 40],['Замена датчика приближения', 'Mi Mix', 1200, 45],['Замена динамика/звонка', 'Mi Mix', 1200, 40],['Замена дисплея', 'Mi Mix', 9900, 90],['Замена задней крышки', 'Mi Mix', 2100, 60],['Замена основной камеры', 'Mi Mix', 3150, 60],['Замена передней камеры(Себяшки)', 'Mi Mix', 1990, 60],['Замена кнопки включения', 'Mi Mix', 1150, 60],['Замена микрофона', 'Mi Mix', 1300, 60],['Замена разъема зарядки/гарнитуры', 'Mi Mix', 1250, 60],['Замена шлейфа', 'Mi Mix', 1300, 60],['Программный ремонт/Обновление ПО', 'Mi Mix', 1000, 90],['Ремонт кнопки Home', 'Mi Mix', 1950, 60],['Технически сложный ремонт', 'Mi Mix', 1400, 90],['Восстановление после попадания воды', 'Mi Max 3', 900, 50],['Замена аккумулятора', 'Mi Max 3', 1450, 40],['Замена датчика приближения', 'Mi Max 3', 1150, 45],['Замена динамика/звонка', 'Mi Max 3', 1150, 40],['Замена дисплея', 'Mi Max 3', 3100, 90],['Замена задней крышки', 'Mi Max 3', 1900, 60],['Замена основной камеры', 'Mi Max 3', 2300, 60],['Замена передней камеры(Себяшки)', 'Mi Max 3', 1990, 60],['Замена кнопки включения', 'Mi Max 3', 1150, 60],['Замена микрофона', 'Mi Max 3', 1200, 60],['Замена разъема зарядки/гарнитуры', 'Mi Max 3', 1250, 60],['Замена шлейфа', 'Mi Max 3', 1250, 60],['Программный ремонт/Обновление ПО', 'Mi Max 3', 1000, 90],['Ремонт кнопки Home', 'Mi Max 3', 1700, 60],['Технически сложный ремонт', 'Mi Max 3', 1200, 90],['Восстановление после попадания воды', 'Mi Max 2', 900, 50],['Замена аккумулятора', 'Mi Max 2', 1400, 40],['Замена датчика приближения', 'Mi Max 2', 1150, 45],['Замена динамика/звонка', 'Mi Max 2', 1150, 40],['Замена дисплея', 'Mi Max 2', 3600, 90],['Замена задней крышки', 'Mi Max 2', 1600, 60],['Замена основной камеры', 'Mi Max 2', 2300, 60],['Замена передней камеры(Себяшки)', 'Mi Max 2', 1990, 60],['Замена кнопки включения', 'Mi Max 2', 1150, 60],['Замена микрофона', 'Mi Max 2', 1200, 60],['Замена разъема зарядки/гарнитуры', 'Mi Max 2', 1200, 60],['Замена шлейфа', 'Mi Max 2', 1250, 60],['Программный ремонт/Обновление ПО', 'Mi Max 2', 1000, 90],['Ремонт кнопки Home', 'Mi Max 2', 1700, 60],['Технически сложный ремонт', 'Mi Max 2', 1200, 90],['Восстановление после попадания воды', 'Mi Max', 900, 50],['Замена аккумулятора', 'Mi Max', 1400, 40],['Замена датчика приближения', 'Mi Max', 1150, 45],['Замена динамика/звонка', 'Mi Max', 1150, 40],['Замена дисплея', 'Mi Max', 3150, 90],['Замена задней крышки', 'Mi Max', 1500, 60],['Замена основной камеры', 'Mi Max', 2200, 60],['Замена передней камеры(Себяшки)', 'Mi Max', 1990, 60],['Замена кнопки включения', 'Mi Max', 1150, 60],['Замена микрофона', 'Mi Max', 1100, 60],['Замена разъема зарядки/гарнитуры', 'Mi Max', 1200, 60],['Замена шлейфа', 'Mi Max', 1200, 60],['Программный ремонт/Обновление ПО', 'Mi Max', 1000, 90],['Ремонт кнопки Home', 'Mi Max', 1700, 60],['Технически сложный ремонт', 'Mi Max', 1200, 90],['Восстановление после попадания воды', 'Mi A3', 900, 50],['Замена аккумулятора', 'Mi A3', 1450, 40],['Замена датчика приближения', 'Mi A3', 1200, 45],['Замена динамика/звонка', 'Mi A3', 1200, 40],['Замена дисплея', 'Mi A3', 8900, 90],['Замена задней крышки', 'Mi A3', 1350, 60],['Замена основной камеры', 'Mi A3', 2550, 60],['Замена передней камеры(Себяшки)', 'Mi A3', 2100, 60],['Замена кнопки включения', 'Mi A3', 1150, 60],['Замена микрофона', 'Mi A3', 1200, 60],['Замена разъема зарядки/гарнитуры', 'Mi A3', 1350, 60],['Замена шлейфа', 'Mi A3', 1250, 60],['Программный ремонт/Обновление ПО', 'Mi A3', 1000, 90],['Ремонт кнопки Home', 'Mi A3', 1990, 60],['Технически сложный ремонт', 'Mi A3', 1200, 90],['Восстановление после попадания воды', 'Mi A2', 900, 50],['Замена аккумулятора', 'Mi A2', 1380, 40],['Замена датчика приближения', 'Mi A2', 1200, 45],['Замена динамика/звонка', 'Mi A2', 1150, 40],['Замена дисплея', 'Mi A2', 2600, 90],['Замена задней крышки', 'Mi A2', 1600, 60],['Замена основной камеры', 'Mi A2', 2500, 60],['Замена передней камеры(Себяшки)', 'Mi A2', 1990, 60],['Замена кнопки включения', 'Mi A2', 1150, 60],['Замена микрофона', 'Mi A2', 1200, 60],['Замена разъема зарядки/гарнитуры', 'Mi A2', 1200, 60],['Замена шлейфа', 'Mi A2', 1200, 60],['Программный ремонт/Обновление ПО', 'Mi A2', 1000, 90],['Ремонт кнопки Home', 'Mi A2', 1800, 60],['Технически сложный ремонт', 'Mi A2', 1200, 90],['Восстановление после попадания воды', 'Mi A1', 900, 50],['Замена аккумулятора', 'Mi A1', 1380, 40],['Замена датчика приближения', 'Mi A1', 1000, 45],['Замена динамика/звонка', 'Mi A1', 1150, 40],['Замена дисплея', 'Mi A1', 2350, 90],['Замена задней крышки', 'Mi A1', 1600, 60],['Замена основной камеры', 'Mi A1', 2200, 60],['Замена передней камеры(Себяшки)', 'Mi A1', 1990, 60],['Замена кнопки включения', 'Mi A1', 1150, 60],['Замена микрофона', 'Mi A1', 1100, 60],['Замена разъема зарядки/гарнитуры', 'Mi A1', 1200, 60],['Замена шлейфа', 'Mi A1', 1200, 60],['Программный ремонт/Обновление ПО', 'Mi A1', 1000, 90],['Ремонт кнопки Home', 'Mi A1', 1750, 60],['Технически сложный ремонт', 'Mi A1', 1150, 90],['Восстановление после попадания воды', 'Mi 9T Pro', 900, 50],['Замена аккумулятора', 'Mi 9T Pro', 1400, 40],['Замена датчика приближения', 'Mi 9T Pro', 1250, 45],['Замена дисплея', 'Mi 9T Pro', 8650, 90],['Замена задней крышки', 'Mi 9T Pro', 1350, 60],['Замена основной камеры', 'Mi 9T Pro', 3300, 60],['Замена передней камеры(Себяшки)', 'Mi 9T Pro', 2450, 60],['Замена кнопки включения', 'Mi 9T Pro', 1250, 60],['Замена микрофона', 'Mi 9T Pro', 1350, 60],['Замена разъема зарядки/гарнитуры', 'Mi 9T Pro', 1400, 60],['Замена шлейфа', 'Mi 9T Pro', 1400, 60],['Программный ремонт/Обновление ПО', 'Mi 9T Pro', 1000, 90],['Ремонт кнопки Home', 'Mi 9T Pro', 2200, 60],['Технически сложный ремонт', 'Mi 9T Pro', 1500, 90],['Восстановление после попадания воды', 'Mi 9T', 900, 50],['Замена аккумулятора', 'Mi 9T', 1450, 40],['Замена датчика приближения', 'Mi 9T', 1250, 45],['Замена динамика/звонка', 'Mi 9T', 1250, 40],['Замена дисплея', 'Mi 9T', 8650, 90],['Замена задней крышки', 'Mi 9T', 1350, 60],['Замена основной камеры', 'Mi 9T', 3300, 60],['Замена передней камеры(Себяшки)', 'Mi 9T', 2450, 60],['Замена кнопки включения', 'Mi 9T', 1250, 60],['Замена микрофона', 'Mi 9T', 1350, 60],['Замена разъема зарядки/гарнитуры', 'Mi 9T', 1400, 60],['Замена шлейфа', 'Mi 9T', 1400, 60],['Программный ремонт/Обновление ПО', 'Mi 9T', 1000, 90],['Ремонт кнопки Home', 'Mi 9T', 2200, 60],['Технически сложный ремонт', 'Mi 9T', 1500, 90],['Восстановление после попадания воды', 'Mi 9 SE', 900, 50],['Замена аккумулятора', 'Mi 9 SE', 1430, 40],['Замена датчика приближения', 'Mi 9 SE', 1250, 45],['Замена динамика/звонка', 'Mi 9 SE', 1250, 40],['Замена дисплея', 'Mi 9 SE', 10500, 90],['Замена задней крышки', 'Mi 9 SE', 1300, 60],['Замена основной камеры', 'Mi 9 SE', 3300, 60],['Замена передней камеры(Себяшки)', 'Mi 9 SE', 2450, 60],['Замена кнопки включения', 'Mi 9 SE', 1250, 60],['Замена микрофона', 'Mi 9 SE', 1350, 60],['Замена разъема зарядки/гарнитуры', 'Mi 9 SE', 1400, 60],['Замена шлейфа', 'Mi 9 SE', 1400, 60],['Программный ремонт/Обновление ПО', 'Mi 9 SE', 1000, 90],['Ремонт кнопки Home', 'Mi 9 SE', 2100, 60],['Технически сложный ремонт', 'Mi 9 SE', 1500, 90],['Восстановление после попадания воды', 'Mi 9 Lite', 900, 50],['Замена аккумулятора', 'Mi 9 Lite', 1500, 40],['Замена датчика приближения', 'Mi 9 Lite', 1250, 45],['Замена динамика/звонка', 'Mi 9 Lite', 1250, 40],['Замена дисплея', 'Mi 9 Lite', 9500, 90],['Замена задней крышки', 'Mi 9 Lite', 1350, 60],['Замена основной камеры', 'Mi 9 Lite', 3300, 60],['Замена передней камеры(Себяшки)', 'Mi 9 Lite', 2450, 60],['Замена кнопки включения', 'Mi 9 Lite', 1250, 60],['Замена микрофона', 'Mi 9 Lite', 1350, 60],['Замена разъема зарядки/гарнитуры', 'Mi 9 Lite', 1400, 60],['Замена шлейфа', 'Mi 9 Lite', 1400, 60],['Программный ремонт/Обновление ПО', 'Mi 9 Lite', 1000, 90],['Ремонт кнопки Home', 'Mi 9 Lite', 2100, 60],['Технически сложный ремонт', 'Mi 9 Lite', 1500, 90],['Восстановление после попадания воды', 'Mi 9', 900, 50],['Замена аккумулятора', 'Mi 9', 1350, 40],['Замена датчика приближения', 'Mi 9', 1250, 45],['Замена динамика/звонка', 'Mi 9', 1250, 40],['Замена дисплея', 'Mi 9', 8500, 90],['Замена задней крышки', 'Mi 9', 1300, 60],['Замена основной камеры', 'Mi 9', 3300, 60],['Замена передней камеры(Себяшки)', 'Mi 9', 2450, 60],['Замена кнопки включения', 'Mi 9', 1250, 60],['Замена микрофона', 'Mi 9', 1350, 60],['Замена разъема зарядки/гарнитуры', 'Mi 9', 1400, 60],['Замена шлейфа', 'Mi 9', 1400, 60],['Программный ремонт/Обновление ПО', 'Mi 9', 1000, 90],['Ремонт кнопки Home', 'Mi 9', 2100, 60],['Технически сложный ремонт', 'Mi 9', 1500, 90],['Восстановление после попадания воды', 'Mi 8 SE', 900, 50],['Замена аккумулятора', 'Mi 8 SE', 1350, 40],['Замена датчика приближения', 'Mi 8 SE', 1250, 45],['Замена динамика/звонка', 'Mi 8 SE', 1250, 40],['Замена дисплея', 'Mi 8 SE', 8500, 90],['Замена задней крышки', 'Mi 8 SE', 1300, 60],['Замена основной камеры', 'Mi 8 SE', 3300, 60],['Замена передней камеры(Себяшки)', 'Mi 8 SE', 2450, 60],['Замена кнопки включения', 'Mi 8 SE', 1250, 60],['Замена микрофона', 'Mi 8 SE', 1350, 60],['Замена разъема зарядки/гарнитуры', 'Mi 8 SE', 1400, 60],['Замена шлейфа', 'Mi 8 SE', 1400, 60],['Программный ремонт/Обновление ПО', 'Mi 8 SE', 1000, 90],['Ремонт кнопки Home', 'Mi 8 SE', 2100, 60],['Технически сложный ремонт', 'Mi 8 SE', 1450, 90],['Восстановление после попадания воды', 'Mi 8 Pro', 900, 50],['Замена аккумулятора', 'Mi 8 Pro', 1370, 40],['Замена датчика приближения', 'Mi 8 Pro', 1250, 45],['Замена динамика/звонка', 'Mi 8 Pro', 1250, 40],['Замена дисплея', 'Mi 8 Pro', 8800, 90],['Замена задней крышки', 'Mi 8 Pro', 1300, 60],['Замена основной камеры', 'Mi 8 Pro', 3300, 60],['Замена передней камеры(Себяшки)', 'Mi 8 Pro', 2450, 60],['Замена кнопки включения', 'Mi 8 Pro', 1250, 60],['Замена микрофона', 'Mi 8 Pro', 1350, 60],['Замена разъема зарядки/гарнитуры', 'Mi 8 Pro', 1400, 60],['Замена шлейфа', 'Mi 8 Pro', 1400, 60],['Программный ремонт/Обновление ПО', 'Mi 8 Pro', 1000, 90],['Ремонт кнопки Home', 'Mi 8 Pro', 2100, 60],['Технически сложный ремонт', 'Mi 8 Pro', 1450, 90],['Восстановление после попадания воды', 'Mi 8 Lite', 900, 50],['Замена аккумулятора', 'Mi 8 Lite', 1350, 40],['Замена датчика приближения', 'Mi 8 Lite', 1250, 45],['Замена динамика/звонка', 'Mi 8 Lite', 1250, 40],['Замена дисплея', 'Mi 8 Lite', 2900, 90],['Замена задней крышки', 'Mi 8 Lite', 1300, 60],['Замена основной камеры', 'Mi 8 Lite', 3350, 60],['Замена передней камеры(Себяшки)', 'Mi 8 Lite', 2450, 60],['Замена кнопки включения', 'Mi 8 Lite', 1250, 60],['Замена микрофона', 'Mi 8 Lite', 1350, 60],['Замена разъема зарядки/гарнитуры', 'Mi 8 Lite', 1400, 60],['Замена шлейфа', 'Mi 8 Lite', 1400, 60],['Программный ремонт/Обновление ПО', 'Mi 8 Lite', 1000, 90],['Ремонт кнопки Home', 'Mi 8 Lite', 1900, 60],['Технически сложный ремонт', 'Mi 8 Lite', 1450, 90],['Восстановление после попадания воды', 'Mi 8', 900, 50],['Замена аккумулятора', 'Mi 8', 1335, 40],['Замена датчика приближения', 'Mi 8', 1250, 45],['Замена динамика/звонка', 'Mi 8', 1250, 40],['Замена дисплея', 'Mi 8', 7500, 90],['Замена задней крышки', 'Mi 8', 1300, 60],['Замена основной камеры', 'Mi 8', 3350, 60],['Замена передней камеры(Себяшки)', 'Mi 8', 2450, 60],['Замена кнопки включения', 'Mi 8', 1250, 60],['Замена микрофона', 'Mi 8', 1350, 60],['Замена разъема зарядки/гарнитуры', 'Mi 8', 1400, 60],['Замена шлейфа', 'Mi 8', 1400, 60],['Программный ремонт/Обновление ПО', 'Mi 8', 1000, 90],['Ремонт кнопки Home', 'Mi 8', 2100, 60],['Технически сложный ремонт', 'Mi 8', 1450, 90],['Восстановление после попадания воды', 'Mi 6X', 900, 50],['Замена аккумулятора', 'Mi 6X', 1260, 40],['Замена датчика приближения', 'Mi 6X', 1000, 45],['Замена динамика/звонка', 'Mi 6X', 1150, 40],['Замена дисплея', 'Mi 6X', 2620, 90],['Замена задней крышки', 'Mi 6X', 1400, 60],['Замена основной камеры', 'Mi 6X', 2200, 60],['Замена передней камеры(Себяшки)', 'Mi 6X', 1990, 60],['Замена кнопки включения', 'Mi 6X', 1150, 60],['Замена микрофона', 'Mi 6X', 1200, 60],['Замена разъема зарядки/гарнитуры', 'Mi 6X', 1300, 60],['Замена шлейфа', 'Mi 6X', 1250, 60],['Программный ремонт/Обновление ПО', 'Mi 6X', 1000, 90],['Ремонт кнопки Home', 'Mi 6X', 1900, 60],['Технически сложный ремонт', 'Mi 6X', 1300, 90],['Восстановление после попадания воды', 'Mi 6', 900, 50],['Замена аккумулятора', 'Mi 6', 1250, 40],['Замена датчика приближения', 'Mi 6', 1100, 45],['Замена динамика/звонка', 'Mi 6', 1150, 40],['Замена дисплея', 'Mi 6', 3450, 90],['Замена задней крышки', 'Mi 6', 1200, 60],['Замена основной камеры', 'Mi 6', 2250, 60],['Замена передней камеры(Себяшки)', 'Mi 6', 1990, 60],['Замена кнопки включения', 'Mi 6', 200, 60],['Замена микрофона', 'Mi 6', 1250, 60],['Замена разъема зарядки/гарнитуры', 'Mi 6', 1250, 60],['Замена шлейфа', 'Mi 6', 1250, 60],['Программный ремонт/Обновление ПО', 'Mi 6', 1000, 90],['Ремонт кнопки Home', 'Mi 6', 1850, 60],['Технически сложный ремонт', 'Mi 6', 1300, 90],['Восстановление после попадания воды', 'Mi 5X', 900, 50],['Замена аккумулятора', 'Mi 5X', 1300, 40],['Замена датчика приближения', 'Mi 5X', 1050, 45],['Замена динамика/звонка', 'Mi 5X', 1150, 40],['Замена дисплея', 'Mi 5X', 2350, 90],['Замена задней крышки', 'Mi 5X', 1750, 60],['Замена основной камеры', 'Mi 5X', 2100, 60],['Замена передней камеры(Себяшки)', 'Mi 5X', 1850, 60],['Замена кнопки включения', 'Mi 5X', 1150, 60],['Замена микрофона', 'Mi 5X', 1200, 60],['Замена разъема зарядки/гарнитуры', 'Mi 5X', 1200, 60],['Замена шлейфа', 'Mi 5X', 1250, 60],['Программный ремонт/Обновление ПО', 'Mi 5X', 1000, 90],['Ремонт кнопки Home', 'Mi 5X', 1850, 60],['Технически сложный ремонт', 'Mi 5X', 1250, 90],['Восстановление после попадания воды', 'Mi 5S Plus', 900, 50],['Замена аккумулятора', 'Mi 5S Plus', 1270, 40],['Замена датчика приближения', 'Mi 5S Plus', 1150, 45],['Замена динамика/звонка', 'Mi 5S Plus', 1150, 40],['Замена дисплея', 'Mi 5S Plus', 3250, 90],['Замена задней крышки', 'Mi 5S Plus', 1900, 60],['Замена основной камеры', 'Mi 5S Plus', 2250, 60],['Замена передней камеры(Себяшки)', 'Mi 5S Plus', 1850, 60],['Замена кнопки включения', 'Mi 5S Plus', 1150, 60],['Замена микрофона', 'Mi 5S Plus', 1250, 60],['Замена разъема зарядки/гарнитуры', 'Mi 5S Plus', 1200, 60],['Замена шлейфа', 'Mi 5S Plus', 1250, 60],['Программный ремонт/Обновление ПО', 'Mi 5S Plus', 1000, 90],['Ремонт кнопки Home', 'Mi 5S Plus', 1750, 60],['Технически сложный ремонт', 'Mi 5S Plus', 1250, 90],['Восстановление после попадания воды', 'Mi 5S', 900, 50],['Замена аккумулятора', 'Mi 5S', 1270, 40],['Замена датчика приближения', 'Mi 5S', 1200, 45],['Замена динамика/звонка', 'Mi 5S', 1150, 40],['Замена дисплея', 'Mi 5S', 2950, 90],['Замена задней крышки', 'Mi 5S', 1800, 60],['Замена основной камеры', 'Mi 5S', 2200, 60],['Замена передней камеры(Себяшки)', 'Mi 5S', 1850, 60],['Замена кнопки включения', 'Mi 5S', 1150, 60],['Замена микрофона', 'Mi 5S', 1200, 60],['Замена разъема зарядки/гарнитуры', 'Mi 5S', 1200, 60],['Замена шлейфа', 'Mi 5S', 1250, 60],['Программный ремонт/Обновление ПО', 'Mi 5S', 1000, 90],['Ремонт кнопки Home', 'Mi 5S', 1750, 60],['Технически сложный ремонт', 'Mi 5S', 1250, 90],['Восстановление после попадания воды', 'Mi 5c', 900, 50],['Замена аккумулятора', 'Mi 5c', 1250, 40],['Замена датчика приближения', 'Mi 5c', 1200, 45],['Замена динамика/звонка', 'Mi 5c', 1150, 40],['Замена дисплея', 'Mi 5c', 2630, 90],['Замена задней крышки', 'Mi 5c', 1350, 60],['Замена основной камеры', 'Mi 5c', 2100, 60],['Замена передней камеры(Себяшки)', 'Mi 5c', 1850, 60],['Замена кнопки включения', 'Mi 5c', 1150, 60],['Замена микрофона', 'Mi 5c', 1150, 60],['Замена разъема зарядки/гарнитуры', 'Mi 5c', 1200, 60],['Замена шлейфа', 'Mi 5c', 1250, 60],['Программный ремонт/Обновление ПО', 'Mi 5c', 1000, 90],['Ремонт кнопки Home', 'Mi 5c', 1600, 60],['Технически сложный ремонт', 'Mi 5c', 1200, 90],['Восстановление после попадания воды', 'Mi 5', 900, 50],['Замена аккумулятора', 'Mi 5', 1225, 40],['Замена датчика приближения', 'Mi 5', 1100, 45],['Замена динамика/звонка', 'Mi 5', 1150, 40],['Замена дисплея', 'Mi 5', 2780, 90],['Замена задней крышки', 'Mi 5', 1150, 60],['Замена основной камеры', 'Mi 5', 2100, 60],['Замена передней камеры(Себяшки)', 'Mi 5', 1850, 60],['Замена кнопки включения', 'Mi 5', 1050, 60],['Замена микрофона', 'Mi 5', 1150, 60],['Замена разъема зарядки/гарнитуры', 'Mi 5', 1200, 60],['Замена шлейфа', 'Mi 5', 1250, 60],['Программный ремонт/Обновление ПО', 'Mi 5', 1000, 90],['Ремонт кнопки Home', 'Mi 5', 1600, 60],['Технически сложный ремонт', 'Mi 5', 1200, 90],['Восстановление после попадания воды', 'Mi 4S', 800, 50],['Замена аккумулятора', 'Mi 4S', 1210, 40],['Замена датчика приближения', 'Mi 4S', 909, 45],['Замена динамика/звонка', 'Mi 4S', 950, 40],['Замена дисплея', 'Mi 4S', 2350, 90],['Замена задней крышки', 'Mi 4S', 1100, 60],['Замена основной камеры', 'Mi 4S', 1950, 60],['Замена передней камеры(Себяшки)', 'Mi 4S', 1800, 60],['Замена кнопки включения', 'Mi 4S', 990, 60],['Замена микрофона', 'Mi 4S', 1100, 60],['Замена разъема зарядки/гарнитуры', 'Mi 4S', 1200, 60],['Замена шлейфа', 'Mi 4S', 1200, 60],['Программный ремонт/Обновление ПО', 'Mi 4S', 1000, 90],['Ремонт кнопки Home', 'Mi 4S', 1300, 60],['Технически сложный ремонт', 'Mi 4S', 1100, 90],['Восстановление после попадания воды', 'Mi 4i', 800, 50],['Замена аккумулятора', 'Mi 4i', 1240, 40],['Замена датчика приближения', 'Mi 4i', 990, 45],['Замена динамика/звонка', 'Mi 4i', 950, 40],['Замена дисплея', 'Mi 4i', 2300, 90],['Замена задней крышки', 'Mi 4i', 1100, 60],['Замена основной камеры', 'Mi 4i', 1950, 60],['Замена передней камеры(Себяшки)', 'Mi 4i', 1650, 60],['Замена кнопки включения', 'Mi 4i', 909, 60],['Замена микрофона', 'Mi 4i', 1100, 60],['Замена разъема зарядки/гарнитуры', 'Mi 4i', 1200, 60],['Замена шлейфа', 'Mi 4i', 1200, 60],['Программный ремонт/Обновление ПО', 'Mi 4i', 1000, 90],['Ремонт кнопки Home', 'Mi 4i', 1300, 60],['Технически сложный ремонт', 'Mi 4i', 1100, 90],['Восстановление после попадания воды', 'Mi 4c Prime', 800, 50],['Замена аккумулятора', 'Mi 4c Prime', 1230, 40],['Замена датчика приближения', 'Mi 4c Prime', 990, 45],['Замена динамика/звонка', 'Mi 4c Prime', 950, 40],['Замена дисплея', 'Mi 4c Prime', 2300, 90],['Замена задней крышки', 'Mi 4c Prime', 1100, 60],['Замена основной камеры', 'Mi 4c Prime', 1950, 60],['Замена передней камеры(Себяшки)', 'Mi 4c Prime', 1500, 60],['Замена кнопки включения', 'Mi 4c Prime', 990, 60],['Замена микрофона', 'Mi 4c Prime', 1050, 60],['Замена разъема зарядки/гарнитуры', 'Mi 4c Prime', 1150, 60],['Замена шлейфа', 'Mi 4c Prime', 1150, 60],['Программный ремонт/Обновление ПО', 'Mi 4c Prime', 1000, 90],['Ремонт кнопки Home', 'Mi 4c Prime', 1200, 60],['Технически сложный ремонт', 'Mi 4c Prime', 1100, 90],['Восстановление после попадания воды', 'Mi 4', 800, 50],['Замена аккумулятора', 'Mi 4', 1230, 40],['Замена датчика приближения', 'Mi 4', 900, 45],['Замена динамика/звонка', 'Mi 4', 950, 40],['Замена дисплея', 'Mi 4', 2450, 90],['Замена задней крышки', 'Mi 4', 1000, 60],['Замена основной камеры', 'Mi 4', 1950, 60],['Замена передней камеры(Себяшки)', 'Mi 4', 1500, 60],['Замена кнопки включения', 'Mi 4', 990, 60],['Замена микрофона', 'Mi 4', 1050, 60],['Замена разъема зарядки/гарнитуры', 'Mi 4', 1150, 60],['Замена шлейфа', 'Mi 4', 1150, 60],['Программный ремонт/Обновление ПО', 'Mi 4', 1000, 90],['Ремонт кнопки Home', 'Mi 4', 1200, 60],['Технически сложный ремонт', 'Mi 4', 1100, 90],['Восстановление после попадания воды', 'Mi 3 TD', 700, 50],['Замена аккумулятора', 'Mi 3 TD', 1150, 40],['Замена датчика приближения', 'Mi 3 TD', 900, 45],['Замена динамика/звонка', 'Mi 3 TD', 900, 40],['Замена дисплея', 'Mi 3 TD', 2300, 90],['Замена задней крышки', 'Mi 3 TD', 1200, 60],['Замена основной камеры', 'Mi 3 TD', 1900, 60],['Замена передней камеры(Себяшки)', 'Mi 3 TD', 1500, 60],['Замена кнопки включения', 'Mi 3 TD', 990, 60],['Замена микрофона', 'Mi 3 TD', 1000, 60],['Замена разъема зарядки/гарнитуры', 'Mi 3 TD', 1100, 60],['Замена шлейфа', 'Mi 3 TD', 1150, 60],['Программный ремонт/Обновление ПО', 'Mi 3 TD', 1000, 90],['Ремонт кнопки Home', 'Mi 3 TD', 1200, 60],['Технически сложный ремонт', 'Mi 3 TD', 1000, 90],['Восстановление после попадания воды', 'Mi 3', 900, 50],['Замена аккумулятора', 'Mi 3', 1150, 40],['Замена датчика приближения', 'Mi 3', 900, 45],['Замена динамика/звонка', 'Mi 3', 900, 40],['Замена дисплея', 'Mi 3', 2300, 90],['Замена задней крышки', 'Mi 3', 1200, 60],['Замена основной камеры', 'Mi 3', 1800, 60],['Замена передней камеры(Себяшки)', 'Mi 3', 1500, 60],['Замена кнопки включения', 'Mi 3', 990, 60],['Замена микрофона', 'Mi 3', 1000, 60],['Замена разъема зарядки/гарнитуры', 'Mi 3', 1100, 60],['Замена шлейфа', 'Mi 3', 1150, 60],['Программный ремонт/Обновление ПО', 'Mi 3', 1000, 90],['Ремонт кнопки Home', 'Mi 3', 1200, 60],['Технически сложный ремонт', 'Mi 3', 1250, 90],['Восстановление после попадания воды', 'Mi 2S', 900, 50],['Замена аккумулятора', 'Mi 2S', 1350, 40],['Замена датчика приближения', 'Mi 2S', 1150, 45],['Замена динамика/звонка', 'Mi 2S', 1200, 40],['Замена дисплея', 'Mi 2S', 3500, 90],['Замена задней крышки', 'Mi 2S', 1600, 60],['Замена основной камеры', 'Mi 2S', 2950, 60],['Замена передней камеры(Себяшки)', 'Mi 2S', 2150, 60],['Замена кнопки включения', 'Mi 2S', 1200, 60],['Замена микрофона', 'Mi 2S', 1200, 60],['Замена разъема зарядки/гарнитуры', 'Mi 2S', 1250, 60],['Замена шлейфа', 'Mi 2S', 1250, 60],['Программный ремонт/Обновление ПО', 'Mi 2S', 1000, 90],['Ремонт кнопки Home', 'Mi 2S', 1700, 60],['Технически сложный ремонт', 'Mi 2S', 1250, 90],['Восстановление после попадания воды', 'Mi 2A', 800, 50],['Замена аккумулятора', 'Mi 2A', 1200, 40],['Замена датчика приближения', 'Mi 2A', 1100, 45],['Замена динамика/звонка', 'Mi 2A', 1100, 40],['Замена дисплея', 'Mi 2A', 2600, 90],['Замена задней крышки', 'Mi 2A', 1600, 60],['Замена основной камеры', 'Mi 2A', 2800, 60],['Замена передней камеры(Себяшки)', 'Mi 2A', 2100, 60],['Замена кнопки включения', 'Mi 2A', 1150, 60],['Замена микрофона', 'Mi 2A', 1200, 60],['Замена разъема зарядки/гарнитуры', 'Mi 2A', 1250, 60],['Замена шлейфа', 'Mi 2A', 1250, 60],['Программный ремонт/Обновление ПО', 'Mi 2A', 1000, 90],['Ремонт кнопки Home', 'Mi 2A', 1600, 60],['Технически сложный ремонт', 'Mi 2A', 1150, 90],['Восстановление после попадания воды', 'Mi 2', 900, 50],['Замена аккумулятора', 'Mi 2', 1200, 40],['Замена датчика приближения', 'Mi 2', 900, 45],['Замена динамика/звонка', 'Mi 2', 950, 40],['Замена дисплея', 'Mi 2', 2300, 90],['Замена задней крышки', 'Mi 2', 1200, 60],['Замена основной камеры', 'Mi 2', 1700, 60],['Замена передней камеры(Себяшки)', 'Mi 2', 2100, 60],['Замена кнопки включения', 'Mi 2', 990, 60],['Замена микрофона', 'Mi 2', 1200, 60],['Замена разъема зарядки/гарнитуры', 'Mi 2', 1150, 60],['Замена шлейфа', 'Mi 2', 1150, 60],['Программный ремонт/Обновление ПО', 'Mi 2', 1000, 90],['Ремонт кнопки Home', 'Mi 2', 1100, 60],['Технически сложный ремонт', 'Mi 2', 1100, 90],['Восстановление после попадания воды', 'Mi 1S Youth', 800, 50],['Замена аккумулятора', 'Mi 1S Youth', 1225, 40],['Замена датчика приближения', 'Mi 1S Youth', 900, 45],['Замена динамика/звонка', 'Mi 1S Youth', 950, 40],['Замена дисплея', 'Mi 1S Youth', 2300, 90],['Замена задней крышки', 'Mi 1S Youth', 1100, 60],['Замена основной камеры', 'Mi 1S Youth', 1990, 60],['Замена передней камеры(Себяшки)', 'Mi 1S Youth', 1750, 60],['Замена кнопки включения', 'Mi 1S Youth', 990, 60],['Замена микрофона', 'Mi 1S Youth', 1050, 60],['Замена разъема зарядки/гарнитуры', 'Mi 1S Youth', 1150, 60],['Замена шлейфа', 'Mi 1S Youth', 1150, 60],['Программный ремонт/Обновление ПО', 'Mi 1S Youth', 1000, 90],['Ремонт кнопки Home', 'Mi 1S Youth', 1100, 60],['Технически сложный ремонт', 'Mi 1S Youth', 1000, 90],['Восстановление после попадания воды', 'Mi 1S', 800, 50],['Замена аккумулятора', 'Mi 1S', 1225, 40],['Замена датчика приближения', 'Mi 1S', 900, 45],['Замена динамика/звонка', 'Mi 1S', 950, 40],['Замена дисплея', 'Mi 1S', 2300, 90],['Замена задней крышки', 'Mi 1S', 1100, 60],['Замена основной камеры', 'Mi 1S', 1990, 60],['Замена передней камеры(Себяшки)', 'Mi 1S', 1750, 60],['Замена кнопки включения', 'Mi 1S', 990, 60],['Замена микрофона', 'Mi 1S', 1050, 60],['Замена разъема зарядки/гарнитуры', 'Mi 1S', 1150, 60],['Замена шлейфа', 'Mi 1S', 1150, 60],['Программный ремонт/Обновление ПО', 'Mi 1S', 1000, 90],['Ремонт кнопки Home', 'Mi 1S', 1100, 60],['Технически сложный ремонт', 'Mi 1S', 1000, 90],['Восстановление после попадания воды', 'Mi 1 Youth', 900, 50],['Замена аккумулятора', 'Mi 1 Youth', 1225, 40],['Замена датчика приближения', 'Mi 1 Youth', 900, 45],['Замена динамика/звонка', 'Mi 1 Youth', 950, 40],['Замена дисплея', 'Mi 1 Youth', 2300, 90],['Замена задней крышки', 'Mi 1 Youth', 1100, 60],['Замена основной камеры', 'Mi 1 Youth', 1990, 60],['Замена передней камеры(Себяшки)', 'Mi 1 Youth', 1750, 60],['Замена кнопки включения', 'Mi 1 Youth', 990, 60],['Замена микрофона', 'Mi 1 Youth', 1050, 60],['Замена разъема зарядки/гарнитуры', 'Mi 1 Youth', 1150, 60],['Замена шлейфа', 'Mi 1 Youth', 1150, 60],['Программный ремонт/Обновление ПО', 'Mi 1 Youth', 1000, 90],['Ремонт кнопки Home', 'Mi 1 Youth', 1100, 60],['Технически сложный ремонт', 'Mi 1 Youth', 1000, 90],['Восстановление после попадания воды', 'Mi 1 Plus', 900, 50],['Замена аккумулятора', 'Mi 1 Plus', 1225, 40],['Замена датчика приближения', 'Mi 1 Plus', 900, 45],['Замена динамика/звонка', 'Mi 1 Plus', 950, 40],['Замена дисплея', 'Mi 1 Plus', 2300, 90],['Замена задней крышки', 'Mi 1 Plus', 1000, 60],['Замена основной камеры', 'Mi 1 Plus', 1990, 60],['Замена передней камеры(Себяшки)', 'Mi 1 Plus', 1750, 60],['Замена кнопки включения', 'Mi 1 Plus', 990, 60],['Замена микрофона', 'Mi 1 Plus', 1050, 60],['Замена разъема зарядки/гарнитуры', 'Mi 1 Plus', 1150, 60],['Замена шлейфа', 'Mi 1 Plus', 1150, 60],['Программный ремонт/Обновление ПО', 'Mi 1 Plus', 1000, 90],['Ремонт кнопки Home', 'Mi 1 Plus', 1100, 60],['Технически сложный ремонт', 'Mi 1 Plus', 1000, 90],['Восстановление после попадания воды', 'Redmi 7', 800, 50],['Замена аккумулятора', 'Redmi 7', 1330, 40],['Замена датчика приближения', 'Redmi 7', 1050, 45],['Замена динамика/звонка', 'Redmi 7', 1150, 40],['Замена дисплея', 'Redmi 7', 2690, 90],['Замена задней крышки', 'Redmi 7', 1200, 60],['Замена основной камеры', 'Redmi 7', 2150, 60],['Замена передней камеры(Себяшки)', 'Redmi 7', 2100, 60],['Замена кнопки включения', 'Redmi 7', 1100, 60],['Замена микрофона', 'Redmi 7', 1150, 60],['Замена разъема зарядки/гарнитуры', 'Redmi 7', 1250, 60],['Замена шлейфа', 'Redmi 7', 1250, 60],['Программный ремонт/Обновление ПО', 'Redmi 7', 1000, 90],['Ремонт кнопки Home', 'Redmi 7', 1650, 60],['Технически сложный ремонт', 'Redmi 7', 1200, 90],['Восстановление после попадания воды', 'Redmi 7a', 800, 50],['Замена аккумулятора', 'Redmi 7a', 1330, 40],['Замена датчика приближения', 'Redmi 7a', 1050, 45],['Замена динамика/звонка', 'Redmi 7a', 1150, 40],['Замена дисплея', 'Redmi 7a', 2300, 90],['Замена задней крышки', 'Redmi 7a', 1200, 60],['Замена основной камеры', 'Redmi 7a', 2150, 60],['Замена передней камеры(Себяшки)', 'Redmi 7a', 2100, 60],['Замена кнопки включения', 'Redmi 7a', 1100, 60],['Замена микрофона', 'Redmi 7a', 1150, 60],['Замена разъема зарядки/гарнитуры', 'Redmi 7a', 1250, 60],['Замена шлейфа', 'Redmi 7a', 1250, 60],['Программный ремонт/Обновление ПО', 'Redmi 7a', 1000, 90],['Ремонт кнопки Home', 'Redmi 7a', 1600, 60],['Технически сложный ремонт', 'Redmi 7a', 1200, 90],['Восстановление после попадания воды', 'Redmi Note 7', 800, 50],['Замена аккумулятора', 'Redmi Note 7', 1370, 40],['Замена датчика приближения', 'Redmi Note 7', 1150, 45],['Замена динамика/звонка', 'Redmi Note 7', 1150, 40],['Замена дисплея', 'Redmi Note 7', 2450, 90],['Замена задней крышки', 'Redmi Note 7', 1250, 60],['Замена основной камеры', 'Redmi Note 7', 2350, 60],['Замена передней камеры(Себяшки)', 'Redmi Note 7', 2200, 60],['Замена кнопки включения', 'Redmi Note 7', 1150, 60],['Замена микрофона', 'Redmi Note 7', 1250, 60],['Замена разъема зарядки/гарнитуры', 'Redmi Note 7', 1250, 60],['Замена шлейфа', 'Redmi Note 7', 1300, 60],['Программный ремонт/Обновление ПО', 'Redmi Note 7', 1000, 90],['Ремонт кнопки Home', 'Redmi Note 7', 1800, 60],['Технически сложный ремонт', 'Redmi Note 7', 1250, 90],['Восстановление после попадания воды', 'Redmi Note 7 Pro', 800, 50],['Замена аккумулятора', 'Redmi Note 7 Pro', 1370, 40],['Замена датчика приближения', 'Redmi Note 7 Pro', 1150, 45],['Замена динамика/звонка', 'Redmi Note 7 Pro', 1150, 40],['Замена дисплея', 'Redmi Note 7 Pro', 2450, 90],['Замена задней крышки', 'Redmi Note 7 Pro', 1250, 60],['Замена основной камеры', 'Redmi Note 7 Pro', 2350, 60],['Замена передней камеры(Себяшки)', 'Redmi Note 7 Pro', 2200, 60],['Замена кнопки включения', 'Redmi Note 7 Pro', 1150, 60],['Замена микрофона', 'Redmi Note 7 Pro', 1250, 60],['Замена разъема зарядки/гарнитуры', 'Redmi Note 7 Pro', 1250, 60],['Замена шлейфа', 'Redmi Note 7 Pro', 1300, 60],['Программный ремонт/Обновление ПО', 'Redmi Note 7 Pro', 1000, 90],['Ремонт кнопки Home', 'Redmi Note 7 Pro', 1800, 60],['Технически сложный ремонт', 'Redmi Note 7 Pro', 1250, 90],['Восстановление после попадания воды', 'Redmi Note 8', 900, 50],['Замена аккумулятора', 'Redmi Note 8', 1350, 40],['Замена датчика приближения', 'Redmi Note 8', 1200, 45],['Замена динамика/звонка', 'Redmi Note 8', 1220, 40],['Замена дисплея', 'Redmi Note 8', 2900, 90],['Замена задней крышки', 'Redmi Note 8', 1350, 60],['Замена основной камеры', 'Redmi Note 8', 2990, 60],['Замена передней камеры(Себяшки)', 'Redmi Note 8', 2300, 60],['Замена кнопки включения', 'Redmi Note 8', 1220, 60],['Замена микрофона', 'Redmi Note 8', 1250, 60],['Замена разъема зарядки/гарнитуры', 'Redmi Note 8', 1300, 60],['Замена шлейфа', 'Redmi Note 8', 1350, 60],['Программный ремонт/Обновление ПО', 'Redmi Note 8', 1000, 90],['Ремонт кнопки Home', 'Redmi Note 8', 1900, 60],['Технически сложный ремонт', 'Redmi Note 8', 1300, 90],['Восстановление после попадания воды', 'Redmi Note 8 Pro', 900, 50],['Замена аккумулятора', 'Redmi Note 8 Pro', 1350, 40],['Замена датчика приближения', 'Redmi Note 8 Pro', 1200, 45],['Замена динамика/звонка', 'Redmi Note 8 Pro', 1220, 40],['Замена дисплея', 'Redmi Note 8 Pro', 3700, 90],['Замена задней крышки', 'Redmi Note 8 Pro', 1350, 60],['Замена основной камеры', 'Redmi Note 8 Pro', 2990, 60],['Замена передней камеры(Себяшки)', 'Redmi Note 8 Pro', 2300, 60],['Замена кнопки включения', 'Redmi Note 8 Pro', 1220, 60],['Замена микрофона', 'Redmi Note 8 Pro', 1250, 60],['Замена разъема зарядки/гарнитуры', 'Redmi Note 8 Pro', 1300, 60],['Замена шлейфа', 'Redmi Note 8 Pro', 1350, 60],['Программный ремонт/Обновление ПО', 'Redmi Note 8 Pro', 1000, 90],['Ремонт кнопки Home', 'Redmi Note 8 Pro', 1900, 60],['Технически сложный ремонт', 'Redmi Note 8 Pro', 1300, 90],['Восстановление после попадания воды', 'Redmi Note 8T', 900, 50],['Замена аккумулятора', 'Redmi Note 8T', 1350, 40],['Замена датчика приближения', 'Redmi Note 8T', 1200, 45],['Замена динамика/звонка', 'Redmi Note 8T', 1220, 40],['Замена дисплея', 'Redmi Note 8T', 2900, 90],['Замена задней крышки', 'Redmi Note 8T', 1350, 60],['Замена основной камеры', 'Redmi Note 8T', 2990, 60],['Замена передней камеры(Себяшки)', 'Redmi Note 8T', 2300, 60],['Замена кнопки включения', 'Redmi Note 8T', 1220, 60],['Замена микрофона', 'Redmi Note 8T', 1250, 60],['Замена разъема зарядки/гарнитуры', 'Redmi Note 8T', 1300, 60],['Замена шлейфа', 'Redmi Note 8T', 1350, 60],['Программный ремонт/Обновление ПО', 'Redmi Note 8T', 1000, 90],['Ремонт кнопки Home', 'Redmi Note 8T', 1900, 60],['Технически сложный ремонт', 'Redmi Note 8T', 1300, 90],['Восстановление после попадания воды', 'Pocophone F1', 900, 50],['Замена аккумулятора', 'Pocophone F1', 1300, 40],['Замена датчика приближения', 'Pocophone F1', 1200, 45],['Замена динамика/звонка', 'Pocophone F1', 1230, 40],['Замена дисплея', 'Pocophone F1', 2800, 90],['Замена задней крышки', 'Pocophone F1', 1350, 60],['Замена основной камеры', 'Pocophone F1', 2800, 60],['Замена передней камеры(Себяшки)', 'Pocophone F1', 2100, 60],['Замена кнопки включения', 'Pocophone F1', 1220, 60],['Замена микрофона', 'Pocophone F1', 1250, 60],['Замена разъема зарядки/гарнитуры', 'Pocophone F1', 1250, 60],['Замена шлейфа', 'Pocophone F1', 1200, 60],['Программный ремонт/Обновление ПО', 'Pocophone F1', 1000, 90],['Ремонт кнопки Home', 'Pocophone F1', 1800, 60],['Технически сложный ремонт', 'Pocophone F1', 1350, 90],['Восстановление после попадания воды', 'Redmi Go', 800, 50],['Замена аккумулятора', 'Redmi Go', 1250, 40],['Замена датчика приближения', 'Redmi Go', 990, 45],['Замена динамика/звонка', 'Redmi Go', 900, 40],['Замена дисплея', 'Redmi Go', 2350, 90],['Замена задней крышки', 'Redmi Go', 1300, 60],['Замена основной камеры', 'Redmi Go', 1990, 60],['Замена передней камеры(Себяшки)', 'Redmi Go', 1700, 60],['Замена кнопки включения', 'Redmi Go', 990, 60],['Замена микрофона', 'Redmi Go', 1000, 60],['Замена разъема зарядки/гарнитуры', 'Redmi Go', 1150, 60],['Замена шлейфа', 'Redmi Go', 1150, 60],['Программный ремонт/Обновление ПО', 'Redmi Go', 1000, 90],['Ремонт кнопки Home', 'Redmi Go', 1300, 60],['Технически сложный ремонт', 'Redmi Go', 1200, 90],];

let priceServicePhoneDefault = [["Диагностика","от 150","от 2 ч до 1 дня"],["Замена камеры","от 700","от 6 ч до 1 дня"],["Замена микрофона/динамика/звонка","от 700","от 2 ч до 1 дня"],["Замена аккумулятора","от 600","от 2 ч до 1 дня"],["Восстановление после попадания воды","от 550","от 2 ч до 1 дня"],["Замена кнопки включения","от 700","от 2 ч до 1 дня"],["Замена задней крышки/корпуса в сборе","от 600","от 2 ч до 1 дня"],["Замена разъема питания/гарнитуры","от 700","от 2 ч до 1 дня"],["Замена шлейфа/кнопки home","от 700","от 2 ч до 1 дня"],["Программный ремонт/Обновление ПО/Разблокировка","от 500","от 2 ч до 1 дня"],["Технически сложный ремонт","от 1200","от 2 ч до 1 дня"],["Замена стекла (touch screen)","от 700","от 2 ч до 1 дня"]];

let priceServiceLaptopDefault = [["Чистка ноутбука","от 500","от 5 ч до 2 дней"],["Замена камеры","от 700","от 6 ч до 1 дня"],["Восстановление после падения","от 1200","от 5 ч до 2 дней"],["Восстановление после воды, падения","от 1000","от 5 ч до 2 дней"],["Замена видеокарты","от 1500","от 5 ч до 2 дней"],["Ремонт видеокарты","от 1500","от 5 ч до 2 дней"],["Ремонт платы","от 1200","от 5 ч до 2 дней"],["Диагностика","от 500","5 ч до 2 дней"],["Замена матрицы ноутбука","от 700","от 5 ч до 2 дней"],["Замена разъемов","от 900","от 5 ч до 2 дней"],["Замена разъема зарядки/usb","от 950","от 5 ч до 2 дней"],["Ремонт клавиатуры","от 1200","от 5 ч до 2 дней"],["Замена клавиатуры","от 700","от 5 ч до 2 дней"]];

let priceServiceTabletDefault = [["Программный ремонт/Обновление ПО/Разблокировка","от 850","от 6 ч до 2 дней"],["Замена шлейфа/кнопки home","от 1190","от 6 ч до 2 дней"],["Замена стекла (touch screen)","от 1190","от 6 ч до 2 дней"],["Замена разъема питания/гарнитуры","от 1190","от 6 ч до 2 дней"],["Замена кнопки включения","от 1360","от 6 ч до 2 дней"],["Замена задней крышки/корпуса в сборе","от 1020","от 6 ч до 2 дней"],["Технически сложный ремонт","от 2040","от 6 ч до 2 дней"],["Диагностика","от 255","от 6 ч до 2 дней"],["Восстановление после попадания воды","от 935","от 6 ч до 2 дней"],["Замена аккумулятора","от 1020","от 6 ч до 2 дней"],["Замена микрофона/динамика/звонка","от 1190","от 6 ч до 2 дней"],["Замена камеры","от 1190","от 6 ч до 2 дней"]];



$(document).ready( function () {
  let ua = window.navigator.userAgent;
  let msie = ua.indexOf("MSIE ");
  let heightModel = '';
  let modelWindow_check = '';
  let priceDevice_check = 'Телефон';
  let priceModel_check = '';
  let price_check = '';
  let model_check = false;
  let metrika_chek = '';

  let nodeJob_status = '';

  const btnPrevNavBar = $("#carouselLeftNavBarMobile");
  const btnNextNavBar = $("#carouselRightNavBarMobile");

  let valNavBar = 1;
  btnNextNavBar.click(function(){

    valNavBar++;

    if(valNavBar <= 3){
      $(".navBar > ul > li").css({
        "display" : "none",
      });
      $(".navBar > ul > li:nth-of-type("+valNavBar+")").css({
        "display" : "grid",
      });
    }
    else{
      valNavBar--;
    }

  });
  btnPrevNavBar.click(function(){

    valNavBar--;

    if(valNavBar >= 1){
      $(".navBar > ul > li").css({
        "display" : "none",
      });
      $(".navBar > ul > li:nth-of-type("+valNavBar+")").css({
        "display" : "grid",
      });
    }
    else{
      valNavBar++;
    }

  });

  function deviceSelectedActions(typedevice){
    switch (typedevice) {
      case "Телефон":
        $('.deviceSelectedImages').removeClass('deviceSelectedImagesActive');
        $('.deviceSelectedPhone').addClass('deviceSelectedImagesActive');
        break;
      case "Ноутбук":
        $('.deviceSelectedImages').removeClass('deviceSelectedImagesActive');
        $('.deviceSelectedLaptop').addClass('deviceSelectedImagesActive');
        break;
      case "Планшет":
        $('.deviceSelectedImages').removeClass('deviceSelectedImagesActive');
        $('.deviceSelectedTablet').addClass('deviceSelectedImagesActive');
        break;
      default:
        return false;
    }
  }
  function addPriceService(array){
    $('.priceMainContent section').empty();
    if (priceDevice_check == 'Планшет' || priceDevice_check == 'Ноутбук' || (priceDevice_check == 'Телефон' && priceModel_check == '')) {
      array.forEach((item, i) => {
        $('.priceMainContent section').append('<div class="priceBox"><span class="titlePriceBox">'+item[0]+'</span>'+'<span class="dedlaine">'+item[2]+'</span>'+'<span class="price">'+item[1]+' ₽</span></div>');
      });
    }
    else{
      array.forEach((item, i) => {

        if (item[1] == priceModel_check) {
          if (item[0] == 'Восстановление после попадания воды') {
            $('.priceMainContent section').append('<div class="priceBox"><span class="titlePriceBox">'+item[0]+'</span>'+'<span class="dedlaine">'+item[3]+' минут</span>'+'<span class="price">От '+(+item[2]+500)+' ₽</span></div>');
            return;
          }
          $('.priceMainContent section').append('<div class="priceBox"><span class="titlePriceBox">'+item[0]+'</span>'+'<span class="dedlaine">'+item[3]+' минут</span>'+'<span class="price">От '+(+item[2]+500)+' ₽</span></div>');
        }
      });
    }
  }
  function sendAjaxForm(url) {
      $.ajax({
          url:     url, //url страницы (action_ajax_form.php)
          type:     "POST", //метод отправки
          dataType: "html", //формат данных
          data: "name="+$("#firstNameId").val()+" "+$("#nameId").val()+" "+$("#lastNameId").val()+"&tel="+$("#telId").val()+"&nodeJob="+nodeJob_status+"&desp="+$("#descId").val()+"&type="+priceDevice_check+"&brand=Xiaomi&model="+priceModel_check+"&service="+$("#service_title").text()+"&priceService="+price_check,  // Сеарилизуем объект
          success: function() { //Данные отправлены успешно
            priceModel_check='';
            $('.modelCheck').text('Модель не выбрана');
            switch (metrika_chek) {
              case 'click_perezvonit':
                ym(67091065,'reachGoal','otpravka_perezvonit');
                break;
              case 'zakazat_remont':
                ym(67091065,'reachGoal','zakazat_remont_otpravlen');
                break;
              case 'zakaz_uslugi':
                ym(67091065,'reachGoal','zakaz_uslugi_otpravlen');
                break;
              case 'razbor_otpravlen':
                ym(67091065,'reachGoal','razbor_otpravlen');
                break;
              default:
                return false;
            }
            $('.popup-fade').fadeIn(200);
            $('.popup').hide();
            $('.popup_success').fadeIn(200);
        },
        error: function(response) { // Данные не отправлены
          alert("Что то пошло не так, повторите попытку позже");
        }
    });
  }
  function sendAjaxFormConsult(url, name, tel) {
      $.ajax({
          url:     url, //url страницы (action_ajax_form.php)
          type:     "POST", //метод отправки
          dataType: "html", //формат данных
          data: "name="+name+"&tel="+tel+"&brand=Xiaomi&nodeJob="+nodeJob_status,  // Сеарилизуем объект
          success: function(data) { //Данные отправлены успешно
            priceModel_check='';
            $('.modelCheck').text('Модель не выбрана');
            switch (metrika_chek) {
              case 'zaberem_iz_doma':
                ym(67091065,'reachGoal','otpravka_perezvonit');
                break;
              case 'konsultacia':
                ym(67091065,'reachGoal','zakazat_remont_otpravlen');
                break;
              default:
                return false;
            }
            $('.popup').hide();
            $('.popup_success').fadeIn();
        		$('.popup-fade').fadeIn(100);
            $('input[name=homeOrderFormTel]').val("");
            $('input[name=homeOrderFormName]').val("");
            someFunction( data );
            return data;

        },
        error: function(response) { // Данные не отправлены
          alert("Что то пошло не так, повторите попытку позже");
        }
    });
  }
 function someFunction(data) {
   $(".menu").text(data);
 }


  arrayModel.forEach((item, i) => {
    $('.modelMainContent section').append('<div class="modelBox"><span class="titleModelBox">'+item[1]+'</span>'+'<img src="img/Xiaomi/xiaomi/'+item[1].trim().toLowerCase().replace(/[^a-zA-Z0-9 -]/, "").replace(/\s/g, "-")+'.png" class="img_modelBox"></div>');
  });



  addPriceService(priceServicePhoneDefault);


    $(".modelBox").mouseenter(function(){
    if(!(/iPhone|iPad|iPod|Android/i.test(navigator.userAgent)) || !(window.matchMedia('(max-width: 860px)').matches)){
      $(this).children(".img_modelBox").animate({
  	      "margin-bottom": "10px", // высота элемента
  	   }, 200);
     }
    });
    $(".modelBox").mouseleave(function(){
      if(!(/iPhone|iPad|iPod|Android/i.test(navigator.userAgent)) || !(window.matchMedia('(max-width: 860px)').matches)){
      $(this).children(".img_modelBox").animate({
  	      "margin-bottom": "-30px", // высота элемента
  	   }, 200);
     }
    });

    $(window).scroll(function(){
      if(/iPhone|iPad|iPod|Android/i.test(navigator.userAgent) || window.matchMedia('(max-width: 860px)').matches){
        if($(window).scrollTop() > 200){
          $('.headerTop').css({
            "grid-template-rows" : "40px 1fr auto",
          });
        }
        else{
          $('.headerTop').css({
            "grid-template-rows" : "60px 1fr auto",
          });
        }
      }
    });


  $(window).resize(function() {
    if($(".bg_navBar").width() > 426){
      $(".navBar > ul > li").css({
        "display" : "grid",
      });
    }
    if($(".bg_navBar").width() < 426){
      $(".navBar > ul > li").css({
        "display" : "none",
      });
      $(".navBar > ul > li:nth-of-type(1)").css({
        "display" : "grid",
      });
    }
  });

  $('.collapseMenu').click(function(){
    if($('.menu').css('display') == 'grid'){
      $('.menu').hide(400);
    }
    else if($('.menu').css('display') == 'none'){

        $('.menu').show(400, function(){
          $('.menu').css({
            'display': 'grid'
          });
        });
    }
  });

  $('#collapseContactHeaderId').click(function(){
    if($('#contactHeaderId').css('display') == 'grid'){
      $('#contactHeaderId').hide(400);
    }
    else if($('#contactHeaderId').css('display') == 'none'){
        $('#contactHeaderId').show({
          duration: 400,
          options: "start",
          complete: function(){
            $('#contactHeaderId').css({
              'display': 'grid'
            });
          }});
    }});

    $('input[name=homeOrderFormTel]').inputmask("+7(999)999-9999");
    $('input[name=homeOrderFormSubmit]').click(
      function() {
        if ($(this).attr('id') == 'homeOrderFormSubmitId homeOrderFormSubmit1') {
          nodeJob_status = 'Забрать у клиента';
          metrika_chek = 'zaberem_iz_doma';
        }
        else if($(this).attr('id') == 'homeOrderFormSubmitId homeOrderFormSubmit2') {
          nodeJob_status = 'Консультация';
          metrika_chek = 'konsultacia';
        }
        let valtel = $(this).siblings('input[name=homeOrderFormTel]').val();
        let valName = $(this).siblings('input[name=homeOrderFormName]').val();
        let reges = /^(\+)?(\(\d{2,3}\) ?\d|\d)(([ \-]?\d)|( ?\(\d{2,3}\) ?)){5,12}\d$/;

        if(valName.length >= 1 && reges.test(valtel)){
          sendAjaxFormConsult('obrabotchik.php', valName, valtel);
        }

        if(valName.length < 1){
          $(this).siblings('input[name=homeOrderFormName]').css({"border" : " 1px solid red",});
        }
        else{
          $(this).siblings('input[name=homeOrderFormName]').css({"border" : "none"});
        }

        if(!(reges.test(valtel))){
          $(this).siblings('input[name=homeOrderFormTel]').css({"border" : " 1px solid red",});
        }
        else{
          $(this).siblings('input[name=homeOrderFormTel]').css({"border" : "none"});
        }
      }
    );

    $('#telId').inputmask("+7(999)999-9999");
    $("#btnSend").click(
      function(){
        let valName = $('#nameId').val();
        let valFirstName = $('#firstNameId').val();
        let valtel = $('#telId').val();
        let valDataProcessing = $('#dataProcessingId').val();
        let reges = /^(\+)?(\(\d{2,3}\) ?\d|\d)(([ \-]?\d)|( ?\(\d{2,3}\) ?)){5,12}\d$/;

        if(valName.length >= 1 && reges.test(valtel) && $('#dataProcessingId').is(":checked") && valFirstName.length >= 1){
          sendAjaxForm('obrabotchik.php');
        }

        if(valName.length < 1){
          $('#nameId').css({"border-color" : "red"});
        }
        else{
          $('#nameId').css({"border-color" : "#BDBDBD"});
        }

        if(valFirstName.length < 1){
          $('#firstNameId').css({"border-color" : "red"});
        }
        else{
          $('#firstNameId').css({"border-color" : "#BDBDBD"});
        }

        if(!(reges.test(valtel))){
          $('#telId').css({"border-color" : "red"});
        }
        else{
          $('#telId').css({"border-color" : "#BDBDBD"});
        }

        if(!($('#dataProcessingId').is(":checked"))){
          $('#dataProcessingId + label').css({"color" : "red"});
        }
        else{
          $('#dataProcessingId + label').css({"color" : "#BDBDBD"});
        }
        return false;
      }
    );

    $('.deviceSelectedImages').click(function() {
      switch($(this).attr('id')) {
        case 'deviceSelectedPhoneId':
          priceDevice_check = 'Телефон';
          deviceSelectedActions(priceDevice_check);
          if (priceModel_check != '') {
            addPriceService(priceService);
            $('.modelCheck').text(priceModel_check);
            break
          }
          addPriceService(priceServicePhoneDefault);
          $('.modelCheck').text('Модель не выбрана');
          break
        case 'deviceSelectedLaptopId':
          priceDevice_check = 'Ноутбук';
          addPriceService(priceServiceLaptopDefault);
          deviceSelectedActions(priceDevice_check);
          $('.modelCheck').text('Модель не выбрана');
          break
        case 'deviceSelectedTabletId':
          priceDevice_check = 'Планшет';
          addPriceService(priceServiceTabletDefault);
          deviceSelectedActions(priceDevice_check);
          $('.modelCheck').text('Модель не выбрана');
          break
        default:
          return false;
      }
    });

    $(".modelBox").click(function(){
      priceModel_check = $(this).children('.titleModelBox').text();
      $('.modelCheck').text(priceModel_check);

      arrayModel.forEach((item, i) => {
        if (item[1] == priceModel_check) {
          priceDevice_check = item[0];
        }
      });
      addPriceService(priceService);
      deviceSelectedActions(priceDevice_check);
      let titleModel = $(this).children(".titleModelBox").text().trim().toLowerCase().replace(/[^a-zA-Z0-9 -]/, "").replace(/\s/g, "-");
      location.href = '#priceMainContentHref';
      location.href = '#model-'+titleModel;
    });

    $(document).on("click", ".searchModelItem", function(){
      priceModel_check = $(this).text();
      $('.modelCheck').text(priceModel_check);

      arrayModel.forEach((item) => {
          if (item[1] == priceModel_check) {
              priceDevice_check = item[0];
          }
      });

      addPriceService(priceService);

      deviceSelectedActions(priceDevice_check);

      let titleModel = $(this).text().trim().toLowerCase().replace(/[^a-zA-Z0-9 -]/, "").replace(/\s/g, "-");

      location.href = '#priceMainContentHref';
      location.href = '#model-'+titleModel;
      $("#js-search").val("");
      $(".searchModelItems").slideUp();
    });

    $(window).scroll(function(){
        if($(window).scrollTop() > 800){
          $('#upPage').fadeIn(200);
        }
        else if($(window).scrollTop() <= 800){
          $('#upPage').hide(200);
        }
    });

    $('#upPage').click(function() {
  		$('html, body').animate({scrollTop: 0},200);
  		return false;
  	})

    $(document).on("click", '#order, .titleInfoBoxDestroy, .priceBox, .contact', function() {
      switch($(this).attr('class')) {
        case 'orderSubmit':
          ym(67091065,'reachGoal','zakazat_remont');
          metrika_chek = 'zakazat_remont';
          nodeJob_status = 'Заявка на ремонт';
          $('.popup_form_input_desc').css({'display' : 'flex'});
          modelWindow_check = '.popup_form_input_desc';
          break;

        case 'titleInfoBoxDestroy':
          metrika_chek = 'razbor_otpravlen';
          nodeJob_status = 'Заявка на разбор телефона';
          $('.popup_form_dropdown_loyaut').css({'display' : 'grid'});
          modelWindow_check = '.popup_form_dropdown_loyaut';
          break;

        case 'priceBox':
          ym(67091065,'reachGoal','zakaz_uslugi');
          metrika_chek = 'zakaz_uslugi';
          nodeJob_status = 'Заявка на ремонт';
          $('.popup_form_service_loyaut').css({'display' : 'flex'});
          $('#service_title').append($(this).children(".titlePriceBox").text());
          if (priceModel_check == '') {
            $('#service_device_device').append(priceDevice_check+', ');
          }
          else {
            $('#service_device_device').append(priceModel_check+', ');
          }
          $('#service_device_cost').append($(this).children(".price").text());
          modelWindow_check = '.popup_form_service_loyaut';
          price_check = $(this).children('.price').text();
          break;

        case 'contact':
          ym(67091065,'reachGoal','click_perezvonit');
          metrika_chek = 'click_perezvonit';
          nodeJob_status = 'Консультация';
          break;

        default:
          return false;
      }
      $('.popup').fadeIn();
      $('.popup_success').hide();
  		$('.popup-fade').fadeIn(100);
  		return false;
    });
    // Клик по ссылке "Закрыть".
    $('.closes').click(function() {
      $(modelWindow_check).hide();
      $(this).parents('.popup-fade').fadeOut(100);
      $('#service_title').empty();
      $('#service_device_device').empty();
      $('#service_device_cost').empty();
      modelWindow_check='';
      price_check='';
      return false;
    });
    // Закрытие по клавише Esc.
    $(document).keydown(function(e) {
      if (e.keyCode === 27) {
        e.stopPropagation();
        $('.popup-fade').fadeOut(100);
        $(modelWindow_check).hide();
        $('#service_title').empty();
        $('#service_device_device').empty();
        $('#service_device_cost').empty();
        modelWindow_check='';
        price_check='';
      }

    });
    // Клик по фону, но не по окну.
    $('.popup-fade').click(function(e) {
      if ($(e.target).closest('.popup').length == 0 && $(e.target).closest('.popup_success').length == 0) {
        $(this).fadeOut(100);
        $(modelWindow_check).hide();
        $('#service_title').empty();
        $('#service_device_device').empty();
        $('#service_device_cost').empty();
        modelWindow_check='';
        price_check='';
      }
    });
    $('select[name=device]').change(function() {
      $('select[name=model]').empty();
      $('select[name=model]').append('<option selected disabled >-</option>');
      let items = $(this).val();
      arrayModel.forEach((item, i) => {
        if (item[0] == items) {
          $('select[name=model]').append('<option value="'+item[1]+'">'+item[1]+'</option>')
        }
      });
      priceDevice_check = $(this).val();
    });
    $('select[name=model]').change(function() {
      priceModel_check = $(this).val();
    });

    $('.slider').slick({
      slidesToShow: 3,
      slidesToScroll: 1,
      responsive: [
        {
          breakpoint: 1050,
          settings: {
            slidesToShow: 2,
            slidesToScroll: 1,
          }
        },
        {
          breakpoint: 700,
          settings: {
            slidesToShow: 1,
            slidesToScroll: 1,
          }
        },
        {
          breakpoint: 426,
          settings: {
            slidesToShow: 1,
            slidesToScroll: 1,
            arrows: false,
            centerMode: true,
            variableWidth: true
          }
        },
      ]
    });

    $('.sliderNavBar').slick({
      slidesToShow: 3,
      responsive: [
        {
          breakpoint: 1050,
          settings: {
            slidesToShow: 2,
            slidesToScroll: 1,
          }
        },
        {
          breakpoint: 700,
          settings: {
            slidesToShow: 1,
            slidesToScroll: 1
          }
        }
      ]
    });

    $('.trackComment').slick({
      slidesToShow: 3,
      slidesToScroll: 1,
      responsive: [
        {
          breakpoint: 1330,
          settings: {
            slidesToShow: 2,
            slidesToScroll: 1,
          }
        },
        {
          breakpoint: 860,
          settings: {
            slidesToShow: 1,
            slidesToScroll: 1
          }
        }
      ]
    });


});
