let arrayModel =  [['Телефон', 'V10'],['Телефон', 'V8'],['Телефон', 'View 20'],['Телефон', '8C'],['Телефон', '8X'],['Телефон', '8X Max'],['Телефон', '9'],['Телефон', '9 Lite'],['Телефон', '9X'],['Телефон', 'Magic 2'],['Телефон', 'Note 10'],['Телефон', 'Note 8'],['Телефон', 'Play'],['Телефон', '10'],['Телефон', '10 Lite'],['Телефон', '10i'],['Телефон', '20'],['Телефон', '20 Pro'],['Телефон', '20S'],['Телефон', '3C (TD)'],['Телефон', '3c Lite'],['Телефон', '3X'],['Телефон', '4 play'],['Телефон', '4C'],['Телефон', '4C Pro'],['Телефон', '4x'],['Телефон', '5A'],['Телефон', '5C (China)'],['Телефон', '5C (Europe)'],['Телефон', '5X'],['Телефон', '6'],['Телефон', '6 Plus'],['Телефон', '6A'],['Телефон', '6C'],['Телефон', '6C Pro'],['Телефон', '7'],['Телефон', '7A'],['Телефон', '7A Play'],['Телефон', '7A Pro'],['Телефон', '7C Pro'],['Телефон', '7i'],['Телефон', '7X'],['Телефон', '7C'],['Телефон', '8'],['Телефон', '8 Lite'],['Телефон', '8 Pro'],['Телефон', '8A'],];

let priceService =   [['Восстановление после попадания воды', 'V10', ' 1350', ' 90', ],['Замена аккумулятора', 'V10', ' 1650', ' 60', ],['Замена датчика приближения', 'V10', ' 1550', ' 75', ],['Замена динамика/звонка', 'V10', ' 1250', ' 60', ],['Замена дисплея', 'V10', ' 2690', ' 60', ],['Замена задней крышки', 'V10', ' 2690', ' 60', ],['Замена основной камеры', 'V10', ' 2650', ' 75', ],['Замена кнопки включения', 'V10', ' 1200', ' 75', ],['Замена микрофона', 'V10', ' 1300', ' 75', ],['Замена разъема зарядки/гарнитуры', 'V10', ' 1450', ' 60', ],['Замена шлейфа', 'V10', ' 1400', ' 75', ],['Программный ремонт/Обновление ПО', 'V10', ' 1200', ' 120', ],['Ремонт кнопки Home', 'V10', ' 1650', ' 75', ],['Технически сложный ремонт', 'V10', ' 1750', ' 90', ],['Восстановление после попадания воды', 'V8', ' 1200', ' 90', ],['Замена аккумулятора', 'V8', ' 1500', ' 60', ],['Замена датчика приближения', 'V8', ' 1350', ' 75', ],['Замена динамика/звонка', 'V8', ' 1250', ' 60', ],['Замена дисплея', 'V8', ' 3200', ' 60', ],['Замена задней крышки', 'V8', ' 1200', ' 60', ],['Замена основной камеры', 'V8', ' 2650', ' 75', ],['Замена кнопки включения', 'V8', ' 1450', ' 75', ],['Замена микрофона', 'V8', ' 1300', ' 75', ],['Замена разъема зарядки/гарнитуры', 'V8', ' 1450', ' 60', ],['Замена шлейфа', 'V8', ' 1350', ' 75', ],['Программный ремонт/Обновление ПО', 'V8', ' 1200', ' 120', ],['Ремонт кнопки Home', 'V8', ' 1600', ' 75', ],['Технически сложный ремонт', 'V8', ' 1750', ' 90', ],['Восстановление после попадания воды', 'View 20', ' 1200', ' 90', ],['Замена аккумулятора', 'View 20', ' 1350', ' 60', ],['Замена датчика приближения', 'View 20', ' 1450', ' 75', ],['Замена динамика/звонка', 'View 20', ' 1250', ' 60', ],['Замена дисплея', 'View 20', ' 2900', ' 60', ],['Замена задней крышки', 'View 20', ' 1160', ' 60', ],['Замена основной камеры', 'View 20', ' 2350', ' 75', ],['Замена кнопки включения', 'View 20', ' 1250', ' 75', ],['Замена микрофона', 'View 20', ' 1250', ' 75', ],['Замена разъема зарядки/гарнитуры', 'View 20', ' 1300', ' 60', ],['Замена шлейфа', 'View 20', ' 1300', ' 75', ],['Программный ремонт/Обновление ПО', 'View 20', ' 1100', ' 120', ],['Ремонт кнопки Home', 'View 20', ' 1600', ' 75', ],['Технически сложный ремонт', 'View 20', ' 1550', ' 90', ],['Восстановление после попадания воды', '8C', ' 1100', ' 90', ],['Замена аккумулятора', '8C', ' 1300', ' 60', ],['Замена датчика приближения', '8C', ' 1250', ' 75', ],['Замена динамика/звонка', '8C', ' 1200', ' 60', ],['Замена дисплея', '8C', ' 3200', ' 60', ],['Замена задней крышки', '8C', ' 1190', ' 60', ],['Замена основной камеры', '8C', ' 2250', ' 75', ],['Замена кнопки включения', '8C', ' 1250', ' 75', ],['Замена микрофона', '8C', ' 1200', ' 75', ],['Замена разъема зарядки/гарнитуры', '8C', ' 1250', ' 60', ],['Замена шлейфа', '8C', ' 1300', ' 75', ],['Программный ремонт/Обновление ПО', '8C', ' 1000', ' 120', ],['Ремонт кнопки Home', '8C', ' 1500', ' 75', ],['Технически сложный ремонт', '8C', ' 1500', ' 90', ],['Восстановление после попадания воды', '8X', ' 1100', ' 90', ],['Замена аккумулятора', '8X', ' 1350', ' 60', ],['Замена датчика приближения', '8X', ' 1250', ' 75', ],['Замена динамика/звонка', '8X', ' 1200', ' 60', ],['Замена дисплея', '8X', ' 3650', ' 60', ],['Замена задней крышки', '8X', ' 1450', ' 60', ],['Замена основной камеры', '8X', ' 2300', ' 75', ],['Замена кнопки включения', '8X', ' 1260', ' 75', ],['Замена микрофона', '8X', ' 1300', ' 75', ],['Замена разъема зарядки/гарнитуры', '8X', ' 1250', ' 60', ],['Замена шлейфа', '8X', ' 1300', ' 75', ],['Программный ремонт/Обновление ПО', '8X', ' 1000', ' 120', ],['Ремонт кнопки Home', '8X', ' 1500', ' 75', ],['Технически сложный ремонт', '8X', ' 1500', ' 90', ],['Восстановление после попадания воды', '8X Max', ' 1150', ' 90', ],['Замена аккумулятора', '8X Max', ' 1450', ' 60', ],['Замена датчика приближения', '8X Max', ' 1400', ' 75', ],['Замена динамика/звонка', '8X Max', ' 1250', ' 60', ],['Замена дисплея', '8X Max', ' 2850', ' 60', ],['Замена задней крышки', '8X Max', ' 1190', ' 60', ],['Замена основной камеры', '8X Max', ' 2250', ' 75', ],['Замена кнопки включения', '8X Max', ' 1260', ' 75', ],['Замена микрофона', '8X Max', ' 1300', ' 75', ],['Замена разъема зарядки/гарнитуры', '8X Max', ' 1250', ' 60', ],['Замена шлейфа', '8X Max', ' 1300', ' 75', ],['Программный ремонт/Обновление ПО', '8X Max', ' 1000', ' 120', ],['Ремонт кнопки Home', '8X Max', ' 1500', ' 75', ],['Технически сложный ремонт', '8X Max', ' 1500', ' 90', ],['Восстановление после попадания воды', '9', ' 1100', ' 90', ],['Замена аккумулятора', '9', ' 1300', ' 60', ],['Замена датчика приближения', '9', ' 1350', ' 75', ],['Замена динамика/звонка', '9', ' 1200', ' 60', ],['Замена дисплея', '9', ' 2650', ' 60', ],['Замена задней крышки', '9', ' 1250', ' 60', ],['Замена основной камеры', '9', ' 2100', ' 75', ],['Замена кнопки включения', '9', ' 1190', ' 75', ],['Замена микрофона', '9', ' 1250', ' 75', ],['Замена разъема зарядки/гарнитуры', '9', ' 1250', ' 60', ],['Замена шлейфа', '9', ' 1250', ' 75', ],['Программный ремонт/Обновление ПО', '9', ' 1000', ' 120', ],['Ремонт кнопки Home', '9', ' 1550', ' 75', ],['Технически сложный ремонт', '9', ' 1500', ' 90', ],['Восстановление после попадания воды', '9 Lite', ' 1100', ' 90', ],['Замена аккумулятора', '9 Lite', ' 1300', ' 60', ],['Замена датчика приближения', '9 Lite', ' 1350', ' 75', ],['Замена динамика/звонка', '9 Lite', ' 1200', ' 60', ],['Замена дисплея', '9 Lite', ' 2295', ' 60', ],['Замена задней крышки', '9 Lite', ' 1160', ' 60', ],['Замена основной камеры', '9 Lite', ' 1990', ' 75', ],['Замена кнопки включения', '9 Lite', ' 1190', ' 75', ],['Замена микрофона', '9 Lite', ' 1250', ' 75', ],['Замена разъема зарядки/гарнитуры', '9 Lite', ' 1250', ' 60', ],['Замена шлейфа', '9 Lite', ' 1250', ' 75', ],['Программный ремонт/Обновление ПО', '9 Lite', ' 1000', ' 120', ],['Ремонт кнопки Home', '9 Lite', ' 1550', ' 75', ],['Технически сложный ремонт', '9 Lite', ' 1500', ' 90', ],['Восстановление после попадания воды', '9X', ' 1250', ' 90', ],['Замена аккумулятора', '9X', ' 1500', ' 60', ],['Замена датчика приближения', '9X', ' 1500', ' 75', ],['Замена динамика/звонка', '9X', ' 1300', ' 60', ],['Замена дисплея', '9X', ' 3650', ' 60', ],['Замена задней крышки', '9X', ' 1295', ' 60', ],['Замена основной камеры', '9X', ' 2100', ' 75', ],['Замена кнопки включения', '9X', ' 1300', ' 75', ],['Замена микрофона', '9X', ' 1350', ' 75', ],['Замена разъема зарядки/гарнитуры', '9X', ' 1350', ' 60', ],['Замена шлейфа', '9X', ' 1350', ' 75', ],['Программный ремонт/Обновление ПО', '9X', ' 1000', ' 120', ],['Ремонт кнопки Home', '9X', ' 1600', ' 75', ],['Технически сложный ремонт', '9X', ' 1500', ' 90', ],['Восстановление после попадания воды', 'Magic 2', ' 1350', ' 90', ],['Замена аккумулятора', 'Magic 2', ' 1600', ' 60', ],['Замена датчика приближения', 'Magic 2', ' 1600', ' 75', ],['Замена динамика/звонка', 'Magic 2', ' 1400', ' 60', ],['Замена дисплея', 'Magic 2', ' 11500', ' 60', ],['Замена задней крышки', 'Magic 2', ' 3390', ' 60', ],['Замена основной камеры', 'Magic 2', ' 3200', ' 75', ],['Замена кнопки включения', 'Magic 2', ' 1700', ' 75', ],['Замена микрофона', 'Magic 2', ' 1600', ' 75', ],['Замена разъема зарядки/гарнитуры', 'Magic 2', ' 1550', ' 60', ],['Замена шлейфа', 'Magic 2', ' 1500', ' 75', ],['Программный ремонт/Обновление ПО', 'Magic 2', ' 1000', ' 120', ],['Ремонт кнопки Home', 'Magic 2', ' 1990', ' 75', ],['Технически сложный ремонт', 'Magic 2', ' 1500', ' 90', ],['Восстановление после попадания воды', 'Note 10', ' 1350', ' 90', ],['Замена аккумулятора', 'Note 10', ' 1450', ' 60', ],['Замена датчика приближения', 'Note 10', ' 1500', ' 75', ],['Замена динамика/звонка', 'Note 10', ' 1200', ' 60', ],['Замена дисплея', 'Note 10', ' 13500', ' 60', ],['Замена задней крышки', 'Note 10', ' 3500', ' 60', ],['Замена основной камеры', 'Note 10', ' 2800', ' 75', ],['Замена кнопки включения', 'Note 10', ' 1500', ' 75', ],['Замена микрофона', 'Note 10', ' 1350', ' 75', ],['Замена разъема зарядки/гарнитуры', 'Note 10', ' 1400', ' 60', ],['Замена шлейфа', 'Note 10', ' 1300', ' 75', ],['Программный ремонт/Обновление ПО', 'Note 10', ' 1000', ' 120', ],['Ремонт кнопки Home', 'Note 10', ' 1500', ' 75', ],['Технически сложный ремонт', 'Note 10', ' 1500', ' 90', ],['Восстановление после попадания воды', 'Note 8', ' 1250', ' 90', ],['Замена аккумулятора', 'Note 8', ' 1450', ' 60', ],['Замена датчика приближения', 'Note 8', ' 1450', ' 75', ],['Замена динамика/звонка', 'Note 8', ' 1200', ' 60', ],['Замена дисплея', 'Note 8', ' 12000', ' 60', ],['Замена задней крышки', 'Note 8', ' 3440', ' 60', ],['Замена основной камеры', 'Note 8', ' 2700', ' 75', ],['Замена кнопки включения', 'Note 8', ' 1350', ' 75', ],['Замена микрофона', 'Note 8', ' 1350', ' 75', ],['Замена разъема зарядки/гарнитуры', 'Note 8', ' 1400', ' 60', ],['Замена шлейфа', 'Note 8', ' 1300', ' 75', ],['Программный ремонт/Обновление ПО', 'Note 8', ' 1000', ' 120', ],['Ремонт кнопки Home', 'Note 8', ' 1500', ' 75', ],['Технически сложный ремонт', 'Note 8', ' 1500', ' 90', ],['Восстановление после попадания воды', 'Play', ' 1200', ' 90', ],['Замена аккумулятора', 'Play', ' 1350', ' 60', ],['Замена датчика приближения', 'Play', ' 1450', ' 75', ],['Замена динамика/звонка', 'Play', ' 1200', ' 60', ],['Замена дисплея', 'Play', ' 3250', ' 60', ],['Замена задней крышки', 'Play', ' 2690', ' 60', ],['Замена основной камеры', 'Play', ' 1990', ' 75', ],['Замена кнопки включения', 'Play', ' 1200', ' 75', ],['Замена микрофона', 'Play', ' 1200', ' 75', ],['Замена разъема зарядки/гарнитуры', 'Play', ' 1250', ' 60', ],['Замена шлейфа', 'Play', ' 1250', ' 75', ],['Программный ремонт/Обновление ПО', 'Play', ' 1000', ' 120', ],['Ремонт кнопки Home', 'Play', ' 1450', ' 75', ],['Технически сложный ремонт', 'Play', ' 1500', ' 90', ],['Восстановление после попадания воды', '10', ' 1300', ' 90', ],['Замена аккумулятора', '10', ' 1450', ' 60', ],['Замена датчика приближения', '10', ' 1450', ' 75', ],['Замена динамика/звонка', '10', ' 1250', ' 60', ],['Замена дисплея', '10', ' 2450', ' 60', ],['Замена задней крышки', '10', ' 1190', ' 60', ],['Замена основной камеры', '10', ' 2250', ' 75', ],['Замена кнопки включения', '10', ' 1250', ' 75', ],['Замена микрофона', '10', ' 1400', ' 75', ],['Замена разъема зарядки/гарнитуры', '10', ' 1350', ' 60', ],['Замена шлейфа', '10', ' 1300', ' 75', ],['Программный ремонт/Обновление ПО', '10', ' 1000', ' 120', ],['Ремонт кнопки Home', '10', ' 1650', ' 75', ],['Технически сложный ремонт', '10', ' 1600', ' 90', ],['Восстановление после попадания воды', '10 Lite', ' 1300', ' 90', ],['Замена аккумулятора', '10 Lite', ' 1550', ' 60', ],['Замена датчика приближения', '10 Lite', ' 1450', ' 75', ],['Замена динамика/звонка', '10 Lite', ' 1250', ' 60', ],['Замена дисплея', '10 Lite', ' 3400', ' 60', ],['Замена задней крышки', '10 Lite', ' 1150', ' 60', ],['Замена основной камеры', '10 Lite', ' 2300', ' 75', ],['Замена кнопки включения', '10 Lite', ' 1250', ' 75', ],['Замена микрофона', '10 Lite', ' 1400', ' 75', ],['Замена разъема зарядки/гарнитуры', '10 Lite', ' 1350', ' 60', ],['Замена шлейфа', '10 Lite', ' 1300', ' 75', ],['Программный ремонт/Обновление ПО', '10 Lite', ' 1000', ' 120', ],['Ремонт кнопки Home', '10 Lite', ' 1650', ' 75', ],['Технически сложный ремонт', '10 Lite', ' 1600', ' 90', ],['Восстановление после попадания воды', '10i', ' 1300', ' 90', ],['Замена аккумулятора', '10i', ' 1550', ' 60', ],['Замена датчика приближения', '10i', ' 1450', ' 75', ],['Замена динамика/звонка', '10i', ' 1250', ' 60', ],['Замена дисплея', '10i', ' 3400', ' 60', ],['Замена задней крышки', '10i', ' 1150', ' 60', ],['Замена основной камеры', '10i', ' 2300', ' 75', ],['Замена кнопки включения', '10i', ' 1250', ' 75', ],['Замена микрофона', '10i', ' 1400', ' 75', ],['Замена разъема зарядки/гарнитуры', '10i', ' 1350', ' 60', ],['Замена шлейфа', '10i', ' 300', ' 75', ],['Программный ремонт/Обновление ПО', '10i', ' 1000', ' 120', ],['Ремонт кнопки Home', '10i', ' 1650', ' 75', ],['Технически сложный ремонт', '10i', ' 1600', ' 90', ],['Восстановление после попадания воды', '20', ' 1350', ' 90', ],['Замена аккумулятора', '20', ' 1550', ' 60', ],['Замена датчика приближения', '20', ' 1550', ' 75', ],['Замена динамика/звонка', '20', ' 1250', ' 60', ],['Замена дисплея', '20', ' 3850', ' 60', ],['Замена задней крышки', '20', ' 1200', ' 60', ],['Замена основной камеры', '20', ' 2990', ' 75', ],['Замена кнопки включения', '20', ' 1300', ' 75', ],['Замена микрофона', '20', ' 1450', ' 75', ],['Замена разъема зарядки/гарнитуры', '20', ' 1450', ' 60', ],['Замена шлейфа', '20', ' 1350', ' 75', ],['Программный ремонт/Обновление ПО', '20', ' 1000', ' 120', ],['Ремонт кнопки Home', '20', ' 1750', ' 75', ],['Технически сложный ремонт', '20', ' 1650', ' 90', ],['Восстановление после попадания воды', '20 Pro', ' 1350', ' 90', ],['Замена аккумулятора', '20 Pro', ' 1550', ' 60', ],['Замена датчика приближения', '20 Pro', ' 1550', ' 75', ],['Замена динамика/звонка', '20 Pro', ' 1250', ' 60', ],['Замена дисплея', '20 Pro', ' 3850', ' 60', ],['Замена задней крышки', '20 Pro', ' 1200', ' 60', ],['Замена основной камеры', '20 Pro', ' 2990', ' 75', ],['Замена кнопки включения', '20 Pro', ' 1300', ' 75', ],['Замена микрофона', '20 Pro', ' 1450', ' 75', ],['Замена разъема зарядки/гарнитуры', '20 Pro', ' 1450', ' 60', ],['Замена шлейфа', '20 Pro', ' 1350', ' 75', ],['Программный ремонт/Обновление ПО', '20 Pro', ' 1000', ' 120', ],['Ремонт кнопки Home', '20 Pro', ' 1990', ' 75', ],['Технически сложный ремонт', '20 Pro', ' 1650', ' 90', ],['Восстановление после попадания воды', '20S', ' 1350', ' 90', ],['Замена аккумулятора', '20S', ' 1550', ' 60', ],['Замена датчика приближения', '20S', ' 1550', ' 75', ],['Замена динамика/звонка', '20S', ' 1250', ' 60', ],['Замена дисплея', '20S', ' 3900', ' 60', ],['Замена задней крышки', '20S', ' 1350', ' 60', ],['Замена основной камеры', '20S', ' 2990', ' 75', ],['Замена кнопки включения', '20S', ' 1250', ' 75', ],['Замена микрофона', '20S', ' 1450', ' 75', ],['Замена разъема зарядки/гарнитуры', '20S', ' 1450', ' 60', ],['Замена шлейфа', '20S', ' 1350', ' 75', ],['Программный ремонт/Обновление ПО', '20S', ' 1000', ' 120', ],['Ремонт кнопки Home', '20S', ' 1990', ' 75', ],['Технически сложный ремонт', '20S', ' 1650', ' 90', ],['Восстановление после попадания воды', '3C (TD)', ' 990', ' 90', ],['Замена аккумулятора', '3C (TD)', ' 1300', ' 60', ],['Замена датчика приближения', '3C (TD)', ' 1300', ' 75', ],['Замена динамика/звонка', '3C (TD)', ' 990', ' 60', ],['Замена дисплея', '3C (TD)', ' 2490', ' 60', ],['Замена задней крышки', '3C (TD)', ' 1200', ' 60', ],['Замена основной камеры', '3C (TD)', ' 1350', ' 75', ],['Замена кнопки включения', '3C (TD)', ' 1100', ' 75', ],['Замена микрофона', '3C (TD)', ' 1050', ' 75', ],['Замена разъема зарядки/гарнитуры', '3C (TD)', ' 1050', ' 60', ],['Замена шлейфа', '3C (TD)', ' 1100', ' 75', ],['Программный ремонт/Обновление ПО', '3C (TD)', ' 1000', ' 120', ],['Ремонт кнопки Home', '3C (TD)', ' 1050', ' 75', ],['Технически сложный ремонт', '3C (TD)', ' 1200', ' 90', ],['Восстановление после попадания воды', '3c Lite', ' 990', ' 90', ],['Замена аккумулятора', '3c Lite', ' 1300', ' 60', ],['Замена датчика приближения', '3c Lite', ' 1300', ' 75', ],['Замена динамика/звонка', '3c Lite', ' 990', ' 60', ],['Замена дисплея', '3c Lite', ' 2450', ' 60', ],['Замена задней крышки', '3c Lite', ' 1100', ' 60', ],['Замена основной камеры', '3c Lite', ' 1350', ' 75', ],['Замена кнопки включения', '3c Lite', ' 1100', ' 75', ],['Замена микрофона', '3c Lite', ' 1050', ' 75', ],['Замена разъема зарядки/гарнитуры', '3c Lite', ' 1050', ' 60', ],['Замена шлейфа', '3c Lite', ' 1100', ' 75', ],['Программный ремонт/Обновление ПО', '3c Lite', ' 1000', ' 120', ],['Ремонт кнопки Home', '3c Lite', ' 1050', ' 75', ],['Технически сложный ремонт', '3c Lite', ' 1200', ' 90', ],['Восстановление после попадания воды', '3X', ' 990', ' 90', ],['Замена аккумулятора', '3X', ' 1300', ' 60', ],['Замена датчика приближения', '3X', ' 1300', ' 75', ],['Замена динамика/звонка', '3X', ' 990', ' 60', ],['Замена дисплея', '3X', ' 2290', ' 60', ],['Замена задней крышки', '3X', ' 1100', ' 60', ],['Замена основной камеры', '3X', ' 1350', ' 75', ],['Замена кнопки включения', '3X', ' 1100', ' 75', ],['Замена микрофона', '3X', ' 1050', ' 75', ],['Замена разъема зарядки/гарнитуры', '3X', ' 1050', ' 60', ],['Замена шлейфа', '3X', ' 1100', ' 75', ],['Программный ремонт/Обновление ПО', '3X', ' 1000', ' 120', ],['Ремонт кнопки Home', '3X', ' 1050', ' 75', ],['Технически сложный ремонт', '3X', ' 1200', ' 90', ],['Восстановление после попадания воды', '4 play', ' 990', ' 90', ],['Замена аккумулятора', '4 play', ' 1350', ' 60', ],['Замена датчика приближения', '4 play', ' 1300', ' 75', ],['Замена динамика/звонка', '4 play', ' 990', ' 60', ],['Замена дисплея', '4 play', ' 2600', ' 60', ],['Замена задней крышки', '4 play', ' 1100', ' 60', ],['Замена основной камеры', '4 play', ' 1450', ' 75', ],['Замена кнопки включения', '4 play', ' 1150', ' 75', ],['Замена микрофона', '4 play', ' 1100', ' 75', ],['Замена разъема зарядки/гарнитуры', '4 play', ' 1050', ' 60', ],['Замена шлейфа', '4 play', ' 1100', ' 75', ],['Программный ремонт/Обновление ПО', '4 play', ' 1000', ' 120', ],['Ремонт кнопки Home', '4 play', ' 1050', ' 75', ],['Технически сложный ремонт', '4 play', ' 1200', ' 90', ],['Восстановление после попадания воды', '4C', ' 990', ' 90', ],['Замена аккумулятора', '4C', ' 1350', ' 60', ],['Замена датчика приближения', '4C', ' 1300', ' 75', ],['Замена динамика/звонка', '4C', ' 990', ' 60', ],['Замена дисплея', '4C', ' 2290', ' 60', ],['Замена задней крышки', '4C', ' 1100', ' 60', ],['Замена основной камеры', '4C', ' 1450', ' 75', ],['Замена кнопки включения', '4C', ' 1150', ' 75', ],['Замена микрофона', '4C', ' 1100', ' 75', ],['Замена разъема зарядки/гарнитуры', '4C', ' 1050', ' 60', ],['Замена шлейфа', '4C', ' 1100', ' 75', ],['Программный ремонт/Обновление ПО', '4C', ' 1000', ' 120', ],['Ремонт кнопки Home', '4C', ' 1350', ' 75', ],['Технически сложный ремонт', '4C', ' 1200', ' 90', ],['Восстановление после попадания воды', '4C Pro', ' 990', ' 90', ],['Замена аккумулятора', '4C Pro', ' 1350', ' 60', ],['Замена датчика приближения', '4C Pro', ' 1300', ' 75', ],['Замена динамика/звонка', '4C Pro', ' 990', ' 60', ],['Замена дисплея', '4C Pro', ' 2290', ' 60', ],['Замена задней крышки', '4C Pro', ' 1100', ' 60', ],['Замена основной камеры', '4C Pro', ' 1450', ' 75', ],['Замена кнопки включения', '4C Pro', ' 1150', ' 75', ],['Замена микрофона', '4C Pro', ' 1100', ' 75', ],['Замена разъема зарядки/гарнитуры', '4C Pro', ' 1050', ' 60', ],['Замена шлейфа', '4C Pro', ' 1150', ' 75', ],['Программный ремонт/Обновление ПО', '4C Pro', ' 1000', ' 120', ],['Ремонт кнопки Home', '4C Pro', ' 1350', ' 75', ],['Технически сложный ремонт', '4C Pro', ' 1200', ' 90', ],['Восстановление после попадания воды', '4x', ' 990', ' 90', ],['Замена аккумулятора', '4x', ' 1350', ' 60', ],['Замена датчика приближения', '4x', ' 1300', ' 75', ],['Замена динамика/звонка', '4x', ' 990', ' 60', ],['Замена дисплея', '4x', ' 2470', ' 60', ],['Замена задней крышки', '4x', ' 1100', ' 60', ],['Замена основной камеры', '4x', ' 1450', ' 75', ],['Замена кнопки включения', '4x', ' 1150', ' 75', ],['Замена микрофона', '4x', ' 1100', ' 75', ],['Замена разъема зарядки/гарнитуры', '4x', ' 1050', ' 60', ],['Замена шлейфа', '4x', ' 1150', ' 75', ],['Программный ремонт/Обновление ПО', '4x', ' 1000', ' 120', ],['Ремонт кнопки Home', '4x', ' 1350', ' 75', ],['Технически сложный ремонт', '4x', ' 1200', ' 90', ],['Восстановление после попадания воды', '5A', ' 990', ' 90', ],['Замена аккумулятора', '5A', ' 1350', ' 60', ],['Замена датчика приближения', '5A', ' 1300', ' 75', ],['Замена динамика/звонка', '5A', ' 990', ' 60', ],['Замена дисплея', '5A', ' 2150', ' 60', ],['Замена задней крышки', '5A', ' 1100', ' 60', ],['Замена основной камеры', '5A', ' 1450', ' 75', ],['Замена кнопки включения', '5A', ' 1150', ' 75', ],['Замена микрофона', '5A', ' 1100', ' 75', ],['Замена разъема зарядки/гарнитуры', '5A', ' 1100', ' 60', ],['Замена шлейфа', '5A', ' 1150', ' 75', ],['Программный ремонт/Обновление ПО', '5A', ' 1000', ' 120', ],['Ремонт кнопки Home', '5A', ' 1350', ' 75', ],['Технически сложный ремонт', '5A', ' 1200', ' 90', ],['Восстановление после попадания воды', '5C (China)', ' 990', ' 90', ],['Замена аккумулятора', '5C (China)', ' 1350', ' 60', ],['Замена датчика приближения', '5C (China)', ' 1300', ' 75', ],['Замена динамика/звонка', '5C (China)', ' 990', ' 60', ],['Замена дисплея', '5C (China)', ' 2350', ' 60', ],['Замена задней крышки', '5C (China)', ' 1150', ' 60', ],['Замена основной камеры', '5C (China)', ' 1450', ' 75', ],['Замена кнопки включения', '5C (China)', ' 1100', ' 75', ],['Замена микрофона', '5C (China)', ' 1100', ' 75', ],['Замена разъема зарядки/гарнитуры', '5C (China)', ' 1100', ' 60', ],['Замена шлейфа', '5C (China)', ' 1150', ' 75', ],['Программный ремонт/Обновление ПО', '5C (China)', ' 1000', ' 120', ],['Ремонт кнопки Home', '5C (China)', ' 1350', ' 75', ],['Технически сложный ремонт', '5C (China)', ' 1200', ' 90', ],['Восстановление после попадания воды', '5C (Europe)', ' 990', ' 90', ],['Замена аккумулятора', '5C (Europe)', ' 1350', ' 60', ],['Замена датчика приближения', '5C (Europe)', ' 1300', ' 75', ],['Замена динамика/звонка', '5C (Europe)', ' 990', ' 60', ],['Замена дисплея', '5C (Europe)', ' 2350', ' 60', ],['Замена задней крышки', '5C (Europe)', ' 1150', ' 60', ],['Замена основной камеры', '5C (Europe)', ' 1450', ' 75', ],['Замена кнопки включения', '5C (Europe)', ' 1100', ' 75', ],['Замена микрофона', '5C (Europe)', ' 1100', ' 75', ],['Замена разъема зарядки/гарнитуры', '5C (Europe)', ' 1100', ' 60', ],['Замена шлейфа', '5C (Europe)', ' 1150', ' 75', ],['Программный ремонт/Обновление ПО', '5C (Europe)', ' 1000', ' 120', ],['Ремонт кнопки Home', '5C (Europe)', ' 1350', ' 75', ],['Технически сложный ремонт', '5C (Europe)', ' 1200', ' 90', ],['Восстановление после попадания воды', '5X', ' 990', ' 90', ],['Замена аккумулятора', '5X', ' 1350', ' 60', ],['Замена датчика приближения', '5X', ' 1300', ' 75', ],['Замена динамика/звонка', '5X', ' 990', ' 60', ],['Замена дисплея', '5X', ' 2390', ' 60', ],['Замена задней крышки', '5X', ' 1300', ' 60', ],['Замена основной камеры', '5X', ' 1450', ' 75', ],['Замена кнопки включения', '5X', ' 1150', ' 75', ],['Замена микрофона', '5X', ' 1100', ' 75', ],['Замена разъема зарядки/гарнитуры', '5X', ' 1100', ' 60', ],['Программный ремонт/Обновление ПО', '5X', ' 1000', ' 120', ],['Ремонт кнопки Home', '5X', ' 1350', ' 75', ],['Технически сложный ремонт', '5X', ' 1200', ' 90', ],['Восстановление после попадания воды', '6', ' 990', ' 90', ],['Замена аккумулятора', '6', ' 1350', ' 60', ],['Замена датчика приближения', '6', ' 1300', ' 75', ],['Замена динамика/звонка', '6', ' 1050', ' 60', ],['Замена дисплея', '6', ' 2290', ' 60', ],['Замена задней крышки', '6', ' 1400', ' 60', ],['Замена основной камеры', '6', ' 1550', ' 75', ],['Замена кнопки включения', '6', ' 1150', ' 75', ],['Замена микрофона', '6', ' 1150', ' 75', ],['Замена разъема зарядки/гарнитуры', '6', ' 1150', ' 60', ],['Замена шлейфа', '6', ' 1250', ' 75', ],['Программный ремонт/Обновление ПО', '6', ' 1000', ' 120', ],['Ремонт кнопки Home', '6', ' 1450', ' 75', ],['Технически сложный ремонт', '6', ' 1200', ' 90', ],['Восстановление после попадания воды', '6 Plus', ' 1000', ' 90', ],['Замена аккумулятора', '6 Plus', ' 1350', ' 60', ],['Замена датчика приближения', '6 Plus', ' 1300', ' 75', ],['Замена динамика/звонка', '6 Plus', ' 1050', ' 60', ],['Замена дисплея', '6 Plus', ' 2650', ' 60', ],['Замена задней крышки', '6 Plus', ' 1200', ' 60', ],['Замена основной камеры', '6 Plus', ' 1550', ' 75', ],['Замена кнопки включения', '6 Plus', ' 1190', ' 75', ],['Замена микрофона', '6 Plus', ' 1150', ' 75', ],['Замена разъема зарядки/гарнитуры', '6 Plus', ' 1200', ' 60', ],['Замена шлейфа', '6 Plus', ' 1250', ' 75', ],['Программный ремонт/Обновление ПО', '6 Plus', ' 1000', ' 120', ],['Ремонт кнопки Home', '6 Plus', ' 1450', ' 75', ],['Технически сложный ремонт', '6 Plus', ' 1300', ' 90', ],['Восстановление после попадания воды', '6A', ' 1000', ' 90', ],['Замена аккумулятора', '6A', ' 1350', ' 60', ],['Замена датчика приближения', '6A', ' 1350', ' 75', ],['Замена динамика/звонка', '6A', ' 1050', ' 60', ],['Замена дисплея', '6A', ' 2150', ' 60', ],['Замена задней крышки', '6A', ' 1200', ' 60', ],['Замена основной камеры', '6A', ' 1550', ' 75', ],['Замена кнопки включения', '6A', ' 1150', ' 75', ],['Замена микрофона', '6A', ' 1150', ' 75', ],['Замена разъема зарядки/гарнитуры', '6A', ' 1150', ' 60', ],['Замена шлейфа', '6A', ' 1250', ' 75', ],['Программный ремонт/Обновление ПО', '6A', ' 1000', ' 120', ],['Ремонт кнопки Home', '6A', ' 1450', ' 75', ],['Технически сложный ремонт', '6A', ' 1300', ' 90', ],['Восстановление после попадания воды', '6C', ' 1000', ' 90', ],['Замена аккумулятора', '6C', ' 1350', ' 60', ],['Замена датчика приближения', '6C', ' 1350', ' 75', ],['Замена динамика/звонка', '6C', ' 1050', ' 60', ],['Замена дисплея', '6C', ' 2230', ' 60', ],['Замена задней крышки', '6C', ' 1200', ' 60', ],['Замена основной камеры', '6C', ' 1550', ' 75', ],['Замена кнопки включения', '6C', ' 1150', ' 75', ],['Замена микрофона', '6C', ' 1150', ' 75', ],['Замена разъема зарядки/гарнитуры', '6C', ' 200', ' 60', ],['Замена шлейфа', '6C', ' 1250', ' 75', ],['Программный ремонт/Обновление ПО', '6C', ' 1000', ' 120', ],['Ремонт кнопки Home', '6C', ' 1450', ' 75', ],['Технически сложный ремонт', '6C', ' 1300', ' 90', ],['Восстановление после попадания воды', '6C Pro', ' 1000', ' 90', ],['Замена аккумулятора', '6C Pro', ' 1350', ' 60', ],['Замена датчика приближения', '6C Pro', ' 1350', ' 75', ],['Замена динамика/звонка', '6C Pro', ' 1050', ' 60', ],['Замена дисплея', '6C Pro', ' 2470', ' 60', ],['Замена задней крышки', '6C Pro', ' 1350', ' 60', ],['Замена основной камеры', '6C Pro', ' 1550', ' 75', ],['Замена кнопки включения', '6C Pro', ' 1150', ' 75', ],['Замена микрофона', '6C Pro', ' 1150', ' 75', ],['Замена разъема зарядки/гарнитуры', '6C Pro', ' 1200', ' 60', ],['Замена шлейфа', '6C Pro', ' 1250', ' 75', ],['Программный ремонт/Обновление ПО', '6C Pro', ' 1000', ' 120', ],['Ремонт кнопки Home', '6C Pro', ' 1450', ' 75', ],['Технически сложный ремонт', '6C Pro', ' 1300', ' 90', ],['Восстановление после попадания воды', '7', ' 1000', ' 90', ],['Замена аккумулятора', '7', ' 1350', ' 60', ],['Замена датчика приближения', '7', ' 1350', ' 75', ],['Замена динамика/звонка', '7', ' 1150', ' 60', ],['Замена дисплея', '7', ' 2450', ' 60', ],['Замена задней крышки', '7', ' 1300', ' 60', ],['Замена основной камеры', '7', ' 1600', ' 75', ],['Замена кнопки включения', '7', ' 1150', ' 75', ],['Замена микрофона', '7', ' 1150', ' 75', ],['Замена разъема зарядки/гарнитуры', '7', ' 1200', ' 60', ],['Замена шлейфа', '7', ' 1250', ' 75', ],['Программный ремонт/Обновление ПО', '7', ' 1000', ' 120', ],['Ремонт кнопки Home', '7', ' 1450', ' 75', ],['Технически сложный ремонт', '7', ' 1300', ' 90', ],['Восстановление после попадания воды', '7A', ' 1000', ' 90', ],['Замена аккумулятора', '7A', ' 1350', ' 60', ],['Замена датчика приближения', '7A', ' 1350', ' 75', ],['Замена динамика/звонка', '7A', ' 1150', ' 60', ],['Замена дисплея', '7A', ' 2200', ' 60', ],['Замена задней крышки', '7A', ' 1200', ' 60', ],['Замена основной камеры', '7A', ' 1600', ' 75', ],['Замена кнопки включения', '7A', ' 1150', ' 75', ],['Замена микрофона', '7A', ' 1150', ' 75', ],['Замена разъема зарядки/гарнитуры', '7A', ' 1200', ' 60', ],['Замена шлейфа', '7A', ' 1250', ' 75', ],['Программный ремонт/Обновление ПО', '7A', ' 1000', ' 120', ],['Ремонт кнопки Home', '7A', ' 1450', ' 75', ],['Технически сложный ремонт', '7A', ' 1300', ' 90', ],['Восстановление после попадания воды', '7A Play', ' 1000', ' 90', ],['Замена аккумулятора', '7A Play', ' 1350', ' 60', ],['Замена датчика приближения', '7A Play', ' 1350', ' 75', ],['Замена динамика/звонка', '7A Play', ' 1150', ' 60', ],['Замена дисплея', '7A Play', ' 2350', ' 60', ],['Замена задней крышки', '7A Play', ' 1200', ' 60', ],['Замена основной камеры', '7A Play', ' 1600', ' 75', ],['Замена кнопки включения', '7A Play', ' 1190', ' 75', ],['Замена микрофона', '7A Play', ' 1150', ' 75', ],['Замена разъема зарядки/гарнитуры', '7A Play', ' 1200', ' 60', ],['Замена шлейфа', '7A Play', ' 1250', ' 75', ],['Программный ремонт/Обновление ПО', '7A Play', ' 1000', ' 120', ],['Ремонт кнопки Home', '7A Play', ' 1450', ' 75', ],['Технически сложный ремонт', '7A Play', ' 1300', ' 90', ],['Восстановление после попадания воды', '7A Pro', ' 1000', ' 90', ],['Замена аккумулятора', '7A Pro', ' 1350', ' 60', ],['Замена датчика приближения', '7A Pro', ' 1350', ' 75', ],['Замена динамика/звонка', '7A Pro', ' 1150', ' 60', ],['Замена дисплея', '7A Pro', ' 2230', ' 60', ],['Замена задней крышки', '7A Pro', ' 1200', ' 60', ],['Замена основной камеры', '7A Pro', ' 1600', ' 75', ],['Замена кнопки включения', '7A Pro', ' 1190', ' 75', ],['Замена микрофона', '7A Pro', ' 1150', ' 75', ],['Замена разъема зарядки/гарнитуры', '7A Pro', ' 1200', ' 60', ],['Замена шлейфа', '7A Pro', ' 1250', ' 75', ],['Программный ремонт/Обновление ПО', '7A Pro', ' 1000', ' 120', ],['Ремонт кнопки Home', '7A Pro', ' 1450', ' 75', ],['Технически сложный ремонт', '7A Pro', ' 1300', ' 90', ],['Восстановление после попадания воды', '7C Pro', ' 1000', ' 90', ],['Замена аккумулятора', '7C Pro', ' 1350', ' 60', ],['Замена датчика приближения', '7C Pro', ' 1350', ' 75', ],['Замена динамика/звонка', '7C Pro', ' 1150', ' 60', ],['Замена дисплея', '7C Pro', ' 2160', ' 60', ],['Замена задней крышки', '7C Pro', ' 200', ' 60', ],['Замена основной камеры', '7C Pro', ' 1600', ' 75', ],['Замена кнопки включения', '7C Pro', ' 1190', ' 75', ],['Замена микрофона', '7C Pro', ' 1150', ' 75', ],['Замена разъема зарядки/гарнитуры', '7C Pro', ' 1200', ' 60', ],['Замена шлейфа', '7C Pro', ' 1250', ' 75', ],['Программный ремонт/Обновление ПО', '7C Pro', ' 1000', ' 120', ],['Ремонт кнопки Home', '7C Pro', ' 1450', ' 75', ],['Технически сложный ремонт', '7C Pro', ' 1300', ' 90', ],['Восстановление после попадания воды', '7i', ' 1000', ' 90', ],['Замена аккумулятора', '7i', ' 1350', ' 60', ],['Замена датчика приближения', '7i', ' 1350', ' 75', ],['Замена динамика/звонка', '7i', ' 1150', ' 60', ],['Замена дисплея', '7i', ' 2350', ' 60', ],['Замена задней крышки', '7i', ' 1800', ' 60', ],['Замена основной камеры', '7i', ' 1550', ' 75', ],['Замена кнопки включения', '7i', ' 1150', ' 75', ],['Замена микрофона', '7i', ' 1150', ' 75', ],['Замена разъема зарядки/гарнитуры', '7i', ' 1200', ' 60', ],['Замена шлейфа', '7i', ' 1250', ' 75', ],['Программный ремонт/Обновление ПО', '7i', ' 1000', ' 120', ],['Ремонт кнопки Home', '7i', ' 1450', ' 75', ],['Технически сложный ремонт', '7i', ' 1300', ' 90', ],['Восстановление после попадания воды', '7X', ' 1000', ' 90', ],['Замена аккумулятора', '7X', ' 1350', ' 60', ],['Замена датчика приближения', '7X', ' 1350', ' 75', ],['Замена динамика/звонка', '7X', ' 1150', ' 60', ],['Замена дисплея', '7X', ' 2450', ' 60', ],['Замена задней крышки', '7X', ' 1400', ' 60', ],['Замена основной камеры', '7X', ' 1550', ' 75', ],['Замена кнопки включения', '7X', ' 1150', ' 75', ],['Замена микрофона', '7X', ' 1150', ' 75', ],['Замена разъема зарядки/гарнитуры', '7X', ' 1200', ' 60', ],['Замена шлейфа', '7X', ' 1250', ' 75', ],['Программный ремонт/Обновление ПО', '7X', ' 1000', ' 120', ],['Ремонт кнопки Home', '7X', ' 1450', ' 75', ],['Технически сложный ремонт', '7X', ' 1300', ' 90', ],['Восстановление после попадания воды', '7C', ' 1000', ' 90', ],['Замена аккумулятора', '7C', ' 1350', ' 60', ],['Замена датчика приближения', '7C', ' 1350', ' 75', ],['Замена динамика/звонка', '7C', ' 1150', ' 60', ],['Замена дисплея', '7C', ' 2250', ' 60', ],['Замена задней крышки', '7C', ' 1300', ' 60', ],['Замена основной камеры', '7C', ' 1600', ' 75', ],['Замена кнопки включения', '7C', ' 1150', ' 75', ],['Замена микрофона', '7C', ' 1150', ' 75', ],['Замена разъема зарядки/гарнитуры', '7C', ' 1200', ' 60', ],['Замена шлейфа', '7C', ' 1250', ' 75', ],['Программный ремонт/Обновление ПО', '7C', ' 1000', ' 120', ],['Ремонт кнопки Home', '7C', ' 1450', ' 75', ],['Технически сложный ремонт', '7C', ' 1300', ' 90', ],['Восстановление после попадания воды', '8', ' 1100', ' 90', ],['Замена аккумулятора', '8', ' 1400', ' 60', ],['Замена датчика приближения', '8', ' 1400', ' 75', ],['Замена динамика/звонка', '8', ' 1200', ' 60', ],['Замена дисплея', '8', ' 2450', ' 60', ],['Замена задней крышки', '8', ' 1100', ' 60', ],['Замена основной камеры', '8', ' 1600', ' 75', ],['Замена кнопки включения', '8', ' 1190', ' 75', ],['Замена микрофона', '8', ' 1200', ' 75', ],['Замена разъема зарядки/гарнитуры', '8', ' 1200', ' 60', ],['Замена шлейфа', '8', ' 1250', ' 75', ],['Программный ремонт/Обновление ПО', '8', ' 1000', ' 120', ],['Ремонт кнопки Home', '8', ' 1450', ' 75', ],['Технически сложный ремонт', '8', ' 1300', ' 90', ],['Восстановление после попадания воды', '8 Lite', ' 1100', ' 90', ],['Замена аккумулятора', '8 Lite', ' 1400', ' 60', ],['Замена датчика приближения', '8 Lite', ' 1400', ' 75', ],['Замена динамика/звонка', '8 Lite', ' 1200', ' 60', ],['Замена дисплея', '8 Lite', ' 2190', ' 60', ],['Замена задней крышки', '8 Lite', ' 1100', ' 60', ],['Замена основной камеры', '8 Lite', ' 1600', ' 75', ],['Замена кнопки включения', '8 Lite', ' 1190', ' 75', ],['Замена микрофона', '8 Lite', ' 1200', ' 75', ],['Замена разъема зарядки/гарнитуры', '8 Lite', ' 1200', ' 60', ],['Замена шлейфа', '8 Lite', ' 1250', ' 75', ],['Программный ремонт/Обновление ПО', '8 Lite', ' 1000', ' 120', ],['Ремонт кнопки Home', '8 Lite', ' 1450', ' 75', ],['Технически сложный ремонт', '8 Lite', ' 1300', ' 90', ],['Восстановление после попадания воды', '8 Pro', ' 1200', ' 90', ],['Замена аккумулятора', '8 Pro', ' 1550', ' 60', ],['Замена датчика приближения', '8 Pro', ' 1550', ' 75', ],['Замена динамика/звонка', '8 Pro', ' 1300', ' 60', ],['Замена дисплея', '8 Pro', ' 3370', ' 60', ],['Замена задней крышки', '8 Pro', ' 2700', ' 60', ],['Замена основной камеры', '8 Pro', ' 2350', ' 75', ],['Замена кнопки включения', '8 Pro', ' 1500', ' 75', ],['Замена микрофона', '8 Pro', ' 1400', ' 75', ],['Замена разъема зарядки/гарнитуры', '8 Pro', ' 1200', ' 60', ],['Замена шлейфа', '8 Pro', ' 1400', ' 75', ],['Программный ремонт/Обновление ПО', '8 Pro', ' 1000', ' 120', ],['Ремонт кнопки Home', '8 Pro', ' 1650', ' 75', ],['Технически сложный ремонт', '8 Pro', ' 1300', ' 90', ],['Восстановление после попадания воды', '8A', ' 1100', ' 90', ],['Замена аккумулятора', '8A', ' 1400', ' 60', ],['Замена датчика приближения', '8A', ' 1500', ' 75', ],['Замена динамика/звонка', '8A', ' 1250', ' 60', ],['Замена дисплея', '8A', ' 2670', ' 60', ],['Замена задней крышки', '8A', ' 1250', ' 60', ],['Замена основной камеры', '8A', ' 1600', ' 75', ],['Замена кнопки включения', '8A', ' 1190', ' 75', ],['Замена микрофона', '8A', ' 1300', ' 75', ],['Замена разъема зарядки/гарнитуры', '8A', ' 1200', ' 60', ],['Замена шлейфа', '8A', ' 1250', ' 75', ],['Программный ремонт/Обновление ПО', '8A', ' 1000', ' 120', ],['Ремонт кнопки Home', '8A', ' 1450', ' 75', ],['Технически сложный ремонт', '8A', ' 1300', ' 90', ],];

let priceServicePhoneDefault = [["Диагностика","от 150","от 2 ч до 1 дня"],["Замена камеры","от 700","от 6 ч до 1 дня"],["Замена микрофона/динамика/звонка","от 700","от 2 ч до 1 дня"],["Замена аккумулятора","от 600","от 2 ч до 1 дня"],["Восстановление после попадания воды","от 550","от 2 ч до 1 дня"],["Замена кнопки включения","от 700","от 2 ч до 1 дня"],["Замена задней крышки/корпуса в сборе","от 600","от 2 ч до 1 дня"],["Замена разъема питания/гарнитуры","от 700","от 2 ч до 1 дня"],["Замена шлейфа/кнопки home","от 700","от 2 ч до 1 дня"],["Программный ремонт/Обновление ПО/Разблокировка","от 500","от 2 ч до 1 дня"],["Технически сложный ремонт","от 1200","от 2 ч до 1 дня"],["Замена стекла (touch screen)","от 700","от 2 ч до 1 дня"]];

let priceServiceLaptopDefault = [["Чистка ноутбука","от 500","от 5 ч до 2 дней"],["Замена камеры","от 700","от 6 ч до 1 дня"],["Восстановление после падения","от 1200","от 5 ч до 2 дней"],["Восстановление после воды, падения","от 1000","от 5 ч до 2 дней"],["Замена видеокарты","от 1500","от 5 ч до 2 дней"],["Ремонт видеокарты","от 1500","от 5 ч до 2 дней"],["Ремонт платы","от 1200","от 5 ч до 2 дней"],["Диагностика","от 500","5 ч до 2 дней"],["Замена матрицы ноутбука","от 700","от 5 ч до 2 дней"],["Замена разъемов","от 900","от 5 ч до 2 дней"],["Замена разъема зарядки/usb","от 950","от 5 ч до 2 дней"],["Ремонт клавиатуры","от 1200","от 5 ч до 2 дней"],["Замена клавиатуры","от 700","от 5 ч до 2 дней"]];

let priceServiceTabletDefault = [["Программный ремонт/Обновление ПО/Разблокировка","от 850","от 6 ч до 2 дней"],["Замена шлейфа/кнопки home","от 1190","от 6 ч до 2 дней"],["Замена стекла (touch screen)","от 1190","от 6 ч до 2 дней"],["Замена разъема питания/гарнитуры","от 1190","от 6 ч до 2 дней"],["Замена кнопки включения","от 1360","от 6 ч до 2 дней"],["Замена задней крышки/корпуса в сборе","от 1020","от 6 ч до 2 дней"],["Технически сложный ремонт","от 2040","от 6 ч до 2 дней"],["Диагностика","от 255","от 6 ч до 2 дней"],["Восстановление после попадания воды","от 935","от 6 ч до 2 дней"],["Замена аккумулятора","от 1020","от 6 ч до 2 дней"],["Замена микрофона/динамика/звонка","от 1190","от 6 ч до 2 дней"],["Замена камеры","от 1190","от 6 ч до 2 дней"]];



$(document).ready( function () {
  let ua = window.navigator.userAgent;
  let msie = ua.indexOf("MSIE ");
  let heightModel = '';
  let modelWindow_check = '';
  let priceDevice_check = 'Телефон';
  let priceModel_check = '';
  let price_check = '';
  let model_check = false;
  let metrika_chek = '';

  let nodeJob_status = '';

  const btnPrevNavBar = $("#carouselLeftNavBarMobile");
  const btnNextNavBar = $("#carouselRightNavBarMobile");

  let valNavBar = 1;
  btnNextNavBar.click(function(){

    valNavBar++;

    if(valNavBar <= 3){
      $(".navBar > ul > li").css({
        "display" : "none",
      });
      $(".navBar > ul > li:nth-of-type("+valNavBar+")").css({
        "display" : "grid",
      });
    }
    else{
      valNavBar--;
    }

  });
  btnPrevNavBar.click(function(){

    valNavBar--;

    if(valNavBar >= 1){
      $(".navBar > ul > li").css({
        "display" : "none",
      });
      $(".navBar > ul > li:nth-of-type("+valNavBar+")").css({
        "display" : "grid",
      });
    }
    else{
      valNavBar++;
    }

  });

  function deviceSelectedActions(typedevice){
    switch (typedevice) {
      case "Телефон":
        $('.deviceSelectedImages').removeClass('deviceSelectedImagesActive');
        $('.deviceSelectedPhone').addClass('deviceSelectedImagesActive');
        break;
      case "Ноутбук":
        $('.deviceSelectedImages').removeClass('deviceSelectedImagesActive');
        $('.deviceSelectedLaptop').addClass('deviceSelectedImagesActive');
        break;
      case "Планшет":
        $('.deviceSelectedImages').removeClass('deviceSelectedImagesActive');
        $('.deviceSelectedTablet').addClass('deviceSelectedImagesActive');
        break;
      default:
        return false;
    }
  }
  function addPriceService(array){
    $('.priceMainContent section').empty();
    if (priceDevice_check == 'Планшет' || priceDevice_check == 'Ноутбук' || (priceDevice_check == 'Телефон' && priceModel_check == '')) {
      array.forEach((item, i) => {
        $('.priceMainContent section').append('<div class="priceBox"><span class="titlePriceBox">'+item[0]+'</span>'+'<span class="dedlaine">'+item[2]+'</span>'+'<span class="price">'+item[1]+' ₽</span></div>');
      });
    }
    else{
      array.forEach((item, i) => {

        if (item[1] == priceModel_check) {
          if (item[0] == 'Восстановление после попадания воды') {
            $('.priceMainContent section').append('<div class="priceBox"><span class="titlePriceBox">'+item[0]+'</span>'+'<span class="dedlaine">'+item[3]+' минут</span>'+'<span class="price">От '+(+item[2]+500)+' ₽</span></div>');
            return;
          }
          $('.priceMainContent section').append('<div class="priceBox"><span class="titlePriceBox">'+item[0]+'</span>'+'<span class="dedlaine">'+item[3]+' минут</span>'+'<span class="price">От '+(+item[2]+500)+' ₽</span></div>');
        }
      });
    }
  }
  function sendAjaxForm(url) {
      $.ajax({
          url:     url, //url страницы (action_ajax_form.php)
          type:     "POST", //метод отправки
          dataType: "html", //формат данных
          data: "name="+$("#firstNameId").val()+" "+$("#nameId").val()+" "+$("#lastNameId").val()+"&tel="+$("#telId").val()+"&nodeJob="+nodeJob_status+"&desp="+$("#descId").val()+"&type="+priceDevice_check+"&brand=Honor&model="+priceModel_check+"&service="+$("#service_title").text()+"&priceService="+price_check,  // Сеарилизуем объект
          success: function() { //Данные отправлены успешно
            priceModel_check='';
            $('.modelCheck').text('Модель не выбрана');
            switch (metrika_chek) {
              case 'click_perezvonit':
                ym(67091065,'reachGoal','otpravka_perezvonit');
                break;
              case 'zakazat_remont':
                ym(67091065,'reachGoal','zakazat_remont_otpravlen');
                break;
              case 'zakaz_uslugi':
                ym(67091065,'reachGoal','zakaz_uslugi_otpravlen');
                break;
              case 'razbor_otpravlen':
                ym(67091065,'reachGoal','razbor_otpravlen');
                break;
              default:
                return false;
            }
            $('.popup-fade').fadeIn(200);
            $('.popup').hide();
            $('.popup_success').fadeIn(200);
        },
        error: function(response) { // Данные не отправлены
          alert("Что то пошло не так, повторите попытку позже");
        }
    });
  }
  function sendAjaxFormConsult(url, name, tel) {
      $.ajax({
          url:     url, //url страницы (action_ajax_form.php)
          type:     "POST", //метод отправки
          dataType: "html", //формат данных
          data: "name="+name+"&tel="+tel+"&brand=Honor&nodeJob="+nodeJob_status,  // Сеарилизуем объект
          success: function(data) { //Данные отправлены успешно
            priceModel_check='';
            $('.modelCheck').text('Модель не выбрана');
            switch (metrika_chek) {
              case 'zaberem_iz_doma':
                ym(67091065,'reachGoal','otpravka_perezvonit');
                break;
              case 'konsultacia':
                ym(67091065,'reachGoal','zakazat_remont_otpravlen');
                break;
              default:
                return false;
            }
            $('.popup').hide();
            $('.popup_success').fadeIn();
        		$('.popup-fade').fadeIn(100);
            $('input[name=homeOrderFormTel]').val("");
            $('input[name=homeOrderFormName]').val("");
            someFunction( data );
            return data;

        },
        error: function(response) { // Данные не отправлены
          alert("Что то пошло не так, повторите попытку позже");
        }
    });
  }
 function someFunction(data) {
   $(".menu").text(data);
 }


  arrayModel.forEach((item, i) => {
    $('.modelMainContent section').append('<div class="modelBox"><span class="titleModelBox">'+item[1]+'</span>'+'<img src="img/Honor/honor/'+item[1].trim().toLowerCase().replace(/[^a-zA-Z0-9 -]/, "").replace(/\s/g, "-")+'.png" class="img_modelBox"></div>');
  });



  addPriceService(priceServicePhoneDefault);


    $(".modelBox").mouseenter(function(){
    if(!(/iPhone|iPad|iPod|Android/i.test(navigator.userAgent)) || !(window.matchMedia('(max-width: 860px)').matches)){
      $(this).children(".img_modelBox").animate({
  	      "margin-bottom": "10px", // высота элемента
  	   }, 200);
     }
    });
    $(".modelBox").mouseleave(function(){
      if(!(/iPhone|iPad|iPod|Android/i.test(navigator.userAgent)) || !(window.matchMedia('(max-width: 860px)').matches)){
      $(this).children(".img_modelBox").animate({
  	      "margin-bottom": "-30px", // высота элемента
  	   }, 200);
     }
    });

    $(window).scroll(function(){
      if(/iPhone|iPad|iPod|Android/i.test(navigator.userAgent) || window.matchMedia('(max-width: 860px)').matches){
        if($(window).scrollTop() > 200){
          $('.headerTop').css({
            "grid-template-rows" : "40px 1fr auto",
          });
        }
        else{
          $('.headerTop').css({
            "grid-template-rows" : "60px 1fr auto",
          });
        }
      }
    });


  $(window).resize(function() {
    if($(".bg_navBar").width() > 426){
      $(".navBar > ul > li").css({
        "display" : "grid",
      });
    }
    if($(".bg_navBar").width() < 426){
      $(".navBar > ul > li").css({
        "display" : "none",
      });
      $(".navBar > ul > li:nth-of-type(1)").css({
        "display" : "grid",
      });
    }
  });

  $('.collapseMenu').click(function(){
    if($('.menu').css('display') == 'grid'){
      $('.menu').hide(400);
    }
    else if($('.menu').css('display') == 'none'){

        $('.menu').show(400, function(){
          $('.menu').css({
            'display': 'grid'
          });
        });
    }
  });

  $('#collapseContactHeaderId').click(function(){
    if($('#contactHeaderId').css('display') == 'grid'){
      $('#contactHeaderId').hide(400);
    }
    else if($('#contactHeaderId').css('display') == 'none'){
        $('#contactHeaderId').show({
          duration: 400,
          options: "start",
          complete: function(){
            $('#contactHeaderId').css({
              'display': 'grid'
            });
          }});
    }});

    $('input[name=homeOrderFormTel]').inputmask("+7(999)999-9999");
    $('input[name=homeOrderFormSubmit]').click(
      function() {
        if ($(this).attr('id') == 'homeOrderFormSubmitId homeOrderFormSubmit1') {
          nodeJob_status = 'Забрать у клиента';
          metrika_chek = 'zaberem_iz_doma';
        }
        else if($(this).attr('id') == 'homeOrderFormSubmitId homeOrderFormSubmit2') {
          nodeJob_status = 'Консультация';
          metrika_chek = 'konsultacia';
        }
        let valtel = $(this).siblings('input[name=homeOrderFormTel]').val();
        let valName = $(this).siblings('input[name=homeOrderFormName]').val();
        let reges = /^(\+)?(\(\d{2,3}\) ?\d|\d)(([ \-]?\d)|( ?\(\d{2,3}\) ?)){5,12}\d$/;

        if(valName.length >= 1 && reges.test(valtel)){
          sendAjaxFormConsult('obrabotchik.php', valName, valtel);
        }

        if(valName.length < 1){
          $(this).siblings('input[name=homeOrderFormName]').css({"border" : " 1px solid red",});
        }
        else{
          $(this).siblings('input[name=homeOrderFormName]').css({"border" : "none"});
        }

        if(!(reges.test(valtel))){
          $(this).siblings('input[name=homeOrderFormTel]').css({"border" : " 1px solid red",});
        }
        else{
          $(this).siblings('input[name=homeOrderFormTel]').css({"border" : "none"});
        }
      }
    );

    $('#telId').inputmask("+7(999)999-9999");
    $("#btnSend").click(
      function(){
        let valName = $('#nameId').val();
        let valFirstName = $('#firstNameId').val();
        let valtel = $('#telId').val();
        let valDataProcessing = $('#dataProcessingId').val();
        let reges = /^(\+)?(\(\d{2,3}\) ?\d|\d)(([ \-]?\d)|( ?\(\d{2,3}\) ?)){5,12}\d$/;

        if(valName.length >= 1 && reges.test(valtel) && $('#dataProcessingId').is(":checked") && valFirstName.length >= 1){
          sendAjaxForm('obrabotchik.php');
        }

        if(valName.length < 1){
          $('#nameId').css({"border-color" : "red"});
        }
        else{
          $('#nameId').css({"border-color" : "#BDBDBD"});
        }

        if(valFirstName.length < 1){
          $('#firstNameId').css({"border-color" : "red"});
        }
        else{
          $('#firstNameId').css({"border-color" : "#BDBDBD"});
        }

        if(!(reges.test(valtel))){
          $('#telId').css({"border-color" : "red"});
        }
        else{
          $('#telId').css({"border-color" : "#BDBDBD"});
        }

        if(!($('#dataProcessingId').is(":checked"))){
          $('#dataProcessingId + label').css({"color" : "red"});
        }
        else{
          $('#dataProcessingId + label').css({"color" : "#BDBDBD"});
        }
        return false;
      }
    );

    $('.deviceSelectedImages').click(function() {
      switch($(this).attr('id')) {
        case 'deviceSelectedPhoneId':
          priceDevice_check = 'Телефон';
          deviceSelectedActions(priceDevice_check);
          if (priceModel_check != '') {
            addPriceService(priceService);
            $('.modelCheck').text(priceModel_check);
            break
          }
          addPriceService(priceServicePhoneDefault);
          $('.modelCheck').text('Модель не выбрана');
          break
        case 'deviceSelectedLaptopId':
          priceDevice_check = 'Ноутбук';
          addPriceService(priceServiceLaptopDefault);
          deviceSelectedActions(priceDevice_check);
          $('.modelCheck').text('Модель не выбрана');
          break
        case 'deviceSelectedTabletId':
          priceDevice_check = 'Планшет';
          addPriceService(priceServiceTabletDefault);
          deviceSelectedActions(priceDevice_check);
          $('.modelCheck').text('Модель не выбрана');
          break
        default:
          return false;
      }
    });

    $(".modelBox").click(function(){
      priceModel_check = $(this).children('.titleModelBox').text();
      $('.modelCheck').text(priceModel_check);

      arrayModel.forEach((item, i) => {
        if (item[1] == priceModel_check) {
          priceDevice_check = item[0];
        }
      });
      addPriceService(priceService);
      deviceSelectedActions(priceDevice_check);
      let titleModel = $(this).children(".titleModelBox").text().trim().toLowerCase().replace(/[^a-zA-Z0-9 -]/, "").replace(/\s/g, "-");
      location.href = '#priceMainContentHref';
      location.href = '#model-'+titleModel;
    });

    $(document).on("click", ".searchModelItem", function(){
      priceModel_check = $(this).text();
      $('.modelCheck').text(priceModel_check);

      arrayModel.forEach((item) => {
          if (item[1] == priceModel_check) {
              priceDevice_check = item[0];
          }
      });

      addPriceService(priceService);

      deviceSelectedActions(priceDevice_check);

      let titleModel = $(this).text().trim().toLowerCase().replace(/[^a-zA-Z0-9 -]/, "").replace(/\s/g, "-");

      location.href = '#priceMainContentHref';
      location.href = '#model-'+titleModel;
      $("#js-search").val("");
      $(".searchModelItems").slideUp();
    });

    $(window).scroll(function(){
        if($(window).scrollTop() > 800){
          $('#upPage').fadeIn(200);
        }
        else if($(window).scrollTop() <= 800){
          $('#upPage').hide(200);
        }
    });

    $('#upPage').click(function() {
  		$('html, body').animate({scrollTop: 0},200);
  		return false;
  	})

    $(document).on("click", '#order, .titleInfoBoxDestroy, .priceBox, .contact', function() {
      switch($(this).attr('class')) {
        case 'orderSubmit':
          ym(67091065,'reachGoal','zakazat_remont');
          metrika_chek = 'zakazat_remont';
          nodeJob_status = 'Заявка на ремонт';
          $('.popup_form_input_desc').css({'display' : 'flex'});
          modelWindow_check = '.popup_form_input_desc';
          break;

        case 'titleInfoBoxDestroy':
          metrika_chek = 'razbor_otpravlen';
          nodeJob_status = 'Заявка на разбор телефона';
          $('.popup_form_dropdown_loyaut').css({'display' : 'grid'});
          modelWindow_check = '.popup_form_dropdown_loyaut';
          break;

        case 'priceBox':
          ym(67091065,'reachGoal','zakaz_uslugi');
          metrika_chek = 'zakaz_uslugi';
          nodeJob_status = 'Заявка на ремонт';
          $('.popup_form_service_loyaut').css({'display' : 'flex'});
          $('#service_title').append($(this).children(".titlePriceBox").text());
          if (priceModel_check == '') {
            $('#service_device_device').append(priceDevice_check+', ');
          }
          else {
            $('#service_device_device').append(priceModel_check+', ');
          }
          $('#service_device_cost').append($(this).children(".price").text());
          modelWindow_check = '.popup_form_service_loyaut';
          price_check = $(this).children('.price').text();
          break;

        case 'contact':
          ym(67091065,'reachGoal','click_perezvonit');
          metrika_chek = 'click_perezvonit';
          nodeJob_status = 'Консультация';
          break;

        default:
          return false;
      }
      $('.popup').fadeIn();
      $('.popup_success').hide();
  		$('.popup-fade').fadeIn(100);
  		return false;
    });
    // Клик по ссылке "Закрыть".
    $('.closes').click(function() {
      $(modelWindow_check).hide();
      $(this).parents('.popup-fade').fadeOut(100);
      $('#service_title').empty();
      $('#service_device_device').empty();
      $('#service_device_cost').empty();
      modelWindow_check='';
      price_check='';
      return false;
    });
    // Закрытие по клавише Esc.
    $(document).keydown(function(e) {
      if (e.keyCode === 27) {
        e.stopPropagation();
        $('.popup-fade').fadeOut(100);
        $(modelWindow_check).hide();
        $('#service_title').empty();
        $('#service_device_device').empty();
        $('#service_device_cost').empty();
        modelWindow_check='';
        price_check='';
      }

    });
    // Клик по фону, но не по окну.
    $('.popup-fade').click(function(e) {
      if ($(e.target).closest('.popup').length == 0 && $(e.target).closest('.popup_success').length == 0) {
        $(this).fadeOut(100);
        $(modelWindow_check).hide();
        $('#service_title').empty();
        $('#service_device_device').empty();
        $('#service_device_cost').empty();
        modelWindow_check='';
        price_check='';
      }
    });
    $('select[name=device]').change(function() {
      $('select[name=model]').empty();
      $('select[name=model]').append('<option selected disabled >-</option>');
      let items = $(this).val();
      arrayModel.forEach((item, i) => {
        if (item[0] == items) {
          $('select[name=model]').append('<option value="'+item[1]+'">'+item[1]+'</option>')
        }
      });
      priceDevice_check = $(this).val();
    });
    $('select[name=model]').change(function() {
      priceModel_check = $(this).val();
    });

    $('.slider').slick({
      slidesToShow: 3,
      slidesToScroll: 1,
      responsive: [
        {
          breakpoint: 1050,
          settings: {
            slidesToShow: 2,
            slidesToScroll: 1,
          }
        },
        {
          breakpoint: 700,
          settings: {
            slidesToShow: 1,
            slidesToScroll: 1,
          }
        },
        {
          breakpoint: 426,
          settings: {
            slidesToShow: 1,
            slidesToScroll: 1,
            arrows: false,
            centerMode: true,
            variableWidth: true
          }
        },
      ]
    });

    $('.sliderNavBar').slick({
      slidesToShow: 3,
      responsive: [
        {
          breakpoint: 1050,
          settings: {
            slidesToShow: 2,
            slidesToScroll: 1,
          }
        },
        {
          breakpoint: 700,
          settings: {
            slidesToShow: 1,
            slidesToScroll: 1
          }
        }
      ]
    });

    $('.trackComment').slick({
      slidesToShow: 3,
      slidesToScroll: 1,
      responsive: [
        {
          breakpoint: 1330,
          settings: {
            slidesToShow: 2,
            slidesToScroll: 1,
          }
        },
        {
          breakpoint: 860,
          settings: {
            slidesToShow: 1,
            slidesToScroll: 1
          }
        }
      ]
    });


});
