let arrayModel = [['Телефон', 'Y9 (2018)'],['Телефон', 'Y7 2019'],['Телефон', 'Y6 Pro'],['Телефон', 'Y6 Prime (2018)'],['Телефон', 'Y6 II'],['Телефон', 'Y6 2019'],['Телефон', 'Y6'],['Телефон', 'Y5C'],['Телефон', 'Y5 II'],['Телефон', 'Y5 2018'],['Телефон', 'Y5 (2017)'],['Телефон', 'Y3C'],['Телефон', 'Y3 II 4G'],['Телефон', 'Y3 II'],['Телефон', 'Y3 2017'],['Телефон', 'P9 Plus'],['Телефон', 'P9 Lite'],['Телефон', 'P9'],['Телефон', 'P8 Max'],['Телефон', 'P8 Lite (2017)'],['Телефон', 'P8 Lite'],['Телефон', 'P8'],['Телефон', 'P30 Pro'],['Телефон', 'P30 lite'],['Телефон', 'P30'],['Телефон', 'P20 Pro'],['Телефон', 'P20 Lite'],['Телефон', 'P20'],['Телефон', 'P10 Plus'],['Телефон', 'P10 Lite'],['Телефон', 'P10'],['Телефон', 'P smart Z'],['Телефон', 'P Smart (2019)'],['Телефон', 'P Smart'],['Телефон', 'Nova Plus'],['Телефон', 'Nova lite 2017'],['Телефон', 'Nova 3i'],['Телефон', 'nova 3'],['Телефон', 'Nova 2s'],['Телефон', 'Nova 2i'],['Телефон', 'Nova 2 Plus'],['Телефон', 'Nova 2'],['Телефон', 'Nova'],['Телефон', 'Mate RS Porcshe Design '],['Телефон', 'Mate 9 Pro'],['Телефон', 'Mate 9 Porsche Design'],['Телефон', 'Mate 9 Lite'],['Телефон', 'Mate 9'],['Телефон', 'Mate 8'],['Телефон', 'Mate 20 X'],['Телефон', 'Mate 20 RS Porsche Design '],['Телефон', 'Mate 20 Pro'],['Телефон', 'Mate 20 lite'],['Телефон', 'Mate 20'],['Телефон', 'Mate 10 Pro'],['Телефон', 'Mate 10'],['Телефон', 'GR5'],['Телефон', 'Magic'],['Телефон', 'GR3'],['Телефон', 'G8'],['Телефон', 'Enjoy 7 Plus'],['Телефон', 'Enjoy 7'],['Телефон', 'Enjoy 6'],['Телефон', 'Ascend Y635'],['Телефон', 'Ascend Y550'],['Телефон', 'Ascend Y520'],['Телефон', 'Ascend Y5'],['Телефон', 'Ascend Y360'],['Телефон', 'Ascend G7 Plus'],];

let priceService = [['Восстановление после попадания воды', 'Y9 (2018)', ' 1100', ' 90'],['Замена аккумулятора', 'Y9 (2018)', ' 1550', ' 75'],['Замена датчика приближения', 'Y9 (2018)', ' 1450', ' 90'],['Замена динамика/звонка', 'Y9 (2018)', ' 1300', ' 75'],['Замена дисплея', 'Y9 (2018)', ' 2350', ' 90'],['Замена задней крышки', 'Y9 (2018)', ' 1700', ' 75'],['Замена основной камеры', 'Y9 (2018)', ' 1950', ' 75'],['Замена кнопки включения', 'Y9 (2018)', ' 1200', ' 60'],['Замена микрофона', 'Y9 (2018)', ' 1250', ' 75'],['Замена разъема зарядки/гарнитуры', 'Y9 (2018)', ' 1350', ' 75'],['Замена шлейфа', 'Y9 (2018)', ' 1350', ' 75'],['Программный ремонт/Обновление ПО', 'Y9 (2018)', ' 1000', ' 120'],['Технически сложный ремонт', 'Y9 (2018)', ' 1500', ' 120'],['Восстановление после попадания воды', 'Y7 2019', ' 1100', ' 90'],['Замена аккумулятора', 'Y7 2019', ' 1550', ' 75'],['Замена датчика приближения', 'Y7 2019', ' 1450', ' 90'],['Замена динамика/звонка', 'Y7 2019', ' 1300', ' 75'],['Замена дисплея', 'Y7 2019', ' 2580', ' 90'],['Замена задней крышки', 'Y7 2019', ' 1250', ' 75'],['Замена основной камеры', 'Y7 2019', ' 1850', ' 75'],['Замена кнопки включения', 'Y7 2019', ' 1200', ' 60'],['Замена микрофона', 'Y7 2019', ' 1250', ' 75'],['Замена разъема зарядки/гарнитуры', 'Y7 2019', ' 1300', ' 75'],['Замена шлейфа', 'Y7 2019', ' 1350', ' 75'],['Программный ремонт/Обновление ПО', 'Y7 2019', ' 1000', ' 120'],['Технически сложный ремонт', 'Y7 2019', ' 1500', ' 120'],['Восстановление после попадания воды', 'Y6 Pro', ' 990', ' 90'],['Замена аккумулятора', 'Y6 Pro', ' 1300', ' 75'],['Замена датчика приближения', 'Y6 Pro', ' 1400', ' 90'],['Замена динамика/звонка', 'Y6 Pro', ' 1250', ' 75'],['Замена дисплея', 'Y6 Pro', ' 2390', ' 90'],['Замена задней крышки', 'Y6 Pro', ' 1180', ' 75'],['Замена основной камеры', 'Y6 Pro', ' 1650', ' 75'],['Замена кнопки включения', 'Y6 Pro', ' 1150', ' 60'],['Замена микрофона', 'Y6 Pro', ' 1200', ' 75'],['Замена разъема зарядки/гарнитуры', 'Y6 Pro', ' 1300', ' 75'],['Замена шлейфа', 'Y6 Pro', ' 1350', ' 75'],['Программный ремонт/Обновление ПО', 'Y6 Pro', ' 1000', ' 120'],['Технически сложный ремонт', 'Y6 Pro', ' 1400', ' 120'],['Восстановление после попадания воды', 'Y6 Prime (2018)', ' 990', ' 90'],['Замена аккумулятора', 'Y6 Prime (2018)', ' 1450', ' 75'],['Замена датчика приближения', 'Y6 Prime (2018)', ' 1400', ' 90'],['Замена динамика/звонка', 'Y6 Prime (2018)', ' 1250', ' 75'],['Замена дисплея', 'Y6 Prime (2018)', ' 2300', ' 90'],['Замена задней крышки', 'Y6 Prime (2018)', ' 1300', ' 75'],['Замена основной камеры', 'Y6 Prime (2018)', ' 1650', ' 75'],['Замена кнопки включения', 'Y6 Prime (2018)', ' 1200', ' 60'],['Замена микрофона', 'Y6 Prime (2018)', ' 1250', ' 75'],['Замена разъема зарядки/гарнитуры', 'Y6 Prime (2018)', ' 1300', ' 75'],['Замена шлейфа', 'Y6 Prime (2018)', ' 1350', ' 75'],['Программный ремонт/Обновление ПО', 'Y6 Prime (2018)', ' 1000', ' 120'],['Технически сложный ремонт', 'Y6 Prime (2018)', ' 1500', ' 120'],['Восстановление после попадания воды', 'Y6 II', ' 990', ' 90'],['Замена аккумулятора', 'Y6 II', ' 1300', ' 75'],['Замена датчика приближения', 'Y6 II', ' 1400', ' 90'],['Замена динамика/звонка', 'Y6 II', ' 1250', ' 75'],['Замена дисплея', 'Y6 II', ' 2390', ' 90'],['Замена задней крышки', 'Y6 II', ' 1150', ' 75'],['Замена основной камеры', 'Y6 II', ' 1600', ' 75'],['Замена кнопки включения', 'Y6 II', ' 1200', ' 60'],['Замена микрофона', 'Y6 II', ' 1250', ' 75'],['Замена разъема зарядки/гарнитуры', 'Y6 II', ' 1300', ' 75'],['Замена шлейфа', 'Y6 II', ' 1350', ' 75'],['Программный ремонт/Обновление ПО', 'Y6 II', ' 1000', ' 120'],['Технически сложный ремонт', 'Y6 II', ' 1300', ' 120'],['Восстановление после попадания воды', 'Y6 2019', ' 990', ' 90'],['Замена аккумулятора', 'Y6 2019', ' 1600', ' 75'],['Замена датчика приближения', 'Y6 2019', ' 1400', ' 90'],['Замена динамика/звонка', 'Y6 2019', ' 1300', ' 75'],['Замена дисплея', 'Y6 2019', ' 2500', ' 90'],['Замена задней крышки', 'Y6 2019', ' 1350', ' 75'],['Замена основной камеры', 'Y6 2019', ' 1790', ' 75'],['Замена кнопки включения', 'Y6 2019', ' 1200', ' 60'],['Замена микрофона', 'Y6 2019', ' 1250', ' 75'],['Замена разъема зарядки/гарнитуры', 'Y6 2019', ' 1300', ' 75'],['Замена шлейфа', 'Y6 2019', ' 1350', ' 75'],['Программный ремонт/Обновление ПО', 'Y6 2019', ' 1000', ' 120'],['Технически сложный ремонт', 'Y6 2019', ' 1450', ' 120'],['Восстановление после попадания воды', 'Y6', ' 990', ' 90'],['Замена аккумулятора', 'Y6', ' 1400', ' 75'],['Замена датчика приближения', 'Y6', ' 1200', ' 90'],['Замена динамика/звонка', 'Y6', ' 1200', ' 75'],['Замена дисплея', 'Y6', ' 2300', ' 90'],['Замена задней крышки', 'Y6', ' 1300', ' 75'],['Замена основной камеры', 'Y6', ' 1600', ' 75'],['Замена кнопки включения', 'Y6', ' 1200', ' 60'],['Замена микрофона', 'Y6', ' 1200', ' 75'],['Замена разъема зарядки/гарнитуры', 'Y6', ' 1200', ' 75'],['Замена шлейфа', 'Y6', ' 1300', ' 75'],['Программный ремонт/Обновление ПО', 'Y6', ' 1000', ' 120'],['Технически сложный ремонт', 'Y6', ' 1200', ' 120'],['Восстановление после попадания воды', 'Y5C', ' 990', ' 90'],['Замена аккумулятора', 'Y5C', ' 1000', ' 75'],['Замена датчика приближения', 'Y5C', ' 1200', ' 90); (2503'],['Замена дисплея', 'Y5C', ' 1700', ' 90'],['Замена задней крышки', 'Y5C', ' 1150', ' 75'],['Замена основной камеры', 'Y5C', ' 1300', ' 75'],['Замена кнопки включения', 'Y5C', ' 1200', ' 60'],['Замена микрофона', 'Y5C', ' 1150', ' 75'],['Замена разъема зарядки/гарнитуры', 'Y5C', ' 1200', ' 75'],['Замена шлейфа', 'Y5C', ' 1200', ' 75'],['Программный ремонт/Обновление ПО', 'Y5C', ' 1000', ' 120'],['Технически сложный ремонт', 'Y5C', ' 1200', ' 120'],['Восстановление после попадания воды', 'Y5 II', ' 990', ' 90'],['Замена аккумулятора', 'Y5 II', ' 1000', ' 75'],['Замена датчика приближения', 'Y5 II', ' 1200', ' 90'],['Замена динамика/звонка', 'Y5 II', ' 1200', ' 75'],['Замена дисплея', 'Y5 II', ' 2290', ' 90'],['Замена задней крышки', 'Y5 II', ' 1150', ' 75'],['Замена основной камеры', 'Y5 II', ' 1250', ' 75'],['Замена кнопки включения', 'Y5 II', ' 1200', ' 60'],['Замена микрофона', 'Y5 II', ' 1150', ' 75'],['Замена разъема зарядки/гарнитуры', 'Y5 II', ' 1200', ' 75'],['Замена шлейфа', 'Y5 II', ' 1250', ' 75'],['Программный ремонт/Обновление ПО', 'Y5 II', ' 1000', ' 120'],['Технически сложный ремонт', 'Y5 II', ' 1200', ' 120'],['Восстановление после попадания воды', 'Y5 2018', ' 990', ' 90'],['Замена аккумулятора', 'Y5 2018', ' 1450', ' 75'],['Замена датчика приближения', 'Y5 2018', ' 1350', ' 90'],['Замена динамика/звонка', 'Y5 2018', ' 1300', ' 75'],['Замена дисплея', 'Y5 2018', ' 2370', ' 90'],['Замена задней крышки', 'Y5 2018', ' 1180', ' 75'],['Замена основной камеры', 'Y5 2018', ' 1750', ' 75'],['Замена кнопки включения', 'Y5 2018', ' 1200', ' 60'],['Замена микрофона', 'Y5 2018', ' 1250', ' 75'],['Замена разъема зарядки/гарнитуры', 'Y5 2018', ' 1250', ' 75'],['Замена шлейфа', 'Y5 2018', ' 1300', ' 75'],['Программный ремонт/Обновление ПО', 'Y5 2018', ' 1000', ' 120'],['Технически сложный ремонт', 'Y5 2018', ' 1500', ' 120'],['Восстановление после попадания воды', 'Y5 (2017)', ' 990', ' 90'],['Замена аккумулятора', 'Y5 (2017)', ' 1450', ' 75'],['Замена датчика приближения', 'Y5 (2017)', ' 1350', ' 90'],['Замена динамика/звонка', 'Y5 (2017)', ' 1300', ' 75'],['Замена дисплея', 'Y5 (2017)', ' 2290', ' 90'],['Замена задней крышки', 'Y5 (2017)', ' 1250', ' 75'],['Замена основной камеры', 'Y5 (2017)', ' 1650', ' 75'],['Замена кнопки включения', 'Y5 (2017)', ' 1200', ' 60'],['Замена микрофона', 'Y5 (2017)', ' 1250', ' 75'],['Замена разъема зарядки/гарнитуры', 'Y5 (2017)', ' 1250', ' 75'],['Замена шлейфа', 'Y5 (2017)', ' 1300', ' 75'],['Программный ремонт/Обновление ПО', 'Y5 (2017)', ' 1000', ' 120'],['Технически сложный ремонт', 'Y5 (2017)', ' 1450', ' 120'],['Восстановление после попадания воды', 'Y3C', ' 900', ' 90'],['Замена аккумулятора', 'Y3C', ' 1000', ' 75'],['Замена датчика приближения', 'Y3C', ' 1100', ' 90'],['Замена динамика/звонка', 'Y3C', ' 1100', ' 75'],['Замена дисплея', 'Y3C', ' 1800', ' 90'],['Замена задней крышки', 'Y3C', ' 1200', ' 75'],['Замена основной камеры', 'Y3C', ' 1300', ' 75'],['Замена кнопки включения', 'Y3C', ' 1100', ' 60'],['Замена микрофона', 'Y3C', ' 1150', ' 75'],['Замена разъема зарядки/гарнитуры', 'Y3C', ' 1150', ' 75'],['Замена шлейфа', 'Y3C', ' 1150', ' 75'],['Программный ремонт/Обновление ПО', 'Y3C', ' 1000', ' 120'],['Технически сложный ремонт', 'Y3C', ' 1200', ' 120'],['Восстановление после попадания воды', 'Y3 II 4G', ' 900', ' 90'],['Замена аккумулятора', 'Y3 II 4G', ' 1000', ' 75'],['Замена датчика приближения', 'Y3 II 4G', ' 1100', ' 90'],['Замена динамика/звонка', 'Y3 II 4G', ' 1100', ' 75'],['Замена дисплея', 'Y3 II 4G', ' 1900', ' 90'],['Замена задней крышки', 'Y3 II 4G', ' 1200', ' 75'],['Замена основной камеры', 'Y3 II 4G', ' 1300', ' 75'],['Замена кнопки включения', 'Y3 II 4G', ' 1100', ' 60'],['Замена микрофона', 'Y3 II 4G', ' 1150', ' 75'],['Замена разъема зарядки/гарнитуры', 'Y3 II 4G', ' 1150', ' 75'],['Замена шлейфа', 'Y3 II 4G', ' 1150', ' 75'],['Программный ремонт/Обновление ПО', 'Y3 II 4G', ' 1000', ' 120'],['Технически сложный ремонт', 'Y3 II 4G', ' 1200', ' 120'],['Восстановление после попадания воды', 'Y3 II', ' 900', ' 90'],['Замена аккумулятора', 'Y3 II', ' 1000', ' 75'],['Замена датчика приближения', 'Y3 II', ' 1100', ' 90'],['Замена динамика/звонка', 'Y3 II', ' 1100', ' 75'],['Замена дисплея', 'Y3 II', ' 1900', ' 90'],['Замена задней крышки', 'Y3 II', ' 1200', ' 75'],['Замена основной камеры', 'Y3 II', ' 1300', ' 75'],['Замена кнопки включения', 'Y3 II', ' 1100', ' 60'],['Замена микрофона', 'Y3 II', ' 1150', ' 75'],['Замена разъема зарядки/гарнитуры', 'Y3 II', ' 1150', ' 75'],['Замена шлейфа', 'Y3 II', ' 1150', ' 75'],['Программный ремонт/Обновление ПО', 'Y3 II', ' 1000', ' 120'],['Технически сложный ремонт', 'Y3 II', ' 1200', ' 120'],['Восстановление после попадания воды', 'Y3 2017', ' 990', ' 90'],['Замена аккумулятора', 'Y3 2017', ' 1000', ' 75'],['Замена датчика приближения', 'Y3 2017', ' 1200', ' 90'],['Замена динамика/звонка', 'Y3 2017', ' 1100', ' 75'],['Замена дисплея', 'Y3 2017', ' 2150', ' 90'],['Замена задней крышки', 'Y3 2017', ' 1250', ' 75'],['Замена основной камеры', 'Y3 2017', ' 1550', ' 75'],['Замена кнопки включения', 'Y3 2017', ' 1150', ' 60'],['Замена микрофона', 'Y3 2017', ' 1200', ' 75'],['Замена разъема зарядки/гарнитуры', 'Y3 2017', ' 1200', ' 75'],['Замена шлейфа', 'Y3 2017', ' 1200', ' 75'],['Программный ремонт/Обновление ПО', 'Y3 2017', ' 1000', ' 120'],['Технически сложный ремонт', 'Y3 2017', ' 1350', ' 120'],['Восстановление после попадания воды', 'P9 Plus', ' 1100', ' 90'],['Замена аккумулятора', 'P9 Plus', ' 1650', ' 75'],['Замена датчика приближения', 'P9 Plus', ' 1450', ' 90'],['Замена динамика/звонка', 'P9 Plus', ' 1350', ' 75'],['Замена дисплея', 'P9 Plus', ' 3600', ' 90'],['Замена задней крышки', 'P9 Plus', ' 1700', ' 75'],['Замена основной камеры', 'P9 Plus', ' 2100', ' 75'],['Замена кнопки включения', 'P9 Plus', ' 1300', ' 60'],['Замена микрофона', 'P9 Plus', ' 1300', ' 75'],['Замена разъема зарядки/гарнитуры', 'P9 Plus', ' 1400', ' 75'],['Замена шлейфа', 'P9 Plus', ' 1350', ' 75'],['Программный ремонт/Обновление ПО', 'P9 Plus', ' 1000', ' 120'],['Технически сложный ремонт', 'P9 Plus', ' 1500', ' 120'],['Восстановление после попадания воды', 'P9 Lite', ' 1100', ' 90'],['Замена аккумулятора', 'P9 Lite', ' 1500', ' 75'],['Замена датчика приближения', 'P9 Lite', ' 1450', ' 90'],['Замена динамика/звонка', 'P9 Lite', ' 1250', ' 75'],['Замена дисплея', 'P9 Lite', ' 2450', ' 90'],['Замена задней крышки', 'P9 Lite', ' 1200', ' 75'],['Замена основной камеры', 'P9 Lite', ' 1850', ' 75'],['Замена кнопки включения', 'P9 Lite', ' 1200', ' 60'],['Замена микрофона', 'P9 Lite', ' 1300', ' 75'],['Замена разъема зарядки/гарнитуры', 'P9 Lite', ' 1300', ' 75'],['Замена шлейфа', 'P9 Lite', ' 1300', ' 75'],['Программный ремонт/Обновление ПО', 'P9 Lite', ' 1000', ' 120'],['Технически сложный ремонт', 'P9 Lite', ' 1450', ' 120'],['Восстановление после попадания воды', 'P9', ' 1100', ' 90'],['Замена аккумулятора', 'P9', ' 1500', ' 75'],['Замена датчика приближения', 'P9', ' 1450', ' 90'],['Замена динамика/звонка', 'P9', ' 1300', ' 75'],['Замена дисплея', 'P9', ' 2860', ' 90'],['Замена задней крышки', 'P9', ' 1790', ' 75'],['Замена основной камеры', 'P9', ' 2100', ' 75'],['Замена кнопки включения', 'P9', ' 1300', ' 60'],['Замена микрофона', 'P9', ' 1300', ' 75'],['Замена разъема зарядки/гарнитуры', 'P9', ' 1350', ' 75'],['Замена шлейфа', 'P9', ' 1350', ' 75'],['Программный ремонт/Обновление ПО', 'P9', ' 1000', ' 120'],['Технически сложный ремонт', 'P9', ' 1500', ' 120'],['Восстановление после попадания воды', 'P8 Max', ' 1100', ' 90'],['Замена аккумулятора', 'P8 Max', ' 1600', ' 75'],['Замена датчика приближения', 'P8 Max', ' 1450', ' 90'],['Замена динамика/звонка', 'P8 Max', ' 1250', ' 75'],['Замена дисплея', 'P8 Max', ' 2900', ' 90'],['Замена задней крышки', 'P8 Max', ' 1800', ' 75'],['Замена основной камеры', 'P8 Max', ' 2100', ' 75'],['Замена кнопки включения', 'P8 Max', ' 1250', ' 60'],['Замена микрофона', 'P8 Max', ' 1300', ' 75'],['Замена разъема зарядки/гарнитуры', 'P8 Max', ' 1300', ' 75'],['Замена шлейфа', 'P8 Max', ' 1350', ' 75'],['Программный ремонт/Обновление ПО', 'P8 Max', ' 1000', ' 120'],['Технически сложный ремонт', 'P8 Max', ' 1500', ' 120'],['Восстановление после попадания воды', 'P8 Lite (2017)', ' 1100', ' 90'],['Замена аккумулятора', 'P8 Lite (2017)', ' 1500', ' 75'],['Замена датчика приближения', 'P8 Lite (2017)', ' 1450', ' 90'],['Замена динамика/звонка', 'P8 Lite (2017)', ' 1200', ' 75'],['Замена дисплея', 'P8 Lite (2017)', ' 2370', ' 90'],['Замена задней крышки', 'P8 Lite (2017)', ' 1150', ' 75'],['Замена основной камеры', 'P8 Lite (2017)', ' 1900', ' 75'],['Замена кнопки включения', 'P8 Lite (2017)', ' 1200', ' 60'],['Замена микрофона', 'P8 Lite (2017)', ' 1250', ' 75'],['Замена разъема зарядки/гарнитуры', 'P8 Lite (2017)', ' 1250', ' 75'],['Замена шлейфа', 'P8 Lite (2017)', ' 1250', ' 75'],['Программный ремонт/Обновление ПО', 'P8 Lite (2017)', ' 1000', ' 120'],['Технически сложный ремонт', 'P8 Lite (2017)', ' 1400', ' 120'],['Восстановление после попадания воды', 'P8 Lite', ' 1100', ' 90'],['Замена аккумулятора', 'P8 Lite', ' 1500', ' 75'],['Замена датчика приближения', 'P8 Lite', ' 1450', ' 90'],['Замена динамика/звонка', 'P8 Lite', ' 1200', ' 75'],['Замена дисплея', 'P8 Lite', ' 2390', ' 90'],['Замена задней крышки', 'P8 Lite', ' 1150', ' 75'],['Замена основной камеры', 'P8 Lite', ' 1900', ' 75'],['Замена кнопки включения', 'P8 Lite', ' 1200', ' 60'],['Замена микрофона', 'P8 Lite', ' 1250', ' 75'],['Замена разъема зарядки/гарнитуры', 'P8 Lite', ' 1250', ' 75'],['Замена шлейфа', 'P8 Lite', ' 1250', ' 75'],['Программный ремонт/Обновление ПО', 'P8 Lite', ' 1000', ' 120'],['Технически сложный ремонт', 'P8 Lite', ' 1400', ' 120'],['Восстановление после попадания воды', 'P8', ' 1100', ' 90'],['Замена аккумулятора', 'P8', ' 1550', ' 75'],['Замена датчика приближения', 'P8', ' 1450', ' 90'],['Замена динамика/звонка', 'P8', ' 1200', ' 75'],['Замена дисплея', 'P8', ' 2200', ' 90'],['Замена задней крышки', 'P8', ' 1550', ' 75'],['Замена основной камеры', 'P8', ' 2000', ' 75'],['Замена кнопки включения', 'P8', ' 1250', ' 60'],['Замена микрофона', 'P8', ' 1250', ' 75'],['Замена разъема зарядки/гарнитуры', 'P8', ' 1300', ' 75'],['Замена шлейфа', 'P8', ' 1300', ' 75'],['Программный ремонт/Обновление ПО', 'P8', ' 1000', ' 120'],['Технически сложный ремонт', 'P8', ' 1450', ' 120'],['Восстановление после попадания воды', 'P30 Pro', ' 1300', ' 90'],['Замена аккумулятора', 'P30 Pro', ' 1750', ' 75'],['Замена датчика приближения', 'P30 Pro', ' 1600', ' 90'],['Замена динамика/звонка', 'P30 Pro', ' 1500', ' 75'],['Замена дисплея', 'P30 Pro', ' 15000', ' 90'],['Замена задней крышки', 'P30 Pro', ' 1450', ' 75'],['Замена основной камеры', 'P30 Pro', ' 2700', ' 75'],['Замена кнопки включения', 'P30 Pro', ' 1450', ' 60'],['Замена микрофона', 'P30 Pro', ' 1600', ' 75'],['Замена разъема зарядки/гарнитуры', 'P30 Pro', ' 1650', ' 75'],['Замена шлейфа', 'P30 Pro', ' 1650', ' 75'],['Программный ремонт/Обновление ПО', 'P30 Pro', ' 1000', ' 120'],['Технически сложный ремонт', 'P30 Pro', ' 1700', ' 120'],['Восстановление после попадания воды', 'P30 lite', ' 1200', ' 90'],['Замена аккумулятора', 'P30 lite', ' 1450', ' 75'],['Замена датчика приближения', 'P30 lite', ' 1500', ' 90'],['Замена динамика/звонка', 'P30 lite', ' 1350', ' 75'],['Замена дисплея', 'P30 lite', ' 3570', ' 90'],['Замена задней крышки', 'P30 lite', ' 1300', ' 75'],['Замена основной камеры', 'P30 lite', ' 2300', ' 75'],['Замена кнопки включения', 'P30 lite', ' 1300', ' 60'],['Замена микрофона', 'P30 lite', ' 1300', ' 75'],['Замена разъема зарядки/гарнитуры', 'P30 lite', ' 1340', ' 75'],['Замена шлейфа', 'P30 lite', ' 1350', ' 75'],['Программный ремонт/Обновление ПО', 'P30 lite', ' 1000', ' 120'],['Технически сложный ремонт', 'P30 lite', ' 1500', ' 120'],['Восстановление после попадания воды', 'P30', ' 1300', ' 90'],['Замена аккумулятора', 'P30', ' 1450', ' 75'],['Замена датчика приближения', 'P30', ' 1600', ' 90'],['Замена динамика/звонка', 'P30', ' 1450', ' 75'],['Замена дисплея', 'P30', ' 16990', ' 90'],['Замена задней крышки', 'P30', ' 1350', ' 75'],['Замена основной камеры', 'P30', ' 2650', ' 75'],['Замена кнопки включения', 'P30', ' 1300', ' 60'],['Замена микрофона', 'P30', ' 1500', ' 75'],['Замена разъема зарядки/гарнитуры', 'P30', ' 1600', ' 75'],['Замена шлейфа', 'P30', ' 1550', ' 75'],['Программный ремонт/Обновление ПО', 'P30', ' 1000', ' 120'],['Технически сложный ремонт', 'P30', ' 1700', ' 120'],['Восстановление после попадания воды', 'P20 Pro', ' 1300', ' 90'],['Замена аккумулятора', 'P20 Pro', ' 1700', ' 75'],['Замена датчика приближения', 'P20 Pro', ' 1600', ' 90'],['Замена динамика/звонка', 'P20 Pro', ' 1450', ' 75'],['Замена дисплея', 'P20 Pro', ' 15900', ' 90'],['Замена задней крышки', 'P20 Pro', ' 1400', ' 75'],['Замена основной камеры', 'P20 Pro', ' 2700', ' 75'],['Замена кнопки включения', 'P20 Pro', ' 1300', ' 60'],['Замена микрофона', 'P20 Pro', ' 1500', ' 75'],['Замена разъема зарядки/гарнитуры', 'P20 Pro', ' 1550', ' 75'],['Замена шлейфа', 'P20 Pro', ' 1550', ' 75'],['Программный ремонт/Обновление ПО', 'P20 Pro', ' 1000', ' 120'],['Технически сложный ремонт', 'P20 Pro', ' 1700', ' 120'],['Восстановление после попадания воды', 'P20 Lite', ' 1200', ' 90'],['Замена аккумулятора', 'P20 Lite', ' 1400', ' 75'],['Замена датчика приближения', 'P20 Lite', ' 1500', ' 90'],['Замена динамика/звонка', 'P20 Lite', ' 1350', ' 75'],['Замена дисплея', 'P20 Lite', ' 2500', ' 90'],['Замена задней крышки', 'P20 Lite', ' 1300', ' 75'],['Замена основной камеры', 'P20 Lite', ' 1990', ' 75'],['Замена кнопки включения', 'P20 Lite', ' 1250', ' 60'],['Замена микрофона', 'P20 Lite', ' 1350', ' 75'],['Замена разъема зарядки/гарнитуры', 'P20 Lite', ' 1250', ' 75'],['Замена шлейфа', 'P20 Lite', ' 1350', ' 75'],['Программный ремонт/Обновление ПО', 'P20 Lite', ' 1000', ' 120'],['Технически сложный ремонт', 'P20 Lite', ' 1500', ' 120'],['Восстановление после попадания воды', 'P20', ' 1300', ' 90'],['Замена аккумулятора', 'P20', ' 1600', ' 75'],['Замена датчика приближения', 'P20', ' 1600', ' 90'],['Замена динамика/звонка', 'P20', ' 1400', ' 75'],['Замена дисплея', 'P20', ' 3450', ' 90'],['Замена задней крышки', 'P20', ' 1300', ' 75'],['Замена основной камеры', 'P20', ' 2350', ' 75'],['Замена кнопки включения', 'P20', ' 1250', ' 60'],['Замена микрофона', 'P20', ' 1500', ' 75'],['Замена разъема зарядки/гарнитуры', 'P20', ' 1500', ' 75'],['Замена шлейфа', 'P20', ' 1550', ' 75'],['Программный ремонт/Обновление ПО', 'P20', ' 1000', ' 120'],['Технически сложный ремонт', 'P20', ' 1600', ' 120'],['Восстановление после попадания воды', 'P10 Plus', ' 1200', ' 90'],['Замена аккумулятора', 'P10 Plus', ' 1450', ' 75'],['Замена датчика приближения', 'P10 Plus', ' 1450', ' 90'],['Замена динамика/звонка', 'P10 Plus', ' 1250', ' 75'],['Замена дисплея', 'P10 Plus', ' 5700', ' 90'],['Замена задней крышки', 'P10 Plus', ' 2700', ' 75'],['Замена основной камеры', 'P10 Plus', ' 2200', ' 75'],['Замена кнопки включения', 'P10 Plus', ' 1200', ' 60'],['Замена микрофона', 'P10 Plus', ' 1300', ' 75'],['Замена разъема зарядки/гарнитуры', 'P10 Plus', ' 1350', ' 75'],['Замена шлейфа', 'P10 Plus', ' 1400', ' 75'],['Программный ремонт/Обновление ПО', 'P10 Plus', ' 1000', ' 120'],['Технически сложный ремонт', 'P10 Plus', ' 1500', ' 120'],['Восстановление после попадания воды', 'P10 Lite', ' 1200', ' 90'],['Замена аккумулятора', 'P10 Lite', ' 1450', ' 75'],['Замена датчика приближения', 'P10 Lite', ' 1450', ' 90'],['Замена динамика/звонка', 'P10 Lite', ' 1250', ' 75'],['Замена дисплея', 'P10 Lite', ' 2570', ' 90'],['Замена задней крышки', 'P10 Lite', ' 1350', ' 75'],['Замена основной камеры', 'P10 Lite', ' 1990', ' 75'],['Замена кнопки включения', 'P10 Lite', ' 1200', ' 60'],['Замена микрофона', 'P10 Lite', ' 1250', ' 75'],['Замена разъема зарядки/гарнитуры', 'P10 Lite', ' 1300', ' 75'],['Замена шлейфа', 'P10 Lite', ' 1350', ' 75'],['Программный ремонт/Обновление ПО', 'P10 Lite', ' 1000', ' 120'],['Технически сложный ремонт', 'P10 Lite', ' 1500', ' 120'],['Восстановление после попадания воды', 'P10', ' 1200', ' 90'],['Замена аккумулятора', 'P10', ' 1450', ' 75'],['Замена датчика приближения', 'P10', ' 1500', ' 90'],['Замена динамика/звонка', 'P10', ' 1250', ' 75'],['Замена дисплея', 'P10', ' 3370', ' 90'],['Замена задней крышки', 'P10', ' 1990', ' 75'],['Замена основной камеры', 'P10', ' 1990', ' 75'],['Замена кнопки включения', 'P10', ' 1200', ' 60'],['Замена микрофона', 'P10', ' 1250', ' 75'],['Замена разъема зарядки/гарнитуры', 'P10', ' 1300', ' 75'],['Замена шлейфа', 'P10', ' 1400', ' 75'],['Программный ремонт/Обновление ПО', 'P10', ' 1000', ' 120'],['Технически сложный ремонт', 'P10', ' 1600', ' 120'],['Восстановление после попадания воды', 'P smart Z', ' 1200', ' 90'],['Замена аккумулятора', 'P smart Z', ' 1550', ' 75'],['Замена датчика приближения', 'P smart Z', ' 1600', ' 90'],['Замена динамика/звонка', 'P smart Z', ' 1250', ' 75'],['Замена дисплея', 'P smart Z', ' 3250', ' 90'],['Замена задней крышки', 'P smart Z', ' 1650', ' 75'],['Замена основной камеры', 'P smart Z', ' 1990', ' 75'],['Замена кнопки включения', 'P smart Z', ' 1250', ' 60'],['Замена микрофона', 'P smart Z', ' 1300', ' 75'],['Замена разъема зарядки/гарнитуры', 'P smart Z', ' 1300', ' 75'],['Замена шлейфа', 'P smart Z', ' 1350', ' 75'],['Программный ремонт/Обновление ПО', 'P smart Z', ' 1000', ' 120'],['Технически сложный ремонт', 'P smart Z', ' 1500', ' 120'],['Восстановление после попадания воды', 'P Smart (2019)', ' 1200', ' 90'],['Замена аккумулятора', 'P Smart (2019)', ' 1650', ' 75'],['Замена датчика приближения', 'P Smart (2019)', ' 1600', ' 90'],['Замена динамика/звонка', 'P Smart (2019)', ' 1250', ' 75'],['Замена дисплея', 'P Smart (2019)', ' 3750', ' 90'],['Замена задней крышки', 'P Smart (2019)', ' 1300', ' 75'],['Замена основной камеры', 'P Smart (2019)', ' 1990', ' 75'],['Замена кнопки включения', 'P Smart (2019)', ' 1250', ' 60'],['Замена микрофона', 'P Smart (2019)', ' 1300', ' 75'],['Замена разъема зарядки/гарнитуры', 'P Smart (2019)', ' 1300', ' 75'],['Замена шлейфа', 'P Smart (2019)', ' 1350', ' 75'],['Программный ремонт/Обновление ПО', 'P Smart (2019)', ' 1000', ' 120'],['Технически сложный ремонт', 'P Smart (2019)', ' 1500', ' 120'],['Восстановление после попадания воды', 'P Smart', ' 1100', ' 90'],['Замена аккумулятора', 'P Smart', ' 1450', ' 75'],['Замена датчика приближения', 'P Smart', ' 1350', ' 90'],['Замена динамика/звонка', 'P Smart', ' 1200', ' 75'],['Замена дисплея', 'P Smart', ' 2300', ' 90'],['Замена задней крышки', 'P Smart', ' 1400', ' 75'],['Замена основной камеры', 'P Smart', ' 1750', ' 75'],['Замена кнопки включения', 'P Smart', ' 1200', ' 60'],['Замена микрофона', 'P Smart', ' 1250', ' 75'],['Замена разъема зарядки/гарнитуры', 'P Smart', ' 1250', ' 75'],['Замена шлейфа', 'P Smart', ' 1250', ' 75'],['Программный ремонт/Обновление ПО', 'P Smart', ' 1000', ' 120'],['Технически сложный ремонт', 'P Smart', ' 1400', ' 120'],['Восстановление после попадания воды', 'Nova Plus', ' 1100', ' 90'],['Замена аккумулятора', 'Nova Plus', ' 1500', ' 75'],['Замена датчика приближения', 'Nova Plus', ' 1350', ' 90'],['Замена динамика/звонка', 'Nova Plus', ' 1250', ' 75'],['Замена дисплея', 'Nova Plus', ' 2650', ' 90'],['Замена задней крышки', 'Nova Plus', ' 1950', ' 75'],['Замена основной камеры', 'Nova Plus', ' 1800', ' 75'],['Замена кнопки включения', 'Nova Plus', ' 1200', ' 60'],['Замена микрофона', 'Nova Plus', ' 1250', ' 75'],['Замена разъема зарядки/гарнитуры', 'Nova Plus', ' 1350', ' 75'],['Замена шлейфа', 'Nova Plus', ' 1250', ' 75'],['Программный ремонт/Обновление ПО', 'Nova Plus', ' 1000', ' 120'],['Технически сложный ремонт', 'Nova Plus', ' 1400', ' 120'],['Восстановление после попадания воды', 'Nova lite 2017', ' 1100', ' 90'],['Замена аккумулятора', 'Nova lite 2017', ' 1500', ' 75'],['Замена датчика приближения', 'Nova lite 2017', ' 1350', ' 90'],['Замена динамика/звонка', 'Nova lite 2017', ' 1250', ' 75'],['Замена дисплея', 'Nova lite 2017', ' 2350', ' 90'],['Замена задней крышки', 'Nova lite 2017', ' 1250', ' 75'],['Замена основной камеры', 'Nova lite 2017', ' 1800', ' 75'],['Замена кнопки включения', 'Nova lite 2017', ' 1200', ' 60'],['Замена микрофона', 'Nova lite 2017', ' 1250', ' 75'],['Замена разъема зарядки/гарнитуры', 'Nova lite 2017', ' 1300', ' 75'],['Замена шлейфа', 'Nova lite 2017', ' 1250', ' 75'],['Программный ремонт/Обновление ПО', 'Nova lite 2017', ' 1000', ' 120'],['Технически сложный ремонт', 'Nova lite 2017', ' 1400', ' 120'],['Восстановление после попадания воды', 'Nova 3i', ' 1100', ' 90'],['Замена аккумулятора', 'Nova 3i', ' 1550', ' 75'],['Замена датчика приближения', 'Nova 3i', ' 1350', ' 90'],['Замена динамика/звонка', 'Nova 3i', ' 1250', ' 75'],['Замена дисплея', 'Nova 3i', ' 2990', ' 90'],['Замена задней крышки', 'Nova 3i', ' 1200', ' 75'],['Замена основной камеры', 'Nova 3i', ' 1850', ' 75'],['Замена кнопки включения', 'Nova 3i', ' 1250', ' 60'],['Замена микрофона', 'Nova 3i', ' 1300', ' 75'],['Замена разъема зарядки/гарнитуры', 'Nova 3i', ' 1350', ' 75'],['Замена шлейфа', 'Nova 3i', ' 1300', ' 75'],['Программный ремонт/Обновление ПО', 'Nova 3i', ' 1000', ' 120'],['Технически сложный ремонт', 'Nova 3i', ' 1600', ' 120'],['Восстановление после попадания воды', 'nova 3', ' 1100', ' 90'],['Замена аккумулятора', 'nova 3', ' 1550', ' 75'],['Замена датчика приближения', 'nova 3', ' 1350', ' 90'],['Замена динамика/звонка', 'nova 3', ' 1250', ' 75'],['Замена дисплея', 'nova 3', ' 2900', ' 90'],['Замена задней крышки', 'nova 3', ' 200', ' 75'],['Замена основной камеры', 'nova 3', ' 1850', ' 75'],['Замена кнопки включения', 'nova 3', ' 1250', ' 60'],['Замена микрофона', 'nova 3', ' 1300', ' 75'],['Замена разъема зарядки/гарнитуры', 'nova 3', ' 1350', ' 75'],['Замена шлейфа', 'nova 3', ' 1300', ' 75'],['Программный ремонт/Обновление ПО', 'nova 3', ' 1000', ' 120'],['Технически сложный ремонт', 'nova 3', ' 1600', ' 120'],['Восстановление после попадания воды', 'Nova 2s', ' 1100', ' 90'],['Замена аккумулятора', 'Nova 2s', ' 1550', ' 75'],['Замена датчика приближения', 'Nova 2s', ' 1350', ' 90'],['Замена динамика/звонка', 'Nova 2s', ' 1250', ' 75'],['Замена дисплея', 'Nova 2s', ' 2800', ' 90'],['Замена задней крышки', 'Nova 2s', ' 2300', ' 75'],['Замена основной камеры', 'Nova 2s', ' 1850', ' 75'],['Замена кнопки включения', 'Nova 2s', ' 1250', ' 60'],['Замена микрофона', 'Nova 2s', ' 1300', ' 75'],['Замена шлейфа', 'Nova 2s', ' 1300', ' 75'],['Программный ремонт/Обновление ПО', 'Nova 2s', ' 1000', ' 120'],['Технически сложный ремонт', 'Nova 2s', ' 1550', ' 120'],['Восстановление после попадания воды', 'Nova 2i', ' 1100', ' 90'],['Замена аккумулятора', 'Nova 2i', ' 1550', ' 75'],['Замена датчика приближения', 'Nova 2i', ' 1350', ' 90'],['Замена динамика/звонка', 'Nova 2i', ' 1250', ' 75'],['Замена дисплея', 'Nova 2i', ' 2370', ' 90'],['Замена задней крышки', 'Nova 2i', ' 1700', ' 75'],['Замена основной камеры', 'Nova 2i', ' 1850', ' 75'],['Замена кнопки включения', 'Nova 2i', ' 1250', ' 60'],['Замена микрофона', 'Nova 2i', ' 1300', ' 75'],['Замена разъема зарядки/гарнитуры', 'Nova 2i', ' 1300', ' 75'],['Замена шлейфа', 'Nova 2i', ' 1300', ' 75'],['Программный ремонт/Обновление ПО', 'Nova 2i', ' 1000', ' 120'],['Технически сложный ремонт', 'Nova 2i', ' 1550', ' 120'],['Восстановление после попадания воды', 'Nova 2 Plus', ' 1100', ' 90'],['Замена аккумулятора', 'Nova 2 Plus', ' 1550', ' 75'],['Замена датчика приближения', 'Nova 2 Plus', ' 1350', ' 90'],['Замена динамика/звонка', 'Nova 2 Plus', ' 1250', ' 75'],['Замена дисплея', 'Nova 2 Plus', ' 2770', ' 90'],['Замена задней крышки', 'Nova 2 Plus', ' 2300', ' 75'],['Замена основной камеры', 'Nova 2 Plus', ' 1850', ' 75'],['Замена кнопки включения', 'Nova 2 Plus', ' 1250', ' 60'],['Замена микрофона', 'Nova 2 Plus', ' 1300', ' 75'],['Замена разъема зарядки/гарнитуры', 'Nova 2 Plus', ' 1300', ' 75'],['Замена шлейфа', 'Nova 2 Plus', ' 1300', ' 75'],['Программный ремонт/Обновление ПО', 'Nova 2 Plus', ' 1000', ' 120'],['Технически сложный ремонт', 'Nova 2 Plus', ' 1550', ' 120'],['Восстановление после попадания воды', 'Nova 2', ' 1100', ' 90'],['Замена аккумулятора', 'Nova 2', ' 1550', ' 75'],['Замена датчика приближения', 'Nova 2', ' 1350', ' 90'],['Замена динамика/звонка', 'Nova 2', ' 1250', ' 75'],['Замена дисплея', 'Nova 2', ' 2620', ' 90'],['Замена задней крышки', 'Nova 2', ' 1750', ' 75'],['Замена основной камеры', 'Nova 2', ' 1850', ' 75'],['Замена кнопки включения', 'Nova 2', ' 1250', ' 60'],['Замена микрофона', 'Nova 2', ' 1250', ' 75'],['Замена разъема зарядки/гарнитуры', 'Nova 2', ' 1300', ' 75'],['Замена шлейфа', 'Nova 2', ' 1300', ' 75'],['Программный ремонт/Обновление ПО', 'Nova 2', ' 1000', ' 120'],['Технически сложный ремонт', 'Nova 2', ' 1550', ' 120'],['Восстановление после попадания воды', 'Nova', ' 1100', ' 90'],['Замена аккумулятора', 'Nova', ' 1550', ' 75'],['Замена датчика приближения', 'Nova', ' 1350', ' 90'],['Замена динамика/звонка', 'Nova', ' 1250', ' 75'],['Замена дисплея', 'Nova', ' 2500', ' 90'],['Замена задней крышки', 'Nova', ' 1600', ' 75'],['Замена основной камеры', 'Nova', ' 1750', ' 75'],['Замена кнопки включения', 'Nova', ' 1200', ' 60'],['Замена микрофона', 'Nova', ' 1250', ' 75'],['Замена разъема зарядки/гарнитуры', 'Nova', ' 1300', ' 75'],['Замена шлейфа', 'Nova', ' 1300', ' 75'],['Программный ремонт/Обновление ПО', 'Nova', ' 1000', ' 120'],['Технически сложный ремонт', 'Nova', ' 1550', ' 120'],['Восстановление после попадания воды', 'Mate RS Porcshe Design ', ' 1300', ' 90'],['Замена аккумулятора', 'Mate RS Porcshe Design ', ' 1700', ' 75'],['Замена датчика приближения', 'Mate RS Porcshe Design ', ' 1600', ' 90'],['Замена динамика/звонка', 'Mate RS Porcshe Design ', ' 1400', ' 75'],['Замена дисплея', 'Mate RS Porcshe Design ', ' 14000', ' 90'],['Замена задней крышки', 'Mate RS Porcshe Design ', ' 2280', ' 75'],['Замена основной камеры', 'Mate RS Porcshe Design ', ' 2900', ' 75'],['Замена кнопки включения', 'Mate RS Porcshe Design ', ' 1400', ' 60'],['Замена микрофона', 'Mate RS Porcshe Design ', ' 1700', ' 75'],['Замена разъема зарядки/гарнитуры', 'Mate RS Porcshe Design ', ' 1650', ' 75'],['Замена шлейфа', 'Mate RS Porcshe Design ', ' 1600', ' 75'],['Программный ремонт/Обновление ПО', 'Mate RS Porcshe Design ', ' 1000', ' 120'],['Технически сложный ремонт', 'Mate RS Porcshe Design ', ' 1900', ' 120'],['Восстановление после попадания воды', 'Mate 9 Pro', ' 1300', ' 90'],['Замена аккумулятора', 'Mate 9 Pro', ' 1700', ' 75'],['Замена датчика приближения', 'Mate 9 Pro', ' 1600', ' 90'],['Замена динамика/звонка', 'Mate 9 Pro', ' 1350', ' 75'],['Замена дисплея', 'Mate 9 Pro', ' 11000', ' 90'],['Замена задней крышки', 'Mate 9 Pro', ' 2250', ' 75'],['Замена основной камеры', 'Mate 9 Pro', ' 2900', ' 75'],['Замена кнопки включения', 'Mate 9 Pro', ' 1400', ' 60'],['Замена микрофона', 'Mate 9 Pro', ' 1650', ' 75'],['Замена разъема зарядки/гарнитуры', 'Mate 9 Pro', ' 1600', ' 75'],['Замена шлейфа', 'Mate 9 Pro', ' 1600', ' 75'],['Программный ремонт/Обновление ПО', 'Mate 9 Pro', ' 1000', ' 120'],['Технически сложный ремонт', 'Mate 9 Pro', ' 1900', ' 120'],['Восстановление после попадания воды', 'Mate 9 Porsche Design', ' 1300', ' 90'],['Замена аккумулятора', 'Mate 9 Porsche Design', ' 1700', ' 75'],['Замена датчика приближения', 'Mate 9 Porsche Design', ' 1600', ' 90'],['Замена динамика/звонка', 'Mate 9 Porsche Design', ' 1350', ' 75'],['Замена дисплея', 'Mate 9 Porsche Design', ' 13500', ' 90'],['Замена задней крышки', 'Mate 9 Porsche Design', ' 2250', ' 75'],['Замена основной камеры', 'Mate 9 Porsche Design', ' 2900', ' 75'],['Замена кнопки включения', 'Mate 9 Porsche Design', ' 1400', ' 60'],['Замена микрофона', 'Mate 9 Porsche Design', ' 1650', ' 75'],['Замена разъема зарядки/гарнитуры', 'Mate 9 Porsche Design', ' 1600', ' 75'],['Замена шлейфа', 'Mate 9 Porsche Design', ' 1600', ' 75'],['Программный ремонт/Обновление ПО', 'Mate 9 Porsche Design', ' 1000', ' 120'],['Технически сложный ремонт', 'Mate 9 Porsche Design', ' 1900', ' 120'],['Восстановление после попадания воды', 'Mate 9 Lite', ' 1300', ' 90'],['Замена аккумулятора', 'Mate 9 Lite', ' 1600', ' 75'],['Замена датчика приближения', 'Mate 9 Lite', ' 1550', ' 90'],['Замена динамика/звонка', 'Mate 9 Lite', ' 1350', ' 75'],['Замена дисплея', 'Mate 9 Lite', ' 2430', ' 90'],['Замена задней крышки', 'Mate 9 Lite', ' 2200', ' 75'],['Замена основной камеры', 'Mate 9 Lite', ' 2200', ' 75'],['Замена кнопки включения', 'Mate 9 Lite', ' 1300', ' 60'],['Замена микрофона', 'Mate 9 Lite', ' 1350', ' 75'],['Замена разъема зарядки/гарнитуры', 'Mate 9 Lite', ' 1350', ' 75'],['Замена шлейфа', 'Mate 9 Lite', ' 1450', ' 75'],['Программный ремонт/Обновление ПО', 'Mate 9 Lite', ' 1000', ' 120'],['Технически сложный ремонт', 'Mate 9 Lite', ' 1900', ' 120'],['Восстановление после попадания воды', 'Mate 9', ' 1300', ' 90'],['Замена аккумулятора', 'Mate 9', ' 1600', ' 75'],['Замена датчика приближения', 'Mate 9', ' 1600', ' 90'],['Замена динамика/звонка', 'Mate 9', ' 1350', ' 75'],['Замена дисплея', 'Mate 9', ' 3200', ' 90'],['Замена задней крышки', 'Mate 9', ' 2200', ' 75'],['Замена основной камеры', 'Mate 9', ' 2200', ' 75'],['Замена кнопки включения', 'Mate 9', ' 1300', ' 60'],['Замена микрофона', 'Mate 9', ' 1500', ' 75'],['Замена разъема зарядки/гарнитуры', 'Mate 9', ' 1350', ' 75'],['Замена шлейфа', 'Mate 9', ' 1500', ' 75'],['Программный ремонт/Обновление ПО', 'Mate 9', ' 1000', ' 120'],['Технически сложный ремонт', 'Mate 9', ' 1900', ' 120'],['Восстановление после попадания воды', 'Mate 8', ' 1250', ' 90'],['Замена аккумулятора', 'Mate 8', ' 1550', ' 75'],['Замена датчика приближения', 'Mate 8', ' 1500', ' 90'],['Замена динамика/звонка', 'Mate 8', ' 1350', ' 75'],['Замена дисплея', 'Mate 8', ' 2900', ' 90'],['Замена задней крышки', 'Mate 8', ' 2200', ' 75'],['Замена основной камеры', 'Mate 8', ' 1990', ' 75'],['Замена кнопки включения', 'Mate 8', ' 1300', ' 60'],['Замена микрофона', 'Mate 8', ' 1300', ' 75'],['Замена разъема зарядки/гарнитуры', 'Mate 8', ' 1300', ' 75'],['Замена шлейфа', 'Mate 8', ' 1400', ' 75'],['Программный ремонт/Обновление ПО', 'Mate 8', ' 1000', ' 120'],['Технически сложный ремонт', 'Mate 8', ' 1800', ' 120'],['Восстановление после попадания воды', 'Mate 20 X', ' 1300', ' 90'],['Замена аккумулятора', 'Mate 20 X', ' 1700', ' 75'],['Замена датчика приближения', 'Mate 20 X', ' 1600', ' 90'],['Замена динамика/звонка', 'Mate 20 X', ' 1500', ' 75'],['Замена дисплея', 'Mate 20 X', ' 7500', ' 90'],['Замена задней крышки', 'Mate 20 X', ' 1900', ' 75'],['Замена основной камеры', 'Mate 20 X', ' 2900', ' 75'],['Замена кнопки включения', 'Mate 20 X', ' 1300', ' 60'],['Замена микрофона', 'Mate 20 X', ' 1600', ' 75'],['Замена разъема зарядки/гарнитуры', 'Mate 20 X', ' 1600', ' 75'],['Замена шлейфа', 'Mate 20 X', ' 1600', ' 75'],['Программный ремонт/Обновление ПО', 'Mate 20 X', ' 1000', ' 120'],['Технически сложный ремонт', 'Mate 20 X', ' 1900', ' 120'],['Восстановление после попадания воды', 'Mate 20 RS Porsche Design ', ' 1300', ' 90'],['Замена аккумулятора', 'Mate 20 RS Porsche Design ', ' 1700', ' 75'],['Замена датчика приближения', 'Mate 20 RS Porsche Design ', ' 1600', ' 90'],['Замена динамика/звонка', 'Mate 20 RS Porsche Design ', ' 1500', ' 75'],['Замена дисплея', 'Mate 20 RS Porsche Design ', ' 12000', ' 90'],['Замена задней крышки', 'Mate 20 RS Porsche Design ', ' 1900', ' 75'],['Замена основной камеры', 'Mate 20 RS Porsche Design ', ' 2900', ' 75'],['Замена кнопки включения', 'Mate 20 RS Porsche Design ', ' 1400', ' 60'],['Замена микрофона', 'Mate 20 RS Porsche Design ', ' 1700', ' 75'],['Замена разъема зарядки/гарнитуры', 'Mate 20 RS Porsche Design ', ' 1600', ' 75'],['Замена шлейфа', 'Mate 20 RS Porsche Design ', ' 1600', ' 75'],['Программный ремонт/Обновление ПО', 'Mate 20 RS Porsche Design ', ' 1000', ' 120'],['Технически сложный ремонт', 'Mate 20 RS Porsche Design ', ' 1990', ' 120'],['Восстановление после попадания воды', 'Mate 20 Pro', ' 1300', ' 90'],['Замена аккумулятора', 'Mate 20 Pro', ' 1700', ' 75'],['Замена датчика приближения', 'Mate 20 Pro', ' 1600', ' 90'],['Замена динамика/звонка', 'Mate 20 Pro', ' 1500', ' 75'],['Замена дисплея', 'Mate 20 Pro', ' 10500', ' 90'],['Замена задней крышки', 'Mate 20 Pro', ' 1350', ' 75'],['Замена основной камеры', 'Mate 20 Pro', ' 2900', ' 75'],['Замена кнопки включения', 'Mate 20 Pro', ' 1450', ' 60'],['Замена микрофона', 'Mate 20 Pro', ' 1700', ' 75'],['Замена разъема зарядки/гарнитуры', 'Mate 20 Pro', ' 1600', ' 75'],['Замена шлейфа', 'Mate 20 Pro', ' 1600', ' 75'],['Программный ремонт/Обновление ПО', 'Mate 20 Pro', ' 1000', ' 120'],['Технически сложный ремонт', 'Mate 20 Pro', ' 1900', ' 120'],['Восстановление после попадания воды', 'Mate 20 lite', ' 1300', ' 90'],['Замена аккумулятора', 'Mate 20 lite', ' 1550', ' 75'],['Замена датчика приближения', 'Mate 20 lite', ' 1550', ' 90'],['Замена динамика/звонка', 'Mate 20 lite', ' 1450', ' 75'],['Замена дисплея', 'Mate 20 lite', ' 3130', ' 90'],['Замена задней крышки', 'Mate 20 lite', ' 1250', ' 75'],['Замена основной камеры', 'Mate 20 lite', ' 2200', ' 75'],['Замена кнопки включения', 'Mate 20 lite', ' 1200', ' 60'],['Замена микрофона', 'Mate 20 lite', ' 1350', ' 75'],['Замена разъема зарядки/гарнитуры', 'Mate 20 lite', ' 1350', ' 75'],['Замена шлейфа', 'Mate 20 lite', ' 1350', ' 75'],['Программный ремонт/Обновление ПО', 'Mate 20 lite', ' 1000', ' 120'],['Технически сложный ремонт', 'Mate 20 lite', ' 1800', ' 120'],['Восстановление после попадания воды', 'Mate 20', ' 1300', ' 90'],['Замена аккумулятора', 'Mate 20', ' 1650', ' 75'],['Замена датчика приближения', 'Mate 20', ' 1600', ' 90'],['Замена динамика/звонка', 'Mate 20', ' 1450', ' 75'],['Замена дисплея', 'Mate 20', ' 6350', ' 90'],['Замена задней крышки', 'Mate 20', ' 1450', ' 75'],['Замена основной камеры', 'Mate 20', ' 2550', ' 75'],['Замена кнопки включения', 'Mate 20', ' 1300', ' 60'],['Замена микрофона', 'Mate 20', ' 1450', ' 75'],['Замена разъема зарядки/гарнитуры', 'Mate 20', ' 1500', ' 75'],['Замена шлейфа', 'Mate 20', ' 1550', ' 75'],['Программный ремонт/Обновление ПО', 'Mate 20', ' 1000', ' 120'],['Технически сложный ремонт', 'Mate 20', ' 190', ' 120'],['Восстановление после попадания воды', 'Mate 10 Pro', ' 1200', ' 90'],['Замена аккумулятора', 'Mate 10 Pro', ' 1600', ' 75'],['Замена датчика приближения', 'Mate 10 Pro', ' 1500', ' 90'],['Замена динамика/звонка', 'Mate 10 Pro', ' 1350', ' 75'],['Замена дисплея', 'Mate 10 Pro', ' 10900', ' 90'],['Замена задней крышки', 'Mate 10 Pro', ' 1800', ' 75'],['Замена основной камеры', 'Mate 10 Pro', ' 2500', ' 75'],['Замена кнопки включения', 'Mate 10 Pro', ' 1300', ' 60'],['Замена микрофона', 'Mate 10 Pro', ' 1300', ' 75'],['Замена разъема зарядки/гарнитуры', 'Mate 10 Pro', ' 1500', ' 75'],['Замена шлейфа', 'Mate 10 Pro', ' 1550', ' 75'],['Программный ремонт/Обновление ПО', 'Mate 10 Pro', ' 1000', ' 120'],['Технически сложный ремонт', 'Mate 10 Pro', ' 1800', ' 120'],['Восстановление после попадания воды', 'Mate 10', ' 1200', ' 90'],['Замена аккумулятора', 'Mate 10', ' 1600', ' 75'],['Замена датчика приближения', 'Mate 10', ' 1500', ' 90'],['Замена динамика/звонка', 'Mate 10', ' 1350', ' 75'],['Замена дисплея', 'Mate 10', ' 3900', ' 90'],['Замена задней крышки', 'Mate 10', ' 1600', ' 75'],['Замена основной камеры', 'Mate 10', ' 2500', ' 75'],['Замена кнопки включения', 'Mate 10', ' 1250', ' 60'],['Замена микрофона', 'Mate 10', ' 1300', ' 75'],['Замена разъема зарядки/гарнитуры', 'Mate 10', ' 1500', ' 75'],['Замена шлейфа', 'Mate 10', ' 1550', ' 75'],['Программный ремонт/Обновление ПО', 'Mate 10', ' 1000', ' 120'],['Технически сложный ремонт', 'Mate 10', ' 1800', ' 120'],['Восстановление после попадания воды', 'GR5', ' 1100', ' 90'],['Замена аккумулятора', 'GR5', ' 1400', ' 75'],['Замена датчика приближения', 'GR5', ' 1200', ' 90'],['Замена динамика/звонка', 'GR5', ' 1200', ' 75'],['Замена дисплея', 'GR5', ' 2250', ' 90'],['Замена задней крышки', 'GR5', ' 1350', ' 75'],['Замена основной камеры', 'GR5', ' 1400', ' 75'],['Замена кнопки включения', 'GR5', ' 1150', ' 60'],['Замена микрофона', 'GR5', ' 1200', ' 75'],['Замена разъема зарядки/гарнитуры', 'GR5', ' 1250', ' 75'],['Замена шлейфа', 'GR5', ' 1200', ' 75'],['Программный ремонт/Обновление ПО', 'GR5', ' 1000', ' 120'],['Технически сложный ремонт', 'GR5', ' 1500', ' 120'],['Восстановление после попадания воды', 'Magic', ' 1250', ' 90'],['Замена аккумулятора', 'Magic', ' 1600', ' 75'],['Замена датчика приближения', 'Magic', ' 1600', ' 90'],['Замена динамика/звонка', 'Magic', ' 1450', ' 75'],['Замена дисплея', 'Magic', ' 13500', ' 90'],['Замена задней крышки', 'Magic', ' 2400', ' 75'],['Замена основной камеры', 'Magic', ' 2800', ' 75'],['Замена кнопки включения', 'Magic', ' 1400', ' 60'],['Замена микрофона', 'Magic', ' 1600', ' 75'],['Замена разъема зарядки/гарнитуры', 'Magic', ' 1650', ' 75'],['Замена шлейфа', 'Magic', ' 1650', ' 75'],['Программный ремонт/Обновление ПО', 'Magic', ' 1000', ' 120'],['Технически сложный ремонт', 'Magic', ' 1900', ' 120'],['Восстановление после попадания воды', 'GR3', ' 1000', ' 90'],['Замена аккумулятора', 'GR3', ' 1300', ' 75'],['Замена датчика приближения', 'GR3', ' 1200', ' 90'],['Замена динамика/звонка', 'GR3', ' 1150', ' 75'],['Замена дисплея', 'GR3', ' 2250', ' 90'],['Замена задней крышки', 'GR3', ' 1250', ' 75'],['Замена основной камеры', 'GR3', ' 1450', ' 75'],['Замена кнопки включения', 'GR3', ' 1150', ' 60'],['Замена микрофона', 'GR3', ' 1200', ' 75'],['Замена разъема зарядки/гарнитуры', 'GR3', ' 1250', ' 75'],['Замена шлейфа', 'GR3', ' 1200', ' 75'],['Программный ремонт/Обновление ПО', 'GR3', ' 1000', ' 120'],['Технически сложный ремонт', 'GR3', ' 1200', ' 120'],['Восстановление после попадания воды', 'G8', ' 1000', ' 90'],['Замена аккумулятора', 'G8', ' 1550', ' 75'],['Замена датчика приближения', 'G8', ' 1200', ' 90'],['Замена динамика/звонка', 'G8', ' 1150', ' 75'],['Замена дисплея', 'G8', ' 2290', ' 90'],['Замена задней крышки', 'G8', ' 1600', ' 75'],['Замена основной камеры', 'G8', ' 1600', ' 75'],['Замена кнопки включения', 'G8', ' 1150', ' 60'],['Замена микрофона', 'G8', ' 1250', ' 75'],['Замена разъема зарядки/гарнитуры', 'G8', ' 1250', ' 75'],['Замена шлейфа', 'G8', ' 1250', ' 75'],['Программный ремонт/Обновление ПО', 'G8', ' 1000', ' 120'],['Технически сложный ремонт', 'G8', ' 1300', ' 120'],['Восстановление после попадания воды', 'Enjoy 7 Plus', ' 1100', ' 90'],['Замена аккумулятора', 'Enjoy 7 Plus', ' 1500', ' 75'],['Замена датчика приближения', 'Enjoy 7 Plus', ' 1450', ' 90'],['Замена динамика/звонка', 'Enjoy 7 Plus', ' 1300', ' 75'],['Замена дисплея', 'Enjoy 7 Plus', ' 2600', ' 90'],['Замена задней крышки', 'Enjoy 7 Plus', ' 1500', ' 75'],['Замена основной камеры', 'Enjoy 7 Plus', ' 1900', ' 75'],['Замена кнопки включения', 'Enjoy 7 Plus', ' 1200', ' 60'],['Замена микрофона', 'Enjoy 7 Plus', ' 1250', ' 75'],['Замена разъема зарядки/гарнитуры', 'Enjoy 7 Plus', ' 1350', ' 75'],['Замена шлейфа', 'Enjoy 7 Plus', ' 1350', ' 75'],['Программный ремонт/Обновление ПО', 'Enjoy 7 Plus', ' 1000', ' 120'],['Технически сложный ремонт', 'Enjoy 7 Plus', ' 1600', ' 120'],['Восстановление после попадания воды', 'Enjoy 7', ' 1100', ' 90'],['Замена аккумулятора', 'Enjoy 7', ' 1500', ' 75'],['Замена датчика приближения', 'Enjoy 7', ' 1400', ' 90'],['Замена динамика/звонка', 'Enjoy 7', ' 1250', ' 75'],['Замена дисплея', 'Enjoy 7', ' 2600', ' 90'],['Замена задней крышки', 'Enjoy 7', ' 1450', ' 75'],['Замена основной камеры', 'Enjoy 7', ' 1800', ' 75'],['Замена кнопки включения', 'Enjoy 7', ' 1200', ' 60'],['Замена микрофона', 'Enjoy 7', ' 1250', ' 75'],['Замена разъема зарядки/гарнитуры', 'Enjoy 7', ' 1350', ' 75'],['Замена шлейфа', 'Enjoy 7', ' 1350', ' 75'],['Программный ремонт/Обновление ПО', 'Enjoy 7', ' 1000', ' 120'],['Технически сложный ремонт', 'Enjoy 7', ' 1500', ' 120'],['Восстановление после попадания воды', 'Enjoy 6', ' 1100', ' 90'],['Замена аккумулятора', 'Enjoy 6', ' 1500', ' 75'],['Замена датчика приближения', 'Enjoy 6', ' 1300', ' 90'],['Замена динамика/звонка', 'Enjoy 6', ' 1200', ' 75'],['Замена дисплея', 'Enjoy 6', ' 2500', ' 90'],['Замена задней крышки', 'Enjoy 6', ' 1450', ' 75'],['Замена основной камеры', 'Enjoy 6', ' 1800', ' 75'],['Замена кнопки включения', 'Enjoy 6', ' 1150', ' 60'],['Замена микрофона', 'Enjoy 6', ' 1250', ' 75'],['Замена разъема зарядки/гарнитуры', 'Enjoy 6', ' 1250', ' 75'],['Замена шлейфа', 'Enjoy 6', ' 1200', ' 75'],['Программный ремонт/Обновление ПО', 'Enjoy 6', ' 1000', ' 120'],['Технически сложный ремонт', 'Enjoy 6', ' 1500', ' 120'],['Восстановление после попадания воды', 'Ascend Y635', ' 1000', ' 90'],['Замена аккумулятора', 'Ascend Y635', ' 1100', ' 75'],['Замена датчика приближения', 'Ascend Y635', ' 1200', ' 90'],['Замена динамика/звонка', 'Ascend Y635', ' 1150', ' 75'],['Замена дисплея', 'Ascend Y635', ' 1900', ' 90'],['Замена задней крышки', 'Ascend Y635', ' 1350', ' 75'],['Замена основной камеры', 'Ascend Y635', ' 1500', ' 75'],['Замена кнопки включения', 'Ascend Y635', ' 1150', ' 60'],['Замена микрофона', 'Ascend Y635', ' 1150', ' 75'],['Замена разъема зарядки/гарнитуры', 'Ascend Y635', ' 1250', ' 75'],['Замена шлейфа', 'Ascend Y635', ' 1200', ' 75'],['Программный ремонт/Обновление ПО', 'Ascend Y635', ' 1000', ' 120'],['Технически сложный ремонт', 'Ascend Y635', ' 1300', ' 120'],['Восстановление после попадания воды', 'Ascend Y550', ' 1000', ' 90'],['Замена аккумулятора', 'Ascend Y550', ' 1100', ' 75'],['Замена датчика приближения', 'Ascend Y550', ' 1200', ' 90'],['Замена динамика/звонка', 'Ascend Y550', ' 1150', ' 75'],['Замена дисплея', 'Ascend Y550', ' 1800', ' 90'],['Замена задней крышки', 'Ascend Y550', ' 1350', ' 75'],['Замена основной камеры', 'Ascend Y550', ' 1400', ' 75'],['Замена кнопки включения', 'Ascend Y550', ' 1150', ' 60'],['Замена микрофона', 'Ascend Y550', ' 1150', ' 75'],['Замена разъема зарядки/гарнитуры', 'Ascend Y550', ' 1200', ' 75'],['Замена шлейфа', 'Ascend Y550', ' 1200', ' 75'],['Программный ремонт/Обновление ПО', 'Ascend Y550', ' 1000', ' 120'],['Технически сложный ремонт', 'Ascend Y550', ' 1300', ' 120'],['Восстановление после попадания воды', 'Ascend Y520', ' 1000', ' 90'],['Замена аккумулятора', 'Ascend Y520', ' 1100', ' 75'],['Замена датчика приближения', 'Ascend Y520', ' 1100', ' 90'],['Замена динамика/звонка', 'Ascend Y520', ' 1150', ' 75'],['Замена дисплея', 'Ascend Y520', ' 1800', ' 90'],['Замена задней крышки', 'Ascend Y520', ' 1300', ' 75'],['Замена основной камеры', 'Ascend Y520', ' 1400', ' 75'],['Замена кнопки включения', 'Ascend Y520', ' 1150', ' 60'],['Замена микрофона', 'Ascend Y520', ' 1150', ' 75'],['Замена разъема зарядки/гарнитуры', 'Ascend Y520', ' 1200', ' 75'],['Замена шлейфа', 'Ascend Y520', ' 1200', ' 75'],['Программный ремонт/Обновление ПО', 'Ascend Y520', ' 1000', ' 120'],['Технически сложный ремонт', 'Ascend Y520', ' 1300', ' 120'],['Восстановление после попадания воды', 'Ascend Y5', ' 1000', ' 90'],['Замена аккумулятора', 'Ascend Y5', ' 1100', ' 75'],['Замена датчика приближения', 'Ascend Y5', ' 1100', ' 90'],['Замена динамика/звонка', 'Ascend Y5', ' 1150', ' 75'],['Замена дисплея', 'Ascend Y5', ' 1650', ' 90'],['Замена задней крышки', 'Ascend Y5', ' 1200', ' 75'],['Замена основной камеры', 'Ascend Y5', ' 1400', ' 75'],['Замена кнопки включения', 'Ascend Y5', ' 1150', ' 60'],['Замена микрофона', 'Ascend Y5', ' 1150', ' 75'],['Замена разъема зарядки/гарнитуры', 'Ascend Y5', ' 1200', ' 75'],['Замена шлейфа', 'Ascend Y5', ' 1200', ' 75'],['Программный ремонт/Обновление ПО', 'Ascend Y5', ' 1000', ' 120'],['Технически сложный ремонт', 'Ascend Y5', ' 1300', ' 120'],['Восстановление после попадания воды', 'Ascend Y360', ' 1000', ' 90'],['Замена аккумулятора', 'Ascend Y360', ' 1100', ' 75'],['Замена датчика приближения', 'Ascend Y360', ' 1100', ' 90'],['Замена динамика/звонка', 'Ascend Y360', ' 1150', ' 75'],['Замена дисплея', 'Ascend Y360', ' 1650', ' 90'],['Замена задней крышки', 'Ascend Y360', ' 1100', ' 75'],['Замена основной камеры', 'Ascend Y360', ' 1230', ' 75'],['Замена кнопки включения', 'Ascend Y360', ' 1150', ' 60'],['Замена микрофона', 'Ascend Y360', ' 1150', ' 75'],['Замена разъема зарядки/гарнитуры', 'Ascend Y360', ' 1200', ' 75'],['Замена шлейфа', 'Ascend Y360', ' 1200', ' 75'],['Программный ремонт/Обновление ПО', 'Ascend Y360', ' 1000', ' 120'],['Технически сложный ремонт', 'Ascend Y360', ' 1300', ' 120'],['Восстановление после попадания воды', 'Ascend G7 Plus', ' 1000', ' 90'],['Замена аккумулятора', 'Ascend G7 Plus', ' 1100', ' 75'],['Замена датчика приближения', 'Ascend G7 Plus', ' 1100', ' 90'],['Замена динамика/звонка', 'Ascend G7 Plus', ' 1150', ' 75'],['Замена дисплея', 'Ascend G7 Plus', ' 2190', ' 90'],['Замена задней крышки', 'Ascend G7 Plus', ' 1450', ' 75'],['Замена основной камеры', 'Ascend G7 Plus', ' 1500', ' 75'],['Замена кнопки включения', 'Ascend G7 Plus', ' 1200', ' 60'],['Замена микрофона', 'Ascend G7 Plus', ' 1150', ' 75'],['Замена разъема зарядки/гарнитуры', 'Ascend G7 Plus', ' 1200', ' 75'],['Замена шлейфа', 'Ascend G7 Plus', ' 1250', ' 75'],['Программный ремонт/Обновление ПО', 'Ascend G7 Plus', ' 1000', ' 120'],['Технически сложный ремонт', 'Ascend G7 Plus', ' 1300', ' 120'],];

let priceServicePhoneDefault = [["Диагностика","от 150","от 2 ч до 1 дня"],["Замена камеры","от 700","от 6 ч до 1 дня"],["Замена микрофона/динамика/звонка","от 700","от 2 ч до 1 дня"],["Замена аккумулятора","от 600","от 2 ч до 1 дня"],["Восстановление после попадания воды","от 550","от 2 ч до 1 дня"],["Замена кнопки включения","от 700","от 2 ч до 1 дня"],["Замена задней крышки/корпуса в сборе","от 600","от 2 ч до 1 дня"],["Замена разъема питания/гарнитуры","от 700","от 2 ч до 1 дня"],["Замена шлейфа/кнопки home","от 700","от 2 ч до 1 дня"],["Программный ремонт/Обновление ПО/Разблокировка","от 500","от 2 ч до 1 дня"],["Технически сложный ремонт","от 1200","от 2 ч до 1 дня"],["Замена стекла (touch screen)","от 700","от 2 ч до 1 дня"]];

let priceServiceLaptopDefault = [["Чистка ноутбука","от 500","от 5 ч до 2 дней"],["Замена камеры","от 700","от 6 ч до 1 дня"],["Восстановление после падения","от 1200","от 5 ч до 2 дней"],["Восстановление после воды, падения","от 1000","от 5 ч до 2 дней"],["Замена видеокарты","от 1500","от 5 ч до 2 дней"],["Ремонт видеокарты","от 1500","от 5 ч до 2 дней"],["Ремонт платы","от 1200","от 5 ч до 2 дней"],["Диагностика","от 500","5 ч до 2 дней"],["Замена матрицы ноутбука","от 700","от 5 ч до 2 дней"],["Замена разъемов","от 900","от 5 ч до 2 дней"],["Замена разъема зарядки/usb","от 950","от 5 ч до 2 дней"],["Ремонт клавиатуры","от 1200","от 5 ч до 2 дней"],["Замена клавиатуры","от 700","от 5 ч до 2 дней"]];

let priceServiceTabletDefault = [["Программный ремонт/Обновление ПО/Разблокировка","от 850","от 6 ч до 2 дней"],["Замена шлейфа/кнопки home","от 1190","от 6 ч до 2 дней"],["Замена стекла (touch screen)","от 1190","от 6 ч до 2 дней"],["Замена разъема питания/гарнитуры","от 1190","от 6 ч до 2 дней"],["Замена кнопки включения","от 1360","от 6 ч до 2 дней"],["Замена задней крышки/корпуса в сборе","от 1020","от 6 ч до 2 дней"],["Технически сложный ремонт","от 2040","от 6 ч до 2 дней"],["Диагностика","от 255","от 6 ч до 2 дней"],["Восстановление после попадания воды","от 935","от 6 ч до 2 дней"],["Замена аккумулятора","от 1020","от 6 ч до 2 дней"],["Замена микрофона/динамика/звонка","от 1190","от 6 ч до 2 дней"],["Замена камеры","от 1190","от 6 ч до 2 дней"]];



$(document).ready( function () {
  let ua = window.navigator.userAgent;
  let msie = ua.indexOf("MSIE ");
  let heightModel = '';
  let modelWindow_check = '';
  let priceDevice_check = 'Телефон';
  let priceModel_check = '';
  let price_check = '';
  let model_check = false;
  let metrika_chek = '';

  let nodeJob_status = '';

  const btnPrevNavBar = $("#carouselLeftNavBarMobile");
  const btnNextNavBar = $("#carouselRightNavBarMobile");

  let valNavBar = 1;
  btnNextNavBar.click(function(){

    valNavBar++;

    if(valNavBar <= 3){
      $(".navBar > ul > li").css({
        "display" : "none",
      });
      $(".navBar > ul > li:nth-of-type("+valNavBar+")").css({
        "display" : "grid",
      });
    }
    else{
      valNavBar--;
    }

  });
  btnPrevNavBar.click(function(){

    valNavBar--;

    if(valNavBar >= 1){
      $(".navBar > ul > li").css({
        "display" : "none",
      });
      $(".navBar > ul > li:nth-of-type("+valNavBar+")").css({
        "display" : "grid",
      });
    }
    else{
      valNavBar++;
    }

  });

  function deviceSelectedActions(typedevice){
    switch (typedevice) {
      case "Телефон":
        $('.deviceSelectedImages').removeClass('deviceSelectedImagesActive');
        $('.deviceSelectedPhone').addClass('deviceSelectedImagesActive');
        break;
      case "Ноутбук":
        $('.deviceSelectedImages').removeClass('deviceSelectedImagesActive');
        $('.deviceSelectedLaptop').addClass('deviceSelectedImagesActive');
        break;
      case "Планшет":
        $('.deviceSelectedImages').removeClass('deviceSelectedImagesActive');
        $('.deviceSelectedTablet').addClass('deviceSelectedImagesActive');
        break;
      default:
        return false;
    }
  }
  function addPriceService(array){
    $('.priceMainContent section').empty();
    if (priceDevice_check == 'Планшет' || priceDevice_check == 'Ноутбук' || (priceDevice_check == 'Телефон' && priceModel_check == '')) {
      array.forEach((item, i) => {
        $('.priceMainContent section').append('<div class="priceBox"><span class="titlePriceBox">'+item[0]+'</span>'+'<span class="dedlaine">'+item[2]+'</span>'+'<span class="price">'+item[1]+' ₽</span></div>');
      });
    }
    else{
      array.forEach((item, i) => {

        if (item[1] == priceModel_check) {
          if (item[0] == 'Восстановление после попадания воды') {
            $('.priceMainContent section').append('<div class="priceBox"><span class="titlePriceBox">'+item[0]+'</span>'+'<span class="dedlaine">'+item[3]+' минут</span>'+'<span class="price">От '+(+item[2]+500)+' ₽</span></div>');
            return;
          }
          $('.priceMainContent section').append('<div class="priceBox"><span class="titlePriceBox">'+item[0]+'</span>'+'<span class="dedlaine">'+item[3]+' минут</span>'+'<span class="price">От '+(+item[2]+500)+' ₽</span></div>');
        }
      });
    }
  }
  function sendAjaxForm(url) {
      $.ajax({
          url:     url, //url страницы (action_ajax_form.php)
          type:     "POST", //метод отправки
          dataType: "html", //формат данных
          data: "name="+$("#firstNameId").val()+" "+$("#nameId").val()+" "+$("#lastNameId").val()+"&tel="+$("#telId").val()+"&nodeJob="+nodeJob_status+"&desp="+$("#descId").val()+"&type="+priceDevice_check+"&brand=Huawei&model="+priceModel_check+"&service="+$("#service_title").text()+"&priceService="+price_check,  // Сеарилизуем объект
          success: function() { //Данные отправлены успешно
            priceModel_check='';
            $('.modelCheck').text('Модель не выбрана');
            switch (metrika_chek) {
              case 'click_perezvonit':
                ym(67091065,'reachGoal','otpravka_perezvonit');
                break;
              case 'zakazat_remont':
                ym(67091065,'reachGoal','zakazat_remont_otpravlen');
                break;
              case 'zakaz_uslugi':
                ym(67091065,'reachGoal','zakaz_uslugi_otpravlen');
                break;
              case 'razbor_otpravlen':
                ym(67091065,'reachGoal','razbor_otpravlen');
                break;
              default:
                return false;
            }
            $('.popup-fade').fadeIn(200);
            $('.popup').hide();
            $('.popup_success').fadeIn(200);
        },
        error: function(response) { // Данные не отправлены
          alert("Что то пошло не так, повторите попытку позже");
        }
    });
  }
  function sendAjaxFormConsult(url, name, tel) {
      $.ajax({
          url:     url, //url страницы (action_ajax_form.php)
          type:     "POST", //метод отправки
          dataType: "html", //формат данных
          data: "name="+name+"&tel="+tel+"&brand=Huawei&nodeJob="+nodeJob_status,  // Сеарилизуем объект
          success: function(data) { //Данные отправлены успешно
            priceModel_check='';
            $('.modelCheck').text('Модель не выбрана');
            switch (metrika_chek) {
              case 'zaberem_iz_doma':
                ym(67091065,'reachGoal','otpravka_perezvonit');
                break;
              case 'konsultacia':
                ym(67091065,'reachGoal','zakazat_remont_otpravlen');
                break;
              default:
                return false;
            }
            $('.popup').hide();
            $('.popup_success').fadeIn();
        		$('.popup-fade').fadeIn(100);
            $('input[name=homeOrderFormTel]').val("");
            $('input[name=homeOrderFormName]').val("");
            someFunction( data );
            return data;

        },
        error: function(response) { // Данные не отправлены
          alert("Что то пошло не так, повторите попытку позже");
        }
    });
  }
 function someFunction(data) {
   $(".menu").text(data);
 }


  arrayModel.forEach((item, i) => {
    $('.modelMainContent section').append('<div class="modelBox"><span class="titleModelBox">'+item[1]+'</span>'+'<img src="img/Huawei/huawei/'+item[1].trim().toLowerCase().replace(/[^a-zA-Z0-9 -]/, "").replace(/\s/g, "-")+'.png" class="img_modelBox"></div>');
  });



  addPriceService(priceServicePhoneDefault);


    $(".modelBox").mouseenter(function(){
    if(!(/iPhone|iPad|iPod|Android/i.test(navigator.userAgent)) || !(window.matchMedia('(max-width: 860px)').matches)){
      $(this).children(".img_modelBox").animate({
  	      "margin-bottom": "10px", // высота элемента
  	   }, 200);
     }
    });
    $(".modelBox").mouseleave(function(){
      if(!(/iPhone|iPad|iPod|Android/i.test(navigator.userAgent)) || !(window.matchMedia('(max-width: 860px)').matches)){
      $(this).children(".img_modelBox").animate({
  	      "margin-bottom": "-30px", // высота элемента
  	   }, 200);
     }
    });

    $(window).scroll(function(){
      if(/iPhone|iPad|iPod|Android/i.test(navigator.userAgent) || window.matchMedia('(max-width: 860px)').matches){
        if($(window).scrollTop() > 200){
          $('.headerTop').css({
            "grid-template-rows" : "40px 1fr auto",
          });
        }
        else{
          $('.headerTop').css({
            "grid-template-rows" : "60px 1fr auto",
          });
        }
      }
    });


  $(window).resize(function() {
    if($(".bg_navBar").width() > 426){
      $(".navBar > ul > li").css({
        "display" : "grid",
      });
    }
    if($(".bg_navBar").width() < 426){
      $(".navBar > ul > li").css({
        "display" : "none",
      });
      $(".navBar > ul > li:nth-of-type(1)").css({
        "display" : "grid",
      });
    }
  });

  $('.collapseMenu').click(function(){
    if($('.menu').css('display') == 'grid'){
      $('.menu').hide(400);
    }
    else if($('.menu').css('display') == 'none'){

        $('.menu').show(400, function(){
          $('.menu').css({
            'display': 'grid'
          });
        });
    }
  });

  $('#collapseContactHeaderId').click(function(){
    if($('#contactHeaderId').css('display') == 'grid'){
      $('#contactHeaderId').hide(400);
    }
    else if($('#contactHeaderId').css('display') == 'none'){
        $('#contactHeaderId').show({
          duration: 400,
          options: "start",
          complete: function(){
            $('#contactHeaderId').css({
              'display': 'grid'
            });
          }});
    }});

    $('input[name=homeOrderFormTel]').inputmask("+7(999)999-9999");
    $('input[name=homeOrderFormSubmit]').click(
      function() {
        if ($(this).attr('id') == 'homeOrderFormSubmitId homeOrderFormSubmit1') {
          nodeJob_status = 'Забрать у клиента';
          metrika_chek = 'zaberem_iz_doma';
        }
        else if($(this).attr('id') == 'homeOrderFormSubmitId homeOrderFormSubmit2') {
          nodeJob_status = 'Консультация';
          metrika_chek = 'konsultacia';
        }
        let valtel = $(this).siblings('input[name=homeOrderFormTel]').val();
        let valName = $(this).siblings('input[name=homeOrderFormName]').val();
        let reges = /^(\+)?(\(\d{2,3}\) ?\d|\d)(([ \-]?\d)|( ?\(\d{2,3}\) ?)){5,12}\d$/;

        if(valName.length >= 1 && reges.test(valtel)){
          sendAjaxFormConsult('obrabotchik.php', valName, valtel);
        }

        if(valName.length < 1){
          $(this).siblings('input[name=homeOrderFormName]').css({"border" : " 1px solid red",});
        }
        else{
          $(this).siblings('input[name=homeOrderFormName]').css({"border" : "none"});
        }

        if(!(reges.test(valtel))){
          $(this).siblings('input[name=homeOrderFormTel]').css({"border" : " 1px solid red",});
        }
        else{
          $(this).siblings('input[name=homeOrderFormTel]').css({"border" : "none"});
        }
      }
    );

    $('#telId').inputmask("+7(999)999-9999");
    $("#btnSend").click(
      function(){
        let valName = $('#nameId').val();
        let valFirstName = $('#firstNameId').val();
        let valtel = $('#telId').val();
        let valDataProcessing = $('#dataProcessingId').val();
        let reges = /^(\+)?(\(\d{2,3}\) ?\d|\d)(([ \-]?\d)|( ?\(\d{2,3}\) ?)){5,12}\d$/;

        if(valName.length >= 1 && reges.test(valtel) && $('#dataProcessingId').is(":checked") && valFirstName.length >= 1){
          sendAjaxForm('obrabotchik.php');
        }

        if(valName.length < 1){
          $('#nameId').css({"border-color" : "red"});
        }
        else{
          $('#nameId').css({"border-color" : "#BDBDBD"});
        }

        if(valFirstName.length < 1){
          $('#firstNameId').css({"border-color" : "red"});
        }
        else{
          $('#firstNameId').css({"border-color" : "#BDBDBD"});
        }

        if(!(reges.test(valtel))){
          $('#telId').css({"border-color" : "red"});
        }
        else{
          $('#telId').css({"border-color" : "#BDBDBD"});
        }

        if(!($('#dataProcessingId').is(":checked"))){
          $('#dataProcessingId + label').css({"color" : "red"});
        }
        else{
          $('#dataProcessingId + label').css({"color" : "#BDBDBD"});
        }
        return false;
      }
    );

    $('.deviceSelectedImages').click(function() {
      switch($(this).attr('id')) {
        case 'deviceSelectedPhoneId':
          priceDevice_check = 'Телефон';
          deviceSelectedActions(priceDevice_check);
          if (priceModel_check != '') {
            addPriceService(priceService);
            $('.modelCheck').text(priceModel_check);
            break
          }
          addPriceService(priceServicePhoneDefault);
          $('.modelCheck').text('Модель не выбрана');
          break
        case 'deviceSelectedLaptopId':
          priceDevice_check = 'Ноутбук';
          addPriceService(priceServiceLaptopDefault);
          deviceSelectedActions(priceDevice_check);
          $('.modelCheck').text('Модель не выбрана');
          break
        case 'deviceSelectedTabletId':
          priceDevice_check = 'Планшет';
          addPriceService(priceServiceTabletDefault);
          deviceSelectedActions(priceDevice_check);
          $('.modelCheck').text('Модель не выбрана');
          break
        default:
          return false;
      }
    });

    $(".modelBox").click(function(){
      priceModel_check = $(this).children('.titleModelBox').text();
      $('.modelCheck').text(priceModel_check);

      arrayModel.forEach((item, i) => {
        if (item[1] == priceModel_check) {
          priceDevice_check = item[0];
        }
      });
      addPriceService(priceService);
      deviceSelectedActions(priceDevice_check);
      let titleModel = $(this).children(".titleModelBox").text().trim().toLowerCase().replace(/[^a-zA-Z0-9 -]/, "").replace(/\s/g, "-");
      location.href = '#priceMainContentHref';
      location.href = '#model-'+titleModel;
    });

    $(document).on("click", ".searchModelItem", function(){
      priceModel_check = $(this).text();
      $('.modelCheck').text(priceModel_check);

      arrayModel.forEach((item) => {
          if (item[1] == priceModel_check) {
              priceDevice_check = item[0];
          }
      });

      addPriceService(priceService);

      deviceSelectedActions(priceDevice_check);

      let titleModel = $(this).text().trim().toLowerCase().replace(/[^a-zA-Z0-9 -]/, "").replace(/\s/g, "-");

      location.href = '#priceMainContentHref';
      location.href = '#model-'+titleModel;
      $("#js-search").val("");
      $(".searchModelItems").slideUp();
    });

    $(window).scroll(function(){
        if($(window).scrollTop() > 800){
          $('#upPage').fadeIn(200);
        }
        else if($(window).scrollTop() <= 800){
          $('#upPage').hide(200);
        }
    });

    $('#upPage').click(function() {
  		$('html, body').animate({scrollTop: 0},200);
  		return false;
  	})

    $(document).on("click", '#order, .titleInfoBoxDestroy, .priceBox, .contact', function() {
      switch($(this).attr('class')) {
        case 'orderSubmit':
          ym(67091065,'reachGoal','zakazat_remont');
          metrika_chek = 'zakazat_remont';
          nodeJob_status = 'Заявка на ремонт';
          $('.popup_form_input_desc').css({'display' : 'flex'});
          modelWindow_check = '.popup_form_input_desc';
          break;

        case 'titleInfoBoxDestroy':
          metrika_chek = 'razbor_otpravlen';
          nodeJob_status = 'Заявка на разбор телефона';
          $('.popup_form_dropdown_loyaut').css({'display' : 'grid'});
          modelWindow_check = '.popup_form_dropdown_loyaut';
          break;

        case 'priceBox':
          ym(67091065,'reachGoal','zakaz_uslugi');
          metrika_chek = 'zakaz_uslugi';
          nodeJob_status = 'Заявка на ремонт';
          $('.popup_form_service_loyaut').css({'display' : 'flex'});
          $('#service_title').append($(this).children(".titlePriceBox").text());
          if (priceModel_check == '') {
            $('#service_device_device').append(priceDevice_check+', ');
          }
          else {
            $('#service_device_device').append(priceModel_check+', ');
          }
          $('#service_device_cost').append($(this).children(".price").text());
          modelWindow_check = '.popup_form_service_loyaut';
          price_check = $(this).children('.price').text();
          break;

        case 'contact':
          ym(67091065,'reachGoal','click_perezvonit');
          metrika_chek = 'click_perezvonit';
          nodeJob_status = 'Консультация';
          break;

        default:
          return false;
      }
      $('.popup').fadeIn();
      $('.popup_success').hide();
  		$('.popup-fade').fadeIn(100);
  		return false;
    });
    // Клик по ссылке "Закрыть".
    $('.closes').click(function() {
      $(modelWindow_check).hide();
      $(this).parents('.popup-fade').fadeOut(100);
      $('#service_title').empty();
      $('#service_device_device').empty();
      $('#service_device_cost').empty();
      modelWindow_check='';
      price_check='';
      return false;
    });
    // Закрытие по клавише Esc.
    $(document).keydown(function(e) {
      if (e.keyCode === 27) {
        e.stopPropagation();
        $('.popup-fade').fadeOut(100);
        $(modelWindow_check).hide();
        $('#service_title').empty();
        $('#service_device_device').empty();
        $('#service_device_cost').empty();
        modelWindow_check='';
        price_check='';
      }

    });
    // Клик по фону, но не по окну.
    $('.popup-fade').click(function(e) {
      if ($(e.target).closest('.popup').length == 0 && $(e.target).closest('.popup_success').length == 0) {
        $(this).fadeOut(100);
        $(modelWindow_check).hide();
        $('#service_title').empty();
        $('#service_device_device').empty();
        $('#service_device_cost').empty();
        modelWindow_check='';
        price_check='';
      }
    });
    $('select[name=device]').change(function() {
      $('select[name=model]').empty();
      $('select[name=model]').append('<option selected disabled >-</option>');
      let items = $(this).val();
      arrayModel.forEach((item, i) => {
        if (item[0] == items) {
          $('select[name=model]').append('<option value="'+item[1]+'">'+item[1]+'</option>')
        }
      });
      priceDevice_check = $(this).val();
    });
    $('select[name=model]').change(function() {
      priceModel_check = $(this).val();
    });

    $('.slider').slick({
      slidesToShow: 3,
      slidesToScroll: 1,
      responsive: [
        {
          breakpoint: 1050,
          settings: {
            slidesToShow: 2,
            slidesToScroll: 1,
          }
        },
        {
          breakpoint: 700,
          settings: {
            slidesToShow: 1,
            slidesToScroll: 1,
          }
        },
        {
          breakpoint: 426,
          settings: {
            slidesToShow: 1,
            slidesToScroll: 1,
            arrows: false,
            centerMode: true,
            variableWidth: true
          }
        },
      ]
    });

    $('.sliderNavBar').slick({
      slidesToShow: 3,
      responsive: [
        {
          breakpoint: 1050,
          settings: {
            slidesToShow: 2,
            slidesToScroll: 1,
          }
        },
        {
          breakpoint: 700,
          settings: {
            slidesToShow: 1,
            slidesToScroll: 1
          }
        }
      ]
    });

    $('.trackComment').slick({
      slidesToShow: 3,
      slidesToScroll: 1,
      responsive: [
        {
          breakpoint: 1330,
          settings: {
            slidesToShow: 2,
            slidesToScroll: 1,
          }
        },
        {
          breakpoint: 860,
          settings: {
            slidesToShow: 1,
            slidesToScroll: 1
          }
        }
      ]
    });


});
